/* automatically generated by rust-bindgen 0.72.1 */

pub const CEF_API_VERSION: u32 = 15000;
pub const CEF_API_VERSION_13300: u32 = 13300;
pub const CEF_API_HASH_13300: &[u8; 41] = b"45d39c3669ba75467e3e609f626c31506c0eae22\0";
pub const CEF_API_VERSION_13301: u32 = 13301;
pub const CEF_API_HASH_13301: &[u8; 41] = b"7109702038d51512d35dd2ed77231f9100e38214\0";
pub const CEF_API_VERSION_13302: u32 = 13302;
pub const CEF_API_HASH_13302: &[u8; 41] = b"18799961f4461a9cbae2aed89ac04b73ab7c37f3\0";
pub const CEF_API_VERSION_13303: u32 = 13303;
pub const CEF_API_HASH_13303: &[u8; 41] = b"20016fd6a9b87ef4c539cd1f42bf1ca09b6903ca\0";
pub const CEF_API_VERSION_13304: u32 = 13304;
pub const CEF_API_HASH_13304: &[u8; 41] = b"19c014af0082aa901398e006381b6980e4f806e9\0";
pub const CEF_API_VERSION_13400: u32 = 13400;
pub const CEF_API_HASH_13400: &[u8; 41] = b"6ab74b90e88b7397aab9911baac5484f12466eef\0";
pub const CEF_API_VERSION_13401: u32 = 13401;
pub const CEF_API_HASH_13401: &[u8; 41] = b"751255204f006b8b883a8baf552a2da792f8aa44\0";
pub const CEF_API_VERSION_13500: u32 = 13500;
pub const CEF_API_HASH_13500: &[u8; 41] = b"3e78b6fe5fd31d69049499450849ada17a720a53\0";
pub const CEF_API_VERSION_13600: u32 = 13600;
pub const CEF_API_HASH_13600: &[u8; 41] = b"a8832519b4eb058567d68b65be1e1c9e80aae566\0";
pub const CEF_API_VERSION_13601: u32 = 13601;
pub const CEF_API_HASH_13601: &[u8; 41] = b"116a4153047ee1ee67f17fc938f084ee72b24e54\0";
pub const CEF_API_VERSION_13700: u32 = 13700;

pub const CEF_API_VERSION_14400: u32 = 14400;
pub const CEF_API_HASH_14400: &[u8; 41] = b"430d1c4e4c958b53a8e383db3a5a38037ca9f51e\0";
pub const CEF_API_VERSION_14500: u32 = 14500;
pub const CEF_API_HASH_14500: &[u8; 41] = b"fd311ad9c02d2063d20e6fa3601d66229089b69f\0";
pub const CEF_API_VERSION_14600: u32 = 14600;
pub const CEF_API_HASH_14600: &[u8; 41] = b"99676a8d58951ffb0a24f6cbae6aa01f3249b29e\0";
pub const CEF_API_VERSION_14700: u32 = 14700;
pub const CEF_API_HASH_14700: &[u8; 41] = b"1cf33dbf355efffcd993ab4d2ea391e6631f95f2\0";
pub const CEF_API_VERSION_14800: u32 = 14800;
pub const CEF_API_HASH_14800: &[u8; 41] = b"a9fddb1f86f1fc427a6eee19a370dbedb14468cb\0";
pub const CEF_API_VERSION_14900: u32 = 14900;
pub const CEF_API_HASH_14900: &[u8; 41] = b"de5114c34e4c0c3d725313c38f4ed5b18cbfdeb4\0";
pub const CEF_API_VERSION_15000: u32 = 15000;
pub const CEF_API_HASH_15000: &[u8; 41] = b"71146b4350a01d3805e7ea990eb034e6ef4d53db\0";
pub const CEF_API_VERSION_999998: u32 = 999998;
pub const CEF_API_HASH_999998: &[u8; 41] = b"71146b4350a01d3805e7ea990eb034e6ef4d53db\0";
pub const CEF_API_VERSION_999999: u32 = 999999;
pub const CEF_API_HASH_999999: &[u8; 41] = b"c63591fb321ac707f8710f296a8ae1ec05a575db\0";
pub const CEF_API_VERSION_MIN: u32 = 13300;
pub const CEF_API_VERSION_LAST: u32 = 15000;
pub const CEF_API_VERSION_EXPERIMENTAL: u32 = 999999;
pub const CEF_API_VERSION_NEXT: u32 = 999998;
pub const CEF_NEXT: u32 = 999998;
pub const CEF_EXPERIMENTAL: u32 = 999999;
pub const CEF_VERSION: &[u8; 42] = b"150.0.11+gb887805+chromium-150.0.7871.115\0";
pub const CEF_VERSION_MAJOR: u32 = 150;
pub const CEF_VERSION_MINOR: u32 = 0;
pub const CEF_VERSION_PATCH: u32 = 11;
pub const CEF_COMMIT_NUMBER: u32 = 3544;
pub const CEF_COMMIT_HASH: &[u8; 41] = b"b88780525f76c1c1d67d30b87e3b16bb37955175\0";
pub const CEF_SANDBOX_COMPAT_HASH: &[u8; 17] = b"6c5b35ad81055c14\0";
pub const CEF_STRING_TYPE_UTF16: u32 = 1;
unsafe extern "C" {
    pub fn cef_api_hash(
        version: ::std::os::raw::c_int, entry: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn cef_api_version() -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_ushort;
pub type __time64_t = ::std::os::raw::c_longlong;
pub type time_t = __time64_t;
unsafe extern "C" {
    pub fn cef_version_info(entry: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_version_info_t {
    pub size: usize,
    pub cef_version_major: ::std::os::raw::c_int,
    pub cef_version_minor: ::std::os::raw::c_int,
    pub cef_version_patch: ::std::os::raw::c_int,
    pub cef_commit_number: ::std::os::raw::c_int,
    pub chrome_version_major: ::std::os::raw::c_int,
    pub chrome_version_minor: ::std::os::raw::c_int,
    pub chrome_version_build: ::std::os::raw::c_int,
    pub chrome_version_patch: ::std::os::raw::c_int,
    pub sandbox_compat_hash: [::std::os::raw::c_char; 17usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_version_info_t"][::std::mem::size_of::<_cef_version_info_t>() - 56usize];
    ["Alignment of _cef_version_info_t"][::std::mem::align_of::<_cef_version_info_t>() - 4usize];
    ["Offset of field: _cef_version_info_t::size"]
        [::std::mem::offset_of!(_cef_version_info_t, size) - 0usize];
    ["Offset of field: _cef_version_info_t::cef_version_major"]
        [::std::mem::offset_of!(_cef_version_info_t, cef_version_major) - 4usize];
    ["Offset of field: _cef_version_info_t::cef_version_minor"]
        [::std::mem::offset_of!(_cef_version_info_t, cef_version_minor) - 8usize];
    ["Offset of field: _cef_version_info_t::cef_version_patch"]
        [::std::mem::offset_of!(_cef_version_info_t, cef_version_patch) - 12usize];
    ["Offset of field: _cef_version_info_t::cef_commit_number"]
        [::std::mem::offset_of!(_cef_version_info_t, cef_commit_number) - 16usize];
    ["Offset of field: _cef_version_info_t::chrome_version_major"]
        [::std::mem::offset_of!(_cef_version_info_t, chrome_version_major) - 20usize];
    ["Offset of field: _cef_version_info_t::chrome_version_minor"]
        [::std::mem::offset_of!(_cef_version_info_t, chrome_version_minor) - 24usize];
    ["Offset of field: _cef_version_info_t::chrome_version_build"]
        [::std::mem::offset_of!(_cef_version_info_t, chrome_version_build) - 28usize];
    ["Offset of field: _cef_version_info_t::chrome_version_patch"]
        [::std::mem::offset_of!(_cef_version_info_t, chrome_version_patch) - 32usize];
    ["Offset of field: _cef_version_info_t::sandbox_compat_hash"]
        [::std::mem::offset_of!(_cef_version_info_t, sandbox_compat_hash) - 36usize];
};
pub type cef_version_info_t = _cef_version_info_t;
unsafe extern "C" {
    pub fn cef_version_info_all(info: *mut cef_version_info_t);
}
pub type char16_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_wide_t {
    pub str_: *mut wchar_t,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut wchar_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_string_wide_t"][::std::mem::size_of::<_cef_string_wide_t>() - 12usize];
    ["Alignment of _cef_string_wide_t"][::std::mem::align_of::<_cef_string_wide_t>() - 4usize];
    ["Offset of field: _cef_string_wide_t::str_"]
        [::std::mem::offset_of!(_cef_string_wide_t, str_) - 0usize];
    ["Offset of field: _cef_string_wide_t::length"]
        [::std::mem::offset_of!(_cef_string_wide_t, length) - 4usize];
    ["Offset of field: _cef_string_wide_t::dtor"]
        [::std::mem::offset_of!(_cef_string_wide_t, dtor) - 8usize];
};
pub type cef_string_wide_t = _cef_string_wide_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf8_t {
    pub str_: *mut ::std::os::raw::c_char,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut ::std::os::raw::c_char)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_string_utf8_t"][::std::mem::size_of::<_cef_string_utf8_t>() - 12usize];
    ["Alignment of _cef_string_utf8_t"][::std::mem::align_of::<_cef_string_utf8_t>() - 4usize];
    ["Offset of field: _cef_string_utf8_t::str_"]
        [::std::mem::offset_of!(_cef_string_utf8_t, str_) - 0usize];
    ["Offset of field: _cef_string_utf8_t::length"]
        [::std::mem::offset_of!(_cef_string_utf8_t, length) - 4usize];
    ["Offset of field: _cef_string_utf8_t::dtor"]
        [::std::mem::offset_of!(_cef_string_utf8_t, dtor) - 8usize];
};
pub type cef_string_utf8_t = _cef_string_utf8_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf16_t {
    pub str_: *mut char16_t,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut char16_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_string_utf16_t"][::std::mem::size_of::<_cef_string_utf16_t>() - 12usize];
    ["Alignment of _cef_string_utf16_t"][::std::mem::align_of::<_cef_string_utf16_t>() - 4usize];
    ["Offset of field: _cef_string_utf16_t::str_"]
        [::std::mem::offset_of!(_cef_string_utf16_t, str_) - 0usize];
    ["Offset of field: _cef_string_utf16_t::length"]
        [::std::mem::offset_of!(_cef_string_utf16_t, length) - 4usize];
    ["Offset of field: _cef_string_utf16_t::dtor"]
        [::std::mem::offset_of!(_cef_string_utf16_t, dtor) - 8usize];
};
pub type cef_string_utf16_t = _cef_string_utf16_t;
unsafe extern "C" {
    pub fn cef_string_wide_set(
        src: *const wchar_t, src_len: usize, output: *mut cef_string_wide_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_set(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_utf8_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_set(
        src: *const char16_t, src_len: usize, output: *mut cef_string_utf16_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_wide_clear(str_: *mut cef_string_wide_t);
}
unsafe extern "C" {
    pub fn cef_string_utf8_clear(str_: *mut cef_string_utf8_t);
}
unsafe extern "C" {
    pub fn cef_string_utf16_clear(str_: *mut cef_string_utf16_t);
}
unsafe extern "C" {
    pub fn cef_string_wide_cmp(
        str1: *const cef_string_wide_t, str2: *const cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_cmp(
        str1: *const cef_string_utf8_t, str2: *const cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_cmp(
        str1: *const cef_string_utf16_t, str2: *const cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_wide_to_utf8(
        src: *const wchar_t, src_len: usize, output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_to_wide(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_wide_to_utf16(
        src: *const wchar_t, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_to_wide(
        src: *const char16_t, src_len: usize, output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf8_to_utf16(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_to_utf8(
        src: *const char16_t, src_len: usize, output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_ascii_to_wide(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_ascii_to_utf16(
        src: *const ::std::os::raw::c_char, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
pub type cef_string_userfree_wide_t = *mut cef_string_wide_t;
pub type cef_string_userfree_utf8_t = *mut cef_string_utf8_t;
pub type cef_string_userfree_utf16_t = *mut cef_string_utf16_t;
unsafe extern "C" {
    pub fn cef_string_userfree_wide_alloc() -> cef_string_userfree_wide_t;
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf8_alloc() -> cef_string_userfree_utf8_t;
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf16_alloc() -> cef_string_userfree_utf16_t;
}
unsafe extern "C" {
    pub fn cef_string_userfree_wide_free(str_: cef_string_userfree_wide_t);
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf8_free(str_: cef_string_userfree_utf8_t);
}
unsafe extern "C" {
    pub fn cef_string_userfree_utf16_free(str_: cef_string_userfree_utf16_t);
}
unsafe extern "C" {
    pub fn cef_string_utf16_to_lower(
        src: *const char16_t, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_utf16_to_upper(
        src: *const char16_t, src_len: usize, output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
pub type cef_char_t = char16_t;
pub type cef_string_userfree_t = cef_string_userfree_utf16_t;
pub type cef_string_t = cef_string_utf16_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_list_t {
    _unused: [u8; 0],
}
pub type cef_string_list_t = *mut _cef_string_list_t;
unsafe extern "C" {
    pub fn cef_string_list_alloc() -> cef_string_list_t;
}
unsafe extern "C" {
    pub fn cef_string_list_size(list: cef_string_list_t) -> usize;
}
unsafe extern "C" {
    pub fn cef_string_list_value(
        list: cef_string_list_t, index: usize, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_list_append(list: cef_string_list_t, value: *const cef_string_t);
}
unsafe extern "C" {
    pub fn cef_string_list_clear(list: cef_string_list_t);
}
unsafe extern "C" {
    pub fn cef_string_list_free(list: cef_string_list_t);
}
unsafe extern "C" {
    pub fn cef_string_list_copy(list: cef_string_list_t) -> cef_string_list_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_map_t {
    _unused: [u8; 0],
}
pub type cef_string_map_t = *mut _cef_string_map_t;
unsafe extern "C" {
    pub fn cef_string_map_alloc() -> cef_string_map_t;
}
unsafe extern "C" {
    pub fn cef_string_map_size(map: cef_string_map_t) -> usize;
}
unsafe extern "C" {
    pub fn cef_string_map_find(
        map: cef_string_map_t, key: *const cef_string_t, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_map_key(
        map: cef_string_map_t, index: usize, key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_map_value(
        map: cef_string_map_t, index: usize, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_map_append(
        map: cef_string_map_t, key: *const cef_string_t, value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_map_clear(map: cef_string_map_t);
}
unsafe extern "C" {
    pub fn cef_string_map_free(map: cef_string_map_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_multimap_t {
    _unused: [u8; 0],
}
pub type cef_string_multimap_t = *mut _cef_string_multimap_t;
unsafe extern "C" {
    pub fn cef_string_multimap_alloc() -> cef_string_multimap_t;
}
unsafe extern "C" {
    pub fn cef_string_multimap_size(map: cef_string_multimap_t) -> usize;
}
unsafe extern "C" {
    pub fn cef_string_multimap_find_count(
        map: cef_string_multimap_t, key: *const cef_string_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn cef_string_multimap_enumerate(
        map: cef_string_multimap_t, key: *const cef_string_t, value_index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_multimap_key(
        map: cef_string_multimap_t, index: usize, key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_multimap_value(
        map: cef_string_multimap_t, index: usize, value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_multimap_append(
        map: cef_string_multimap_t, key: *const cef_string_t, value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_string_multimap_clear(map: cef_string_multimap_t);
}
unsafe extern "C" {
    pub fn cef_string_multimap_free(map: cef_string_multimap_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_basetime_t {
    pub val: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_basetime_t"][::std::mem::size_of::<_cef_basetime_t>() - 8usize];
    ["Alignment of _cef_basetime_t"][::std::mem::align_of::<_cef_basetime_t>() - 8usize];
    ["Offset of field: _cef_basetime_t::val"]
        [::std::mem::offset_of!(_cef_basetime_t, val) - 0usize];
};
pub type cef_basetime_t = _cef_basetime_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_time_t {
    pub year: ::std::os::raw::c_int,
    pub month: ::std::os::raw::c_int,
    pub day_of_week: ::std::os::raw::c_int,
    pub day_of_month: ::std::os::raw::c_int,
    pub hour: ::std::os::raw::c_int,
    pub minute: ::std::os::raw::c_int,
    pub second: ::std::os::raw::c_int,
    pub millisecond: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_time_t"][::std::mem::size_of::<_cef_time_t>() - 32usize];
    ["Alignment of _cef_time_t"][::std::mem::align_of::<_cef_time_t>() - 4usize];
    ["Offset of field: _cef_time_t::year"][::std::mem::offset_of!(_cef_time_t, year) - 0usize];
    ["Offset of field: _cef_time_t::month"][::std::mem::offset_of!(_cef_time_t, month) - 4usize];
    ["Offset of field: _cef_time_t::day_of_week"]
        [::std::mem::offset_of!(_cef_time_t, day_of_week) - 8usize];
    ["Offset of field: _cef_time_t::day_of_month"]
        [::std::mem::offset_of!(_cef_time_t, day_of_month) - 12usize];
    ["Offset of field: _cef_time_t::hour"][::std::mem::offset_of!(_cef_time_t, hour) - 16usize];
    ["Offset of field: _cef_time_t::minute"][::std::mem::offset_of!(_cef_time_t, minute) - 20usize];
    ["Offset of field: _cef_time_t::second"][::std::mem::offset_of!(_cef_time_t, second) - 24usize];
    ["Offset of field: _cef_time_t::millisecond"]
        [::std::mem::offset_of!(_cef_time_t, millisecond) - 28usize];
};
pub type cef_time_t = _cef_time_t;
unsafe extern "C" {
    pub fn cef_time_to_timet(
        cef_time: *const cef_time_t, time: *mut time_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_from_timet(time: time_t, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_to_doublet(
        cef_time: *const cef_time_t, time: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_from_doublet(time: f64, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_now(cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_basetime_now() -> cef_basetime_t;
}
unsafe extern "C" {
    pub fn cef_time_delta(
        cef_time1: *const cef_time_t, cef_time2: *const cef_time_t,
        delta: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_to_basetime(
        from: *const cef_time_t, to: *mut cef_basetime_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cef_time_from_basetime(
        from: cef_basetime_t, to: *mut cef_time_t,
    ) -> ::std::os::raw::c_int;
}
pub mod cef_content_setting_types_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CONTENT_SETTING_TYPE_COOKIES: Type = 0;
    pub const CEF_CONTENT_SETTING_TYPE_IMAGES: Type = 1;
    pub const CEF_CONTENT_SETTING_TYPE_JAVASCRIPT: Type = 2;
    pub const CEF_CONTENT_SETTING_TYPE_POPUPS: Type = 3;
    pub const CEF_CONTENT_SETTING_TYPE_GEOLOCATION: Type = 4;
    pub const CEF_CONTENT_SETTING_TYPE_NOTIFICATIONS: Type = 5;
    pub const CEF_CONTENT_SETTING_TYPE_AUTO_SELECT_CERTIFICATE: Type = 6;
    pub const CEF_CONTENT_SETTING_TYPE_MIXEDSCRIPT: Type = 7;
    pub const CEF_CONTENT_SETTING_TYPE_MEDIASTREAM_MIC: Type = 8;
    pub const CEF_CONTENT_SETTING_TYPE_MEDIASTREAM_CAMERA: Type = 9;
    pub const CEF_CONTENT_SETTING_TYPE_PROTOCOL_HANDLERS: Type = 10;
    pub const CEF_CONTENT_SETTING_TYPE_DEPRECATED_PPAPI_BROKER: Type = 11;
    pub const CEF_CONTENT_SETTING_TYPE_AUTOMATIC_DOWNLOADS: Type = 12;
    pub const CEF_CONTENT_SETTING_TYPE_MIDI_SYSEX: Type = 13;
    pub const CEF_CONTENT_SETTING_TYPE_SSL_CERT_DECISIONS: Type = 14;
    pub const CEF_CONTENT_SETTING_TYPE_PROTECTED_MEDIA_IDENTIFIER: Type = 15;
    pub const CEF_CONTENT_SETTING_TYPE_APP_BANNER: Type = 16;
    pub const CEF_CONTENT_SETTING_TYPE_SITE_ENGAGEMENT: Type = 17;
    pub const CEF_CONTENT_SETTING_TYPE_PERSISTENT_STORAGE: Type = 18;
    pub const CEF_CONTENT_SETTING_TYPE_USB_CHOOSER_DATA: Type = 19;
    pub const CEF_CONTENT_SETTING_TYPE_BLUETOOTH_GUARD: Type = 20;
    pub const CEF_CONTENT_SETTING_TYPE_BACKGROUND_SYNC: Type = 21;
    pub const CEF_CONTENT_SETTING_TYPE_AUTOPLAY: Type = 22;
    pub const CEF_CONTENT_SETTING_TYPE_IMPORTANT_SITE_INFO: Type = 23;
    pub const CEF_CONTENT_SETTING_TYPE_PERMISSION_AUTOBLOCKER_DATA: Type = 24;
    pub const CEF_CONTENT_SETTING_TYPE_ADS: Type = 25;
    pub const CEF_CONTENT_SETTING_TYPE_ADS_DATA: Type = 26;
    pub const CEF_CONTENT_SETTING_TYPE_MIDI: Type = 27;
    pub const CEF_CONTENT_SETTING_TYPE_PASSWORD_PROTECTION: Type = 28;
    pub const CEF_CONTENT_SETTING_TYPE_MEDIA_ENGAGEMENT: Type = 29;
    pub const CEF_CONTENT_SETTING_TYPE_SOUND: Type = 30;
    pub const CEF_CONTENT_SETTING_TYPE_CLIENT_HINTS: Type = 31;
    pub const CEF_CONTENT_SETTING_TYPE_SENSORS: Type = 32;
    pub const CEF_CONTENT_SETTING_TYPE_DEPRECATED_ACCESSIBILITY_EVENTS: Type = 33;
    pub const CEF_CONTENT_SETTING_TYPE_PAYMENT_HANDLER: Type = 34;
    pub const CEF_CONTENT_SETTING_TYPE_USB_GUARD: Type = 35;
    pub const CEF_CONTENT_SETTING_TYPE_BACKGROUND_FETCH: Type = 36;
    pub const CEF_CONTENT_SETTING_TYPE_INTENT_PICKER_DISPLAY: Type = 37;
    pub const CEF_CONTENT_SETTING_TYPE_IDLE_DETECTION: Type = 38;
    pub const CEF_CONTENT_SETTING_TYPE_SERIAL_GUARD: Type = 39;
    pub const CEF_CONTENT_SETTING_TYPE_SERIAL_CHOOSER_DATA: Type = 40;
    pub const CEF_CONTENT_SETTING_TYPE_PERIODIC_BACKGROUND_SYNC: Type = 41;
    pub const CEF_CONTENT_SETTING_TYPE_BLUETOOTH_SCANNING: Type = 42;
    pub const CEF_CONTENT_SETTING_TYPE_HID_GUARD: Type = 43;
    pub const CEF_CONTENT_SETTING_TYPE_HID_CHOOSER_DATA: Type = 44;
    pub const CEF_CONTENT_SETTING_TYPE_WAKE_LOCK_SCREEN: Type = 45;
    pub const CEF_CONTENT_SETTING_TYPE_WAKE_LOCK_SYSTEM: Type = 46;
    pub const CEF_CONTENT_SETTING_TYPE_LEGACY_COOKIE_ACCESS: Type = 47;
    pub const CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_WRITE_GUARD: Type = 48;
    pub const CEF_CONTENT_SETTING_TYPE_NFC: Type = 49;
    pub const CEF_CONTENT_SETTING_TYPE_BLUETOOTH_CHOOSER_DATA: Type = 50;
    pub const CEF_CONTENT_SETTING_TYPE_CLIPBOARD_READ_WRITE: Type = 51;
    pub const CEF_CONTENT_SETTING_TYPE_CLIPBOARD_SANITIZED_WRITE: Type = 52;
    pub const CEF_CONTENT_SETTING_TYPE_SAFE_BROWSING_URL_CHECK_DATA: Type = 53;
    pub const CEF_CONTENT_SETTING_TYPE_VR: Type = 54;
    pub const CEF_CONTENT_SETTING_TYPE_AR: Type = 55;
    pub const CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_READ_GUARD: Type = 56;
    pub const CEF_CONTENT_SETTING_TYPE_STORAGE_ACCESS: Type = 57;
    pub const CEF_CONTENT_SETTING_TYPE_CAMERA_PAN_TILT_ZOOM: Type = 58;
    pub const CEF_CONTENT_SETTING_TYPE_WINDOW_MANAGEMENT: Type = 59;
    pub const CEF_CONTENT_SETTING_TYPE_INSECURE_PRIVATE_NETWORK_DEPRECATED: Type = 60;
    pub const CEF_CONTENT_SETTING_TYPE_LOCAL_FONTS: Type = 61;
    pub const CEF_CONTENT_SETTING_TYPE_PERMISSION_AUTOREVOCATION_DATA: Type = 62;
    pub const CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_LAST_PICKED_DIRECTORY: Type = 63;
    pub const CEF_CONTENT_SETTING_TYPE_DISPLAY_CAPTURE: Type = 64;
    pub const CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_ACCESS_CHOOSER_DATA: Type = 65;
    pub const CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_SHARING: Type = 66;
    pub const CEF_CONTENT_SETTING_TYPE_JAVASCRIPT_JIT: Type = 67;
    pub const CEF_CONTENT_SETTING_TYPE_HTTP_ALLOWED: Type = 68;
    pub const CEF_CONTENT_SETTING_TYPE_FORMFILL_METADATA: Type = 69;
    pub const CEF_CONTENT_SETTING_TYPE_DEPRECATED_FEDERATED_IDENTITY_ACTIVE_SESSION: Type = 70;
    pub const CEF_CONTENT_SETTING_TYPE_AUTO_DARK_WEB_CONTENT: Type = 71;
    pub const CEF_CONTENT_SETTING_TYPE_REQUEST_DESKTOP_SITE: Type = 72;
    pub const CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_API: Type = 73;
    pub const CEF_CONTENT_SETTING_TYPE_NOTIFICATION_INTERACTIONS: Type = 74;
    pub const CEF_CONTENT_SETTING_TYPE_REDUCED_ACCEPT_LANGUAGE: Type = 75;
    pub const CEF_CONTENT_SETTING_TYPE_NOTIFICATION_PERMISSION_REVIEW: Type = 76;
    pub const CEF_CONTENT_SETTING_TYPE_PRIVATE_NETWORK_GUARD_DEPRECATED: Type = 77;
    pub const CEF_CONTENT_SETTING_TYPE_PRIVATE_NETWORK_CHOOSER_DATA_DEPRECATED: Type = 78;
    pub const CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_IDENTITY_PROVIDER_SIGNIN_STATUS: Type =
        79;
    pub const CEF_CONTENT_SETTING_TYPE_REVOKED_UNUSED_SITE_PERMISSIONS: Type = 80;
    pub const CEF_CONTENT_SETTING_TYPE_TOP_LEVEL_STORAGE_ACCESS: Type = 81;
    pub const CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_AUTO_REAUTHN_PERMISSION: Type = 82;
    pub const CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_IDENTITY_PROVIDER_REGISTRATION: Type = 83;
    pub const CEF_CONTENT_SETTING_TYPE_ANTI_ABUSE: Type = 84;
    pub const CEF_CONTENT_SETTING_TYPE_THIRD_PARTY_STORAGE_PARTITIONING_DEPRECATED: Type = 85;
    pub const CEF_CONTENT_SETTING_TYPE_HTTPS_ENFORCED: Type = 86;
    pub const CEF_CONTENT_SETTING_TYPE_ALL_SCREEN_CAPTURE: Type = 87;
    pub const CEF_CONTENT_SETTING_TYPE_COOKIE_CONTROLS_METADATA: Type = 88;
    pub const CEF_CONTENT_SETTING_TYPE_TPCD_HEURISTICS_GRANTS_DEPRECATED: Type = 89;
    pub const CEF_CONTENT_SETTING_TYPE_TPCD_METADATA_GRANTS_DEPRECATED: Type = 90;
    pub const CEF_CONTENT_SETTING_TYPE_TPCD_TRIAL_DEPRECATED: Type = 91;
    pub const CEF_CONTENT_SETTING_TYPE_TOP_LEVEL_TPCD_TRIAL_DEPRECATED: Type = 92;
    pub const CEF_CONTENT_SETTING_TYPE_TOP_LEVEL_TPCD_ORIGIN_TRIAL_DEPRECATED: Type = 93;
    pub const CEF_CONTENT_SETTING_TYPE_AUTO_PICTURE_IN_PICTURE: Type = 94;
    pub const CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_ACCESS_EXTENDED_PERMISSION: Type = 95;
    pub const CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_ACCESS_RESTORE_PERMISSION: Type = 96;
    pub const CEF_CONTENT_SETTING_TYPE_CAPTURED_SURFACE_CONTROL: Type = 97;
    pub const CEF_CONTENT_SETTING_TYPE_SMART_CARD_GUARD: Type = 98;
    pub const CEF_CONTENT_SETTING_TYPE_SMART_CARD_DATA: Type = 99;
    pub const CEF_CONTENT_SETTING_TYPE_WEB_PRINTING: Type = 100;
    pub const CEF_CONTENT_SETTING_TYPE_AUTOMATIC_FULLSCREEN: Type = 101;
    pub const CEF_CONTENT_SETTING_TYPE_SUB_APP_INSTALLATION_PROMPTS: Type = 102;
    pub const CEF_CONTENT_SETTING_TYPE_SPEAKER_SELECTION: Type = 103;
    pub const CEF_CONTENT_SETTING_TYPE_DIRECT_SOCKETS: Type = 104;
    pub const CEF_CONTENT_SETTING_TYPE_KEYBOARD_LOCK: Type = 105;
    pub const CEF_CONTENT_SETTING_TYPE_POINTER_LOCK: Type = 106;
    pub const CEF_CONTENT_SETTING_TYPE_REVOKED_ABUSIVE_NOTIFICATION_PERMISSIONS: Type = 107;
    pub const CEF_CONTENT_SETTING_TYPE_TRACKING_PROTECTION_DEPRECATED: Type = 108;
    pub const CEF_CONTENT_SETTING_TYPE_DISPLAY_MEDIA_SYSTEM_AUDIO: Type = 109;
    pub const CEF_CONTENT_SETTING_TYPE_JAVASCRIPT_OPTIMIZER: Type = 110;
    pub const CEF_CONTENT_SETTING_TYPE_STORAGE_ACCESS_HEADER_ORIGIN_TRIAL: Type = 111;
    pub const CEF_CONTENT_SETTING_TYPE_HAND_TRACKING: Type = 112;
    pub const CEF_CONTENT_SETTING_TYPE_WEB_APP_INSTALLATION: Type = 113;
    pub const CEF_CONTENT_SETTING_TYPE_DIRECT_SOCKETS_PRIVATE_NETWORK_ACCESS: Type = 114;
    pub const CEF_CONTENT_SETTING_TYPE_LEGACY_COOKIE_SCOPE: Type = 115;
    pub const CEF_CONTENT_SETTING_TYPE_ARE_SUSPICIOUS_NOTIFICATIONS_ALLOWLISTED_BY_USER: Type = 116;
    pub const CEF_CONTENT_SETTING_TYPE_CONTROLLED_FRAME: Type = 117;
    pub const CEF_CONTENT_SETTING_TYPE_REVOKED_DISRUPTIVE_NOTIFICATION_PERMISSIONS: Type = 118;
    pub const CEF_CONTENT_SETTING_TYPE_LOCAL_NETWORK_ACCESS: Type = 119;
    pub const CEF_CONTENT_SETTING_TYPE_ON_DEVICE_SPEECH_RECOGNITION_LANGUAGES_DOWNLOADED: Type =
        120;
    pub const CEF_CONTENT_SETTING_TYPE_INITIALIZED_TRANSLATIONS: Type = 121;
    pub const CEF_CONTENT_SETTING_TYPE_SUSPICIOUS_NOTIFICATION_IDS: Type = 122;
    pub const CEF_CONTENT_SETTING_TYPE_GEOLOCATION_WITH_OPTIONS: Type = 123;
    pub const CEF_CONTENT_SETTING_TYPE_DEVICE_ATTRIBUTES: Type = 124;
    pub const CEF_CONTENT_SETTING_TYPE_PERMISSION_ACTIONS_HISTORY: Type = 125;
    pub const CEF_CONTENT_SETTING_TYPE_SUSPICIOUS_NOTIFICATION_SHOW_ORIGINAL: Type = 126;
    pub const CEF_CONTENT_SETTING_TYPE_LOCAL_NETWORK: Type = 127;
    pub const CEF_CONTENT_SETTING_TYPE_LOOPBACK_NETWORK: Type = 128;
    pub const CEF_CONTENT_SETTING_TYPE_SUB_APPS_WITHOUT_PROMPTS: Type = 129;
    pub const CEF_CONTENT_SETTING_TYPE_NUM_VALUES: Type = 130;
}
pub mod cef_content_setting_values_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CONTENT_SETTING_VALUE_DEFAULT: Type = 0;
    pub const CEF_CONTENT_SETTING_VALUE_ALLOW: Type = 1;
    pub const CEF_CONTENT_SETTING_VALUE_BLOCK: Type = 2;
    pub const CEF_CONTENT_SETTING_VALUE_ASK: Type = 3;
    pub const CEF_CONTENT_SETTING_VALUE_SESSION_ONLY: Type = 4;
    pub const CEF_CONTENT_SETTING_VALUE_DETECT_IMPORTANT_CONTENT_DEPRECATED: Type = 5;
    pub const CEF_CONTENT_SETTING_VALUE_NUM_VALUES: Type = 6;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_point_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_point_t"][::std::mem::size_of::<_cef_point_t>() - 8usize];
    ["Alignment of _cef_point_t"][::std::mem::align_of::<_cef_point_t>() - 4usize];
    ["Offset of field: _cef_point_t::x"][::std::mem::offset_of!(_cef_point_t, x) - 0usize];
    ["Offset of field: _cef_point_t::y"][::std::mem::offset_of!(_cef_point_t, y) - 4usize];
};
pub type cef_point_t = _cef_point_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_rect_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_rect_t"][::std::mem::size_of::<_cef_rect_t>() - 16usize];
    ["Alignment of _cef_rect_t"][::std::mem::align_of::<_cef_rect_t>() - 4usize];
    ["Offset of field: _cef_rect_t::x"][::std::mem::offset_of!(_cef_rect_t, x) - 0usize];
    ["Offset of field: _cef_rect_t::y"][::std::mem::offset_of!(_cef_rect_t, y) - 4usize];
    ["Offset of field: _cef_rect_t::width"][::std::mem::offset_of!(_cef_rect_t, width) - 8usize];
    ["Offset of field: _cef_rect_t::height"][::std::mem::offset_of!(_cef_rect_t, height) - 12usize];
};
pub type cef_rect_t = _cef_rect_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_size_t {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_size_t"][::std::mem::size_of::<_cef_size_t>() - 8usize];
    ["Alignment of _cef_size_t"][::std::mem::align_of::<_cef_size_t>() - 4usize];
    ["Offset of field: _cef_size_t::width"][::std::mem::offset_of!(_cef_size_t, width) - 0usize];
    ["Offset of field: _cef_size_t::height"][::std::mem::offset_of!(_cef_size_t, height) - 4usize];
};
pub type cef_size_t = _cef_size_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_insets_t {
    pub top: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_insets_t"][::std::mem::size_of::<_cef_insets_t>() - 16usize];
    ["Alignment of _cef_insets_t"][::std::mem::align_of::<_cef_insets_t>() - 4usize];
    ["Offset of field: _cef_insets_t::top"][::std::mem::offset_of!(_cef_insets_t, top) - 0usize];
    ["Offset of field: _cef_insets_t::left"][::std::mem::offset_of!(_cef_insets_t, left) - 4usize];
    ["Offset of field: _cef_insets_t::bottom"]
        [::std::mem::offset_of!(_cef_insets_t, bottom) - 8usize];
    ["Offset of field: _cef_insets_t::right"]
        [::std::mem::offset_of!(_cef_insets_t, right) - 12usize];
};
pub type cef_insets_t = _cef_insets_t;
pub type DWORD = ::std::os::raw::c_ulong;
pub type UINT = ::std::os::raw::c_uint;
pub type UINT_PTR = ::std::os::raw::c_uint;
pub type LONG_PTR = ::std::os::raw::c_long;
pub type LONG = ::std::os::raw::c_long;
pub type HANDLE = *mut ::std::os::raw::c_void;
pub type WPARAM = UINT_PTR;
pub type LPARAM = LONG_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HINSTANCE__ {
    pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HINSTANCE__"][::std::mem::size_of::<HINSTANCE__>() - 4usize];
    ["Alignment of HINSTANCE__"][::std::mem::align_of::<HINSTANCE__>() - 4usize];
    ["Offset of field: HINSTANCE__::unused"][::std::mem::offset_of!(HINSTANCE__, unused) - 0usize];
};
pub type HINSTANCE = *mut HINSTANCE__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HWND__ {
    pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HWND__"][::std::mem::size_of::<HWND__>() - 4usize];
    ["Alignment of HWND__"][::std::mem::align_of::<HWND__>() - 4usize];
    ["Offset of field: HWND__::unused"][::std::mem::offset_of!(HWND__, unused) - 0usize];
};
pub type HWND = *mut HWND__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HICON__ {
    pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HICON__"][::std::mem::size_of::<HICON__>() - 4usize];
    ["Alignment of HICON__"][::std::mem::align_of::<HICON__>() - 4usize];
    ["Offset of field: HICON__::unused"][::std::mem::offset_of!(HICON__, unused) - 0usize];
};
pub type HICON = *mut HICON__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HMENU__ {
    pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HMENU__"][::std::mem::size_of::<HMENU__>() - 4usize];
    ["Alignment of HMENU__"][::std::mem::align_of::<HMENU__>() - 4usize];
    ["Offset of field: HMENU__::unused"][::std::mem::offset_of!(HMENU__, unused) - 0usize];
};
pub type HMENU = *mut HMENU__;
pub type HCURSOR = HICON;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagPOINT {
    pub x: LONG,
    pub y: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagPOINT"][::std::mem::size_of::<tagPOINT>() - 8usize];
    ["Alignment of tagPOINT"][::std::mem::align_of::<tagPOINT>() - 4usize];
    ["Offset of field: tagPOINT::x"][::std::mem::offset_of!(tagPOINT, x) - 0usize];
    ["Offset of field: tagPOINT::y"][::std::mem::offset_of!(tagPOINT, y) - 4usize];
};
pub type POINT = tagPOINT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagMSG {
    pub hwnd: HWND,
    pub message: UINT,
    pub wParam: WPARAM,
    pub lParam: LPARAM,
    pub time: DWORD,
    pub pt: POINT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagMSG"][::std::mem::size_of::<tagMSG>() - 28usize];
    ["Alignment of tagMSG"][::std::mem::align_of::<tagMSG>() - 4usize];
    ["Offset of field: tagMSG::hwnd"][::std::mem::offset_of!(tagMSG, hwnd) - 0usize];
    ["Offset of field: tagMSG::message"][::std::mem::offset_of!(tagMSG, message) - 4usize];
    ["Offset of field: tagMSG::wParam"][::std::mem::offset_of!(tagMSG, wParam) - 8usize];
    ["Offset of field: tagMSG::lParam"][::std::mem::offset_of!(tagMSG, lParam) - 12usize];
    ["Offset of field: tagMSG::time"][::std::mem::offset_of!(tagMSG, time) - 16usize];
    ["Offset of field: tagMSG::pt"][::std::mem::offset_of!(tagMSG, pt) - 20usize];
};
pub type MSG = tagMSG;
pub mod cef_color_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_COLOR_TYPE_RGBA_8888: Type = 0;
    pub const CEF_COLOR_TYPE_BGRA_8888: Type = 1;
    pub const CEF_COLOR_TYPE_NUM_VALUES: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_accelerated_paint_info_common_t {
    pub size: usize,
    pub timestamp: u64,
    pub coded_size: cef_size_t,
    pub visible_rect: cef_rect_t,
    pub content_rect: cef_rect_t,
    pub source_size: cef_size_t,
    pub capture_update_rect: cef_rect_t,
    pub region_capture_rect: cef_rect_t,
    pub capture_counter: u64,
    pub has_capture_update_rect: u8,
    pub has_region_capture_rect: u8,
    pub has_source_size: u8,
    pub has_capture_counter: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_accelerated_paint_info_common_t"]
        [::std::mem::size_of::<_cef_accelerated_paint_info_common_t>() - 112usize];
    ["Alignment of _cef_accelerated_paint_info_common_t"]
        [::std::mem::align_of::<_cef_accelerated_paint_info_common_t>() - 8usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::size"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, size) - 0usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::timestamp"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, timestamp) - 8usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::coded_size"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, coded_size) - 16usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::visible_rect"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, visible_rect) - 24usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::content_rect"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, content_rect) - 40usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::source_size"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, source_size) - 56usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::capture_update_rect"][::std::mem::offset_of!(
        _cef_accelerated_paint_info_common_t,
        capture_update_rect
    ) - 64usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::region_capture_rect"][::std::mem::offset_of!(
        _cef_accelerated_paint_info_common_t,
        region_capture_rect
    ) - 80usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::capture_counter"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, capture_counter) - 96usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::has_capture_update_rect"][::std::mem::offset_of!(
        _cef_accelerated_paint_info_common_t,
        has_capture_update_rect
    )
        - 104usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::has_region_capture_rect"][::std::mem::offset_of!(
        _cef_accelerated_paint_info_common_t,
        has_region_capture_rect
    )
        - 105usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::has_source_size"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_common_t, has_source_size) - 106usize];
    ["Offset of field: _cef_accelerated_paint_info_common_t::has_capture_counter"][::std::mem::offset_of!(
        _cef_accelerated_paint_info_common_t,
        has_capture_counter
    ) - 107usize];
};
pub type cef_accelerated_paint_info_common_t = _cef_accelerated_paint_info_common_t;
pub mod cef_runtime_style_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_RUNTIME_STYLE_DEFAULT: Type = 0;
    pub const CEF_RUNTIME_STYLE_CHROME: Type = 1;
    pub const CEF_RUNTIME_STYLE_ALLOY: Type = 2;
}
pub type cef_cursor_handle_t = HCURSOR;
pub type cef_event_handle_t = *mut MSG;
pub type cef_window_handle_t = HWND;
pub type cef_shared_texture_handle_t = HANDLE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_main_args_t {
    pub instance: HINSTANCE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_main_args_t"][::std::mem::size_of::<_cef_main_args_t>() - 4usize];
    ["Alignment of _cef_main_args_t"][::std::mem::align_of::<_cef_main_args_t>() - 4usize];
    ["Offset of field: _cef_main_args_t::instance"]
        [::std::mem::offset_of!(_cef_main_args_t, instance) - 0usize];
};
pub type cef_main_args_t = _cef_main_args_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_window_info_t {
    pub size: usize,
    pub ex_style: DWORD,
    pub window_name: cef_string_t,
    pub style: DWORD,
    pub bounds: cef_rect_t,
    pub parent_window: cef_window_handle_t,
    pub menu: HMENU,
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    pub shared_texture_enabled: ::std::os::raw::c_int,
    pub external_begin_frame_enabled: ::std::os::raw::c_int,
    pub window: cef_window_handle_t,
    pub runtime_style: cef_runtime_style_t::Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_window_info_t"][::std::mem::size_of::<_cef_window_info_t>() - 68usize];
    ["Alignment of _cef_window_info_t"][::std::mem::align_of::<_cef_window_info_t>() - 4usize];
    ["Offset of field: _cef_window_info_t::size"]
        [::std::mem::offset_of!(_cef_window_info_t, size) - 0usize];
    ["Offset of field: _cef_window_info_t::ex_style"]
        [::std::mem::offset_of!(_cef_window_info_t, ex_style) - 4usize];
    ["Offset of field: _cef_window_info_t::window_name"]
        [::std::mem::offset_of!(_cef_window_info_t, window_name) - 8usize];
    ["Offset of field: _cef_window_info_t::style"]
        [::std::mem::offset_of!(_cef_window_info_t, style) - 20usize];
    ["Offset of field: _cef_window_info_t::bounds"]
        [::std::mem::offset_of!(_cef_window_info_t, bounds) - 24usize];
    ["Offset of field: _cef_window_info_t::parent_window"]
        [::std::mem::offset_of!(_cef_window_info_t, parent_window) - 40usize];
    ["Offset of field: _cef_window_info_t::menu"]
        [::std::mem::offset_of!(_cef_window_info_t, menu) - 44usize];
    ["Offset of field: _cef_window_info_t::windowless_rendering_enabled"]
        [::std::mem::offset_of!(_cef_window_info_t, windowless_rendering_enabled) - 48usize];
    ["Offset of field: _cef_window_info_t::shared_texture_enabled"]
        [::std::mem::offset_of!(_cef_window_info_t, shared_texture_enabled) - 52usize];
    ["Offset of field: _cef_window_info_t::external_begin_frame_enabled"]
        [::std::mem::offset_of!(_cef_window_info_t, external_begin_frame_enabled) - 56usize];
    ["Offset of field: _cef_window_info_t::window"]
        [::std::mem::offset_of!(_cef_window_info_t, window) - 60usize];
    ["Offset of field: _cef_window_info_t::runtime_style"]
        [::std::mem::offset_of!(_cef_window_info_t, runtime_style) - 64usize];
};
pub type cef_window_info_t = _cef_window_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_accelerated_paint_info_t {
    pub size: usize,
    pub shared_texture_handle: cef_shared_texture_handle_t,
    pub format: cef_color_type_t::Type,
    pub extra: cef_accelerated_paint_info_common_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_accelerated_paint_info_t"]
        [::std::mem::size_of::<_cef_accelerated_paint_info_t>() - 128usize];
    ["Alignment of _cef_accelerated_paint_info_t"]
        [::std::mem::align_of::<_cef_accelerated_paint_info_t>() - 8usize];
    ["Offset of field: _cef_accelerated_paint_info_t::size"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, size) - 0usize];
    ["Offset of field: _cef_accelerated_paint_info_t::shared_texture_handle"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, shared_texture_handle) - 4usize];
    ["Offset of field: _cef_accelerated_paint_info_t::format"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, format) - 8usize];
    ["Offset of field: _cef_accelerated_paint_info_t::extra"]
        [::std::mem::offset_of!(_cef_accelerated_paint_info_t, extra) - 16usize];
};
pub type cef_accelerated_paint_info_t = _cef_accelerated_paint_info_t;
pub type cef_color_t = u32;
pub mod cef_log_severity_t {
    pub type Type = ::std::os::raw::c_int;
    pub const LOGSEVERITY_DEFAULT: Type = 0;
    pub const LOGSEVERITY_VERBOSE: Type = 1;
    pub const LOGSEVERITY_DEBUG: Type = 1;
    pub const LOGSEVERITY_INFO: Type = 2;
    pub const LOGSEVERITY_WARNING: Type = 3;
    pub const LOGSEVERITY_ERROR: Type = 4;
    pub const LOGSEVERITY_FATAL: Type = 5;
    pub const LOGSEVERITY_DISABLE: Type = 99;
}
pub mod cef_log_items_t {
    pub type Type = ::std::os::raw::c_int;
    pub const LOG_ITEMS_DEFAULT: Type = 0;
    pub const LOG_ITEMS_NONE: Type = 1;
    pub const LOG_ITEMS_FLAG_PROCESS_ID: Type = 2;
    pub const LOG_ITEMS_FLAG_THREAD_ID: Type = 4;
    pub const LOG_ITEMS_FLAG_TIME_STAMP: Type = 8;
    pub const LOG_ITEMS_FLAG_TICK_COUNT: Type = 16;
}
pub mod cef_state_t {
    pub type Type = ::std::os::raw::c_int;
    pub const STATE_DEFAULT: Type = 0;
    pub const STATE_ENABLED: Type = 1;
    pub const STATE_DISABLED: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_settings_t {
    pub size: usize,
    pub no_sandbox: ::std::os::raw::c_int,
    pub browser_subprocess_path: cef_string_t,
    pub framework_dir_path: cef_string_t,
    pub main_bundle_path: cef_string_t,
    pub multi_threaded_message_loop: ::std::os::raw::c_int,
    pub external_message_pump: ::std::os::raw::c_int,
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    pub command_line_args_disabled: ::std::os::raw::c_int,
    pub cache_path: cef_string_t,
    pub root_cache_path: cef_string_t,
    pub persist_session_cookies: ::std::os::raw::c_int,
    pub user_agent: cef_string_t,
    pub user_agent_product: cef_string_t,
    pub locale: cef_string_t,
    pub log_file: cef_string_t,
    pub log_severity: cef_log_severity_t::Type,
    pub log_items: cef_log_items_t::Type,
    pub javascript_flags: cef_string_t,
    pub resources_dir_path: cef_string_t,
    pub locales_dir_path: cef_string_t,
    pub remote_debugging_port: ::std::os::raw::c_int,
    pub uncaught_exception_stack_size: ::std::os::raw::c_int,
    pub background_color: cef_color_t,
    pub accept_language_list: cef_string_t,
    pub cookieable_schemes_list: cef_string_t,
    pub cookieable_schemes_exclude_defaults: ::std::os::raw::c_int,
    pub chrome_policy_id: cef_string_t,
    pub chrome_app_icon_id: ::std::os::raw::c_int,
    pub disable_signal_handlers: ::std::os::raw::c_int,
    pub use_views_default_popup: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_settings_t"][::std::mem::size_of::<_cef_settings_t>() - 244usize];
    ["Alignment of _cef_settings_t"][::std::mem::align_of::<_cef_settings_t>() - 4usize];
    ["Offset of field: _cef_settings_t::size"]
        [::std::mem::offset_of!(_cef_settings_t, size) - 0usize];
    ["Offset of field: _cef_settings_t::no_sandbox"]
        [::std::mem::offset_of!(_cef_settings_t, no_sandbox) - 4usize];
    ["Offset of field: _cef_settings_t::browser_subprocess_path"]
        [::std::mem::offset_of!(_cef_settings_t, browser_subprocess_path) - 8usize];
    ["Offset of field: _cef_settings_t::framework_dir_path"]
        [::std::mem::offset_of!(_cef_settings_t, framework_dir_path) - 20usize];
    ["Offset of field: _cef_settings_t::main_bundle_path"]
        [::std::mem::offset_of!(_cef_settings_t, main_bundle_path) - 32usize];
    ["Offset of field: _cef_settings_t::multi_threaded_message_loop"]
        [::std::mem::offset_of!(_cef_settings_t, multi_threaded_message_loop) - 44usize];
    ["Offset of field: _cef_settings_t::external_message_pump"]
        [::std::mem::offset_of!(_cef_settings_t, external_message_pump) - 48usize];
    ["Offset of field: _cef_settings_t::windowless_rendering_enabled"]
        [::std::mem::offset_of!(_cef_settings_t, windowless_rendering_enabled) - 52usize];
    ["Offset of field: _cef_settings_t::command_line_args_disabled"]
        [::std::mem::offset_of!(_cef_settings_t, command_line_args_disabled) - 56usize];
    ["Offset of field: _cef_settings_t::cache_path"]
        [::std::mem::offset_of!(_cef_settings_t, cache_path) - 60usize];
    ["Offset of field: _cef_settings_t::root_cache_path"]
        [::std::mem::offset_of!(_cef_settings_t, root_cache_path) - 72usize];
    ["Offset of field: _cef_settings_t::persist_session_cookies"]
        [::std::mem::offset_of!(_cef_settings_t, persist_session_cookies) - 84usize];
    ["Offset of field: _cef_settings_t::user_agent"]
        [::std::mem::offset_of!(_cef_settings_t, user_agent) - 88usize];
    ["Offset of field: _cef_settings_t::user_agent_product"]
        [::std::mem::offset_of!(_cef_settings_t, user_agent_product) - 100usize];
    ["Offset of field: _cef_settings_t::locale"]
        [::std::mem::offset_of!(_cef_settings_t, locale) - 112usize];
    ["Offset of field: _cef_settings_t::log_file"]
        [::std::mem::offset_of!(_cef_settings_t, log_file) - 124usize];
    ["Offset of field: _cef_settings_t::log_severity"]
        [::std::mem::offset_of!(_cef_settings_t, log_severity) - 136usize];
    ["Offset of field: _cef_settings_t::log_items"]
        [::std::mem::offset_of!(_cef_settings_t, log_items) - 140usize];
    ["Offset of field: _cef_settings_t::javascript_flags"]
        [::std::mem::offset_of!(_cef_settings_t, javascript_flags) - 144usize];
    ["Offset of field: _cef_settings_t::resources_dir_path"]
        [::std::mem::offset_of!(_cef_settings_t, resources_dir_path) - 156usize];
    ["Offset of field: _cef_settings_t::locales_dir_path"]
        [::std::mem::offset_of!(_cef_settings_t, locales_dir_path) - 168usize];
    ["Offset of field: _cef_settings_t::remote_debugging_port"]
        [::std::mem::offset_of!(_cef_settings_t, remote_debugging_port) - 180usize];
    ["Offset of field: _cef_settings_t::uncaught_exception_stack_size"]
        [::std::mem::offset_of!(_cef_settings_t, uncaught_exception_stack_size) - 184usize];
    ["Offset of field: _cef_settings_t::background_color"]
        [::std::mem::offset_of!(_cef_settings_t, background_color) - 188usize];
    ["Offset of field: _cef_settings_t::accept_language_list"]
        [::std::mem::offset_of!(_cef_settings_t, accept_language_list) - 192usize];
    ["Offset of field: _cef_settings_t::cookieable_schemes_list"]
        [::std::mem::offset_of!(_cef_settings_t, cookieable_schemes_list) - 204usize];
    ["Offset of field: _cef_settings_t::cookieable_schemes_exclude_defaults"]
        [::std::mem::offset_of!(_cef_settings_t, cookieable_schemes_exclude_defaults) - 216usize];
    ["Offset of field: _cef_settings_t::chrome_policy_id"]
        [::std::mem::offset_of!(_cef_settings_t, chrome_policy_id) - 220usize];
    ["Offset of field: _cef_settings_t::chrome_app_icon_id"]
        [::std::mem::offset_of!(_cef_settings_t, chrome_app_icon_id) - 232usize];
    ["Offset of field: _cef_settings_t::disable_signal_handlers"]
        [::std::mem::offset_of!(_cef_settings_t, disable_signal_handlers) - 236usize];
    ["Offset of field: _cef_settings_t::use_views_default_popup"]
        [::std::mem::offset_of!(_cef_settings_t, use_views_default_popup) - 240usize];
};
pub type cef_settings_t = _cef_settings_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_request_context_settings_t {
    pub size: usize,
    pub cache_path: cef_string_t,
    pub persist_session_cookies: ::std::os::raw::c_int,
    pub accept_language_list: cef_string_t,
    pub cookieable_schemes_list: cef_string_t,
    pub cookieable_schemes_exclude_defaults: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_request_context_settings_t"]
        [::std::mem::size_of::<_cef_request_context_settings_t>() - 48usize];
    ["Alignment of _cef_request_context_settings_t"]
        [::std::mem::align_of::<_cef_request_context_settings_t>() - 4usize];
    ["Offset of field: _cef_request_context_settings_t::size"]
        [::std::mem::offset_of!(_cef_request_context_settings_t, size) - 0usize];
    ["Offset of field: _cef_request_context_settings_t::cache_path"]
        [::std::mem::offset_of!(_cef_request_context_settings_t, cache_path) - 4usize];
    ["Offset of field: _cef_request_context_settings_t::persist_session_cookies"][::std::mem::offset_of!(
        _cef_request_context_settings_t,
        persist_session_cookies
    ) - 16usize];
    ["Offset of field: _cef_request_context_settings_t::accept_language_list"]
        [::std::mem::offset_of!(_cef_request_context_settings_t, accept_language_list) - 20usize];
    ["Offset of field: _cef_request_context_settings_t::cookieable_schemes_list"][::std::mem::offset_of!(
        _cef_request_context_settings_t,
        cookieable_schemes_list
    ) - 32usize];
    ["Offset of field: _cef_request_context_settings_t::cookieable_schemes_exclude_defaults"][::std::mem::offset_of!(
        _cef_request_context_settings_t,
        cookieable_schemes_exclude_defaults
    )
        - 44usize];
};
pub type cef_request_context_settings_t = _cef_request_context_settings_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_browser_settings_t {
    pub size: usize,
    pub windowless_frame_rate: ::std::os::raw::c_int,
    pub standard_font_family: cef_string_t,
    pub fixed_font_family: cef_string_t,
    pub serif_font_family: cef_string_t,
    pub sans_serif_font_family: cef_string_t,
    pub cursive_font_family: cef_string_t,
    pub fantasy_font_family: cef_string_t,
    pub default_font_size: ::std::os::raw::c_int,
    pub default_fixed_font_size: ::std::os::raw::c_int,
    pub minimum_font_size: ::std::os::raw::c_int,
    pub minimum_logical_font_size: ::std::os::raw::c_int,
    pub default_encoding: cef_string_t,
    pub remote_fonts: cef_state_t::Type,
    pub javascript: cef_state_t::Type,
    pub javascript_close_windows: cef_state_t::Type,
    pub javascript_access_clipboard: cef_state_t::Type,
    pub javascript_dom_paste: cef_state_t::Type,
    pub image_loading: cef_state_t::Type,
    pub image_shrink_standalone_to_fit: cef_state_t::Type,
    pub text_area_resize: cef_state_t::Type,
    pub tab_to_links: cef_state_t::Type,
    pub local_storage: cef_state_t::Type,
    pub databases_deprecated: cef_state_t::Type,
    pub webgl: cef_state_t::Type,
    pub background_color: cef_color_t,
    pub chrome_status_bubble: cef_state_t::Type,
    pub chrome_zoom_bubble: cef_state_t::Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_browser_settings_t"]
        [::std::mem::size_of::<_cef_browser_settings_t>() - 168usize];
    ["Alignment of _cef_browser_settings_t"]
        [::std::mem::align_of::<_cef_browser_settings_t>() - 4usize];
    ["Offset of field: _cef_browser_settings_t::size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, size) - 0usize];
    ["Offset of field: _cef_browser_settings_t::windowless_frame_rate"]
        [::std::mem::offset_of!(_cef_browser_settings_t, windowless_frame_rate) - 4usize];
    ["Offset of field: _cef_browser_settings_t::standard_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, standard_font_family) - 8usize];
    ["Offset of field: _cef_browser_settings_t::fixed_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, fixed_font_family) - 20usize];
    ["Offset of field: _cef_browser_settings_t::serif_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, serif_font_family) - 32usize];
    ["Offset of field: _cef_browser_settings_t::sans_serif_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, sans_serif_font_family) - 44usize];
    ["Offset of field: _cef_browser_settings_t::cursive_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, cursive_font_family) - 56usize];
    ["Offset of field: _cef_browser_settings_t::fantasy_font_family"]
        [::std::mem::offset_of!(_cef_browser_settings_t, fantasy_font_family) - 68usize];
    ["Offset of field: _cef_browser_settings_t::default_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, default_font_size) - 80usize];
    ["Offset of field: _cef_browser_settings_t::default_fixed_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, default_fixed_font_size) - 84usize];
    ["Offset of field: _cef_browser_settings_t::minimum_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, minimum_font_size) - 88usize];
    ["Offset of field: _cef_browser_settings_t::minimum_logical_font_size"]
        [::std::mem::offset_of!(_cef_browser_settings_t, minimum_logical_font_size) - 92usize];
    ["Offset of field: _cef_browser_settings_t::default_encoding"]
        [::std::mem::offset_of!(_cef_browser_settings_t, default_encoding) - 96usize];
    ["Offset of field: _cef_browser_settings_t::remote_fonts"]
        [::std::mem::offset_of!(_cef_browser_settings_t, remote_fonts) - 108usize];
    ["Offset of field: _cef_browser_settings_t::javascript"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript) - 112usize];
    ["Offset of field: _cef_browser_settings_t::javascript_close_windows"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript_close_windows) - 116usize];
    ["Offset of field: _cef_browser_settings_t::javascript_access_clipboard"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript_access_clipboard) - 120usize];
    ["Offset of field: _cef_browser_settings_t::javascript_dom_paste"]
        [::std::mem::offset_of!(_cef_browser_settings_t, javascript_dom_paste) - 124usize];
    ["Offset of field: _cef_browser_settings_t::image_loading"]
        [::std::mem::offset_of!(_cef_browser_settings_t, image_loading) - 128usize];
    ["Offset of field: _cef_browser_settings_t::image_shrink_standalone_to_fit"][::std::mem::offset_of!(
        _cef_browser_settings_t,
        image_shrink_standalone_to_fit
    ) - 132usize];
    ["Offset of field: _cef_browser_settings_t::text_area_resize"]
        [::std::mem::offset_of!(_cef_browser_settings_t, text_area_resize) - 136usize];
    ["Offset of field: _cef_browser_settings_t::tab_to_links"]
        [::std::mem::offset_of!(_cef_browser_settings_t, tab_to_links) - 140usize];
    ["Offset of field: _cef_browser_settings_t::local_storage"]
        [::std::mem::offset_of!(_cef_browser_settings_t, local_storage) - 144usize];
    ["Offset of field: _cef_browser_settings_t::databases_deprecated"]
        [::std::mem::offset_of!(_cef_browser_settings_t, databases_deprecated) - 148usize];
    ["Offset of field: _cef_browser_settings_t::webgl"]
        [::std::mem::offset_of!(_cef_browser_settings_t, webgl) - 152usize];
    ["Offset of field: _cef_browser_settings_t::background_color"]
        [::std::mem::offset_of!(_cef_browser_settings_t, background_color) - 156usize];
    ["Offset of field: _cef_browser_settings_t::chrome_status_bubble"]
        [::std::mem::offset_of!(_cef_browser_settings_t, chrome_status_bubble) - 160usize];
    ["Offset of field: _cef_browser_settings_t::chrome_zoom_bubble"]
        [::std::mem::offset_of!(_cef_browser_settings_t, chrome_zoom_bubble) - 164usize];
};
pub type cef_browser_settings_t = _cef_browser_settings_t;
pub mod cef_return_value_t {
    pub type Type = ::std::os::raw::c_int;
    pub const RV_CANCEL: Type = 0;
    pub const RV_CONTINUE: Type = 1;
    pub const RV_CONTINUE_ASYNC: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlparts_t {
    pub size: usize,
    pub spec: cef_string_t,
    pub scheme: cef_string_t,
    pub username: cef_string_t,
    pub password: cef_string_t,
    pub host: cef_string_t,
    pub port: cef_string_t,
    pub origin: cef_string_t,
    pub path: cef_string_t,
    pub query: cef_string_t,
    pub fragment: cef_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_urlparts_t"][::std::mem::size_of::<_cef_urlparts_t>() - 124usize];
    ["Alignment of _cef_urlparts_t"][::std::mem::align_of::<_cef_urlparts_t>() - 4usize];
    ["Offset of field: _cef_urlparts_t::size"]
        [::std::mem::offset_of!(_cef_urlparts_t, size) - 0usize];
    ["Offset of field: _cef_urlparts_t::spec"]
        [::std::mem::offset_of!(_cef_urlparts_t, spec) - 4usize];
    ["Offset of field: _cef_urlparts_t::scheme"]
        [::std::mem::offset_of!(_cef_urlparts_t, scheme) - 16usize];
    ["Offset of field: _cef_urlparts_t::username"]
        [::std::mem::offset_of!(_cef_urlparts_t, username) - 28usize];
    ["Offset of field: _cef_urlparts_t::password"]
        [::std::mem::offset_of!(_cef_urlparts_t, password) - 40usize];
    ["Offset of field: _cef_urlparts_t::host"]
        [::std::mem::offset_of!(_cef_urlparts_t, host) - 52usize];
    ["Offset of field: _cef_urlparts_t::port"]
        [::std::mem::offset_of!(_cef_urlparts_t, port) - 64usize];
    ["Offset of field: _cef_urlparts_t::origin"]
        [::std::mem::offset_of!(_cef_urlparts_t, origin) - 76usize];
    ["Offset of field: _cef_urlparts_t::path"]
        [::std::mem::offset_of!(_cef_urlparts_t, path) - 88usize];
    ["Offset of field: _cef_urlparts_t::query"]
        [::std::mem::offset_of!(_cef_urlparts_t, query) - 100usize];
    ["Offset of field: _cef_urlparts_t::fragment"]
        [::std::mem::offset_of!(_cef_urlparts_t, fragment) - 112usize];
};
pub type cef_urlparts_t = _cef_urlparts_t;
pub mod cef_cookie_priority_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_COOKIE_PRIORITY_LOW: Type = -1;
    pub const CEF_COOKIE_PRIORITY_MEDIUM: Type = 0;
    pub const CEF_COOKIE_PRIORITY_HIGH: Type = 1;
}
pub mod cef_cookie_same_site_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_COOKIE_SAME_SITE_UNSPECIFIED: Type = 0;
    pub const CEF_COOKIE_SAME_SITE_NO_RESTRICTION: Type = 1;
    pub const CEF_COOKIE_SAME_SITE_LAX_MODE: Type = 2;
    pub const CEF_COOKIE_SAME_SITE_STRICT_MODE: Type = 3;
    pub const CEF_COOKIE_SAME_SITE_NUM_VALUES: Type = 4;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cookie_t {
    pub size: usize,
    pub name: cef_string_t,
    pub value: cef_string_t,
    pub domain: cef_string_t,
    pub path: cef_string_t,
    pub secure: ::std::os::raw::c_int,
    pub httponly: ::std::os::raw::c_int,
    pub creation: cef_basetime_t,
    pub last_access: cef_basetime_t,
    pub has_expires: ::std::os::raw::c_int,
    pub expires: cef_basetime_t,
    pub same_site: cef_cookie_same_site_t::Type,
    pub priority: cef_cookie_priority_t::Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_cookie_t"][::std::mem::size_of::<_cef_cookie_t>() - 104usize];
    ["Alignment of _cef_cookie_t"][::std::mem::align_of::<_cef_cookie_t>() - 8usize];
    ["Offset of field: _cef_cookie_t::size"][::std::mem::offset_of!(_cef_cookie_t, size) - 0usize];
    ["Offset of field: _cef_cookie_t::name"][::std::mem::offset_of!(_cef_cookie_t, name) - 4usize];
    ["Offset of field: _cef_cookie_t::value"]
        [::std::mem::offset_of!(_cef_cookie_t, value) - 16usize];
    ["Offset of field: _cef_cookie_t::domain"]
        [::std::mem::offset_of!(_cef_cookie_t, domain) - 28usize];
    ["Offset of field: _cef_cookie_t::path"][::std::mem::offset_of!(_cef_cookie_t, path) - 40usize];
    ["Offset of field: _cef_cookie_t::secure"]
        [::std::mem::offset_of!(_cef_cookie_t, secure) - 52usize];
    ["Offset of field: _cef_cookie_t::httponly"]
        [::std::mem::offset_of!(_cef_cookie_t, httponly) - 56usize];
    ["Offset of field: _cef_cookie_t::creation"]
        [::std::mem::offset_of!(_cef_cookie_t, creation) - 64usize];
    ["Offset of field: _cef_cookie_t::last_access"]
        [::std::mem::offset_of!(_cef_cookie_t, last_access) - 72usize];
    ["Offset of field: _cef_cookie_t::has_expires"]
        [::std::mem::offset_of!(_cef_cookie_t, has_expires) - 80usize];
    ["Offset of field: _cef_cookie_t::expires"]
        [::std::mem::offset_of!(_cef_cookie_t, expires) - 88usize];
    ["Offset of field: _cef_cookie_t::same_site"]
        [::std::mem::offset_of!(_cef_cookie_t, same_site) - 96usize];
    ["Offset of field: _cef_cookie_t::priority"]
        [::std::mem::offset_of!(_cef_cookie_t, priority) - 100usize];
};
pub type cef_cookie_t = _cef_cookie_t;
pub mod cef_termination_status_t {
    pub type Type = ::std::os::raw::c_int;
    pub const TS_ABNORMAL_TERMINATION: Type = 0;
    pub const TS_PROCESS_WAS_KILLED: Type = 1;
    pub const TS_PROCESS_CRASHED: Type = 2;
    pub const TS_PROCESS_OOM: Type = 3;
    pub const TS_LAUNCH_FAILED: Type = 4;
    pub const TS_INTEGRITY_FAILURE: Type = 5;
    pub const TS_NUM_VALUES: Type = 6;
}
pub mod cef_path_key_t {
    pub type Type = ::std::os::raw::c_int;
    pub const PK_DIR_CURRENT: Type = 0;
    pub const PK_DIR_EXE: Type = 1;
    pub const PK_DIR_MODULE: Type = 2;
    pub const PK_DIR_TEMP: Type = 3;
    pub const PK_FILE_EXE: Type = 4;
    pub const PK_FILE_MODULE: Type = 5;
    pub const PK_LOCAL_APP_DATA: Type = 6;
    pub const PK_USER_DATA: Type = 7;
    pub const PK_DIR_RESOURCES: Type = 8;
    pub const PK_NUM_VALUES: Type = 9;
}
pub mod cef_storage_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const ST_LOCALSTORAGE: Type = 0;
    pub const ST_SESSIONSTORAGE: Type = 1;
}
pub mod cef_errorcode_t {
    pub type Type = ::std::os::raw::c_int;
    pub const ERR_NONE: Type = 0;
    pub const ERR_IO_PENDING: Type = -1;
    pub const ERR_FAILED: Type = -2;
    pub const ERR_ABORTED: Type = -3;
    pub const ERR_INVALID_ARGUMENT: Type = -4;
    pub const ERR_INVALID_HANDLE: Type = -5;
    pub const ERR_FILE_NOT_FOUND: Type = -6;
    pub const ERR_TIMED_OUT: Type = -7;
    pub const ERR_FILE_TOO_BIG: Type = -8;
    pub const ERR_UNEXPECTED: Type = -9;
    pub const ERR_ACCESS_DENIED: Type = -10;
    pub const ERR_NOT_IMPLEMENTED: Type = -11;
    pub const ERR_INSUFFICIENT_RESOURCES: Type = -12;
    pub const ERR_OUT_OF_MEMORY: Type = -13;
    pub const ERR_UPLOAD_FILE_CHANGED: Type = -14;
    pub const ERR_SOCKET_NOT_CONNECTED: Type = -15;
    pub const ERR_FILE_EXISTS: Type = -16;
    pub const ERR_FILE_PATH_TOO_LONG: Type = -17;
    pub const ERR_FILE_NO_SPACE: Type = -18;
    pub const ERR_FILE_VIRUS_INFECTED: Type = -19;
    pub const ERR_BLOCKED_BY_CLIENT: Type = -20;
    pub const ERR_NETWORK_CHANGED: Type = -21;
    pub const ERR_BLOCKED_BY_ADMINISTRATOR: Type = -22;
    pub const ERR_SOCKET_IS_CONNECTED: Type = -23;
    pub const ERR_UPLOAD_STREAM_REWIND_NOT_SUPPORTED: Type = -25;
    pub const ERR_CONTEXT_SHUT_DOWN: Type = -26;
    pub const ERR_BLOCKED_BY_RESPONSE: Type = -27;
    pub const ERR_CLEARTEXT_NOT_PERMITTED: Type = -29;
    pub const ERR_BLOCKED_BY_CSP: Type = -30;
    pub const ERR_BLOCKED_BY_ORB: Type = -32;
    pub const ERR_NETWORK_ACCESS_REVOKED: Type = -33;
    pub const ERR_BLOCKED_BY_FINGERPRINTING_PROTECTION: Type = -34;
    pub const ERR_BLOCKED_IN_INCOGNITO_BY_ADMINISTRATOR: Type = -35;
    pub const ERR_LOCAL_NETWORK_PERMISSION_MISSING: Type = -36;
    pub const ERR_STRICT_ECH_REQUIRED: Type = -37;
    pub const ERR_CONNECTION_CLOSED: Type = -100;
    pub const ERR_CONNECTION_RESET: Type = -101;
    pub const ERR_CONNECTION_REFUSED: Type = -102;
    pub const ERR_CONNECTION_ABORTED: Type = -103;
    pub const ERR_CONNECTION_FAILED: Type = -104;
    pub const ERR_NAME_NOT_RESOLVED: Type = -105;
    pub const ERR_INTERNET_DISCONNECTED: Type = -106;
    pub const ERR_SSL_PROTOCOL_ERROR: Type = -107;
    pub const ERR_ADDRESS_INVALID: Type = -108;
    pub const ERR_ADDRESS_UNREACHABLE: Type = -109;
    pub const ERR_SSL_CLIENT_AUTH_CERT_NEEDED: Type = -110;
    pub const ERR_TUNNEL_CONNECTION_FAILED: Type = -111;
    pub const ERR_SSL_VERSION_OR_CIPHER_MISMATCH: Type = -113;
    pub const ERR_SSL_RENEGOTIATION_REQUESTED: Type = -114;
    pub const ERR_PROXY_AUTH_UNSUPPORTED: Type = -115;
    pub const ERR_BAD_SSL_CLIENT_AUTH_CERT: Type = -117;
    pub const ERR_CONNECTION_TIMED_OUT: Type = -118;
    pub const ERR_HOST_RESOLVER_QUEUE_TOO_LARGE: Type = -119;
    pub const ERR_SOCKS_CONNECTION_FAILED: Type = -120;
    pub const ERR_SOCKS_CONNECTION_HOST_UNREACHABLE: Type = -121;
    pub const ERR_ALPN_NEGOTIATION_FAILED: Type = -122;
    pub const ERR_SSL_NO_RENEGOTIATION: Type = -123;
    pub const ERR_WINSOCK_UNEXPECTED_WRITTEN_BYTES: Type = -124;
    pub const ERR_SSL_DECOMPRESSION_FAILURE_ALERT: Type = -125;
    pub const ERR_SSL_BAD_RECORD_MAC_ALERT: Type = -126;
    pub const ERR_PROXY_AUTH_REQUESTED: Type = -127;
    pub const ERR_PROXY_CONNECTION_FAILED: Type = -130;
    pub const ERR_MANDATORY_PROXY_CONFIGURATION_FAILED: Type = -131;
    pub const ERR_PRECONNECT_MAX_SOCKET_LIMIT: Type = -133;
    pub const ERR_SSL_CLIENT_AUTH_PRIVATE_KEY_ACCESS_DENIED: Type = -134;
    pub const ERR_SSL_CLIENT_AUTH_CERT_NO_PRIVATE_KEY: Type = -135;
    pub const ERR_PROXY_CERTIFICATE_INVALID: Type = -136;
    pub const ERR_NAME_RESOLUTION_FAILED: Type = -137;
    pub const ERR_NETWORK_ACCESS_DENIED: Type = -138;
    pub const ERR_TEMPORARILY_THROTTLED: Type = -139;
    pub const ERR_SSL_CLIENT_AUTH_SIGNATURE_FAILED: Type = -141;
    pub const ERR_MSG_TOO_BIG: Type = -142;
    pub const ERR_WS_PROTOCOL_ERROR: Type = -145;
    pub const ERR_ADDRESS_IN_USE: Type = -147;
    pub const ERR_SSL_PINNED_KEY_NOT_IN_CERT_CHAIN: Type = -150;
    pub const ERR_CLIENT_AUTH_CERT_TYPE_UNSUPPORTED: Type = -151;
    pub const ERR_SSL_DECRYPT_ERROR_ALERT: Type = -153;
    pub const ERR_WS_THROTTLE_QUEUE_TOO_LARGE: Type = -154;
    pub const ERR_SSL_SERVER_CERT_CHANGED: Type = -156;
    pub const ERR_SSL_UNRECOGNIZED_NAME_ALERT: Type = -159;
    pub const ERR_SOCKET_SET_RECEIVE_BUFFER_SIZE_ERROR: Type = -160;
    pub const ERR_SOCKET_SET_SEND_BUFFER_SIZE_ERROR: Type = -161;
    pub const ERR_SOCKET_RECEIVE_BUFFER_SIZE_UNCHANGEABLE: Type = -162;
    pub const ERR_SOCKET_SEND_BUFFER_SIZE_UNCHANGEABLE: Type = -163;
    pub const ERR_SSL_CLIENT_AUTH_CERT_BAD_FORMAT: Type = -164;
    pub const ERR_ICANN_NAME_COLLISION: Type = -166;
    pub const ERR_SSL_SERVER_CERT_BAD_FORMAT: Type = -167;
    pub const ERR_CT_STH_PARSING_FAILED: Type = -168;
    pub const ERR_CT_STH_INCOMPLETE: Type = -169;
    pub const ERR_UNABLE_TO_REUSE_CONNECTION_FOR_PROXY_AUTH: Type = -170;
    pub const ERR_CT_CONSISTENCY_PROOF_PARSING_FAILED: Type = -171;
    pub const ERR_SSL_OBSOLETE_CIPHER: Type = -172;
    pub const ERR_WS_UPGRADE: Type = -173;
    pub const ERR_READ_IF_READY_NOT_IMPLEMENTED: Type = -174;
    pub const ERR_NO_BUFFER_SPACE: Type = -176;
    pub const ERR_SSL_CLIENT_AUTH_NO_COMMON_ALGORITHMS: Type = -177;
    pub const ERR_EARLY_DATA_REJECTED: Type = -178;
    pub const ERR_WRONG_VERSION_ON_EARLY_DATA: Type = -179;
    pub const ERR_TLS13_DOWNGRADE_DETECTED: Type = -180;
    pub const ERR_SSL_KEY_USAGE_INCOMPATIBLE: Type = -181;
    pub const ERR_INVALID_ECH_CONFIG_LIST: Type = -182;
    pub const ERR_ECH_NOT_NEGOTIATED: Type = -183;
    pub const ERR_ECH_FALLBACK_CERTIFICATE_INVALID: Type = -184;
    pub const ERR_PROXY_UNABLE_TO_CONNECT_TO_DESTINATION: Type = -186;
    pub const ERR_PROXY_DELEGATE_CANCELED_CONNECT_REQUEST: Type = -187;
    pub const ERR_PROXY_DELEGATE_CANCELED_CONNECT_RESPONSE: Type = -188;
    pub const ERR_CERT_COMMON_NAME_INVALID: Type = -200;
    pub const ERR_CERT_DATE_INVALID: Type = -201;
    pub const ERR_CERT_AUTHORITY_INVALID: Type = -202;
    pub const ERR_CERT_CONTAINS_ERRORS: Type = -203;
    pub const ERR_CERT_NO_REVOCATION_MECHANISM: Type = -204;
    pub const ERR_CERT_UNABLE_TO_CHECK_REVOCATION: Type = -205;
    pub const ERR_CERT_REVOKED: Type = -206;
    pub const ERR_CERT_INVALID: Type = -207;
    pub const ERR_CERT_WEAK_SIGNATURE_ALGORITHM: Type = -208;
    pub const ERR_CERT_NON_UNIQUE_NAME: Type = -210;
    pub const ERR_CERT_WEAK_KEY: Type = -211;
    pub const ERR_CERT_NAME_CONSTRAINT_VIOLATION: Type = -212;
    pub const ERR_CERT_VALIDITY_TOO_LONG: Type = -213;
    pub const ERR_CERTIFICATE_TRANSPARENCY_REQUIRED: Type = -214;
    pub const ERR_CERT_KNOWN_INTERCEPTION_BLOCKED: Type = -217;
    pub const ERR_CERT_SELF_SIGNED_LOCAL_NETWORK: Type = -219;
    pub const ERR_CERT_END: Type = -220;
    pub const ERR_INVALID_URL: Type = -300;
    pub const ERR_DISALLOWED_URL_SCHEME: Type = -301;
    pub const ERR_UNKNOWN_URL_SCHEME: Type = -302;
    pub const ERR_INVALID_REDIRECT: Type = -303;
    pub const ERR_TOO_MANY_REDIRECTS: Type = -310;
    pub const ERR_UNSAFE_REDIRECT: Type = -311;
    pub const ERR_UNSAFE_PORT: Type = -312;
    pub const ERR_INVALID_RESPONSE: Type = -320;
    pub const ERR_INVALID_CHUNKED_ENCODING: Type = -321;
    pub const ERR_METHOD_NOT_SUPPORTED: Type = -322;
    pub const ERR_UNEXPECTED_PROXY_AUTH: Type = -323;
    pub const ERR_EMPTY_RESPONSE: Type = -324;
    pub const ERR_RESPONSE_HEADERS_TOO_BIG: Type = -325;
    pub const ERR_PAC_SCRIPT_FAILED: Type = -327;
    pub const ERR_REQUEST_RANGE_NOT_SATISFIABLE: Type = -328;
    pub const ERR_MALFORMED_IDENTITY: Type = -329;
    pub const ERR_CONTENT_DECODING_FAILED: Type = -330;
    pub const ERR_NETWORK_IO_SUSPENDED: Type = -331;
    pub const ERR_NO_SUPPORTED_PROXIES: Type = -336;
    pub const ERR_HTTP2_PROTOCOL_ERROR: Type = -337;
    pub const ERR_INVALID_AUTH_CREDENTIALS: Type = -338;
    pub const ERR_UNSUPPORTED_AUTH_SCHEME: Type = -339;
    pub const ERR_ENCODING_DETECTION_FAILED: Type = -340;
    pub const ERR_MISSING_AUTH_CREDENTIALS: Type = -341;
    pub const ERR_UNEXPECTED_SECURITY_LIBRARY_STATUS: Type = -342;
    pub const ERR_MISCONFIGURED_AUTH_ENVIRONMENT: Type = -343;
    pub const ERR_UNDOCUMENTED_SECURITY_LIBRARY_STATUS: Type = -344;
    pub const ERR_RESPONSE_BODY_TOO_BIG_TO_DRAIN: Type = -345;
    pub const ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_LENGTH: Type = -346;
    pub const ERR_INCOMPLETE_HTTP2_HEADERS: Type = -347;
    pub const ERR_PAC_NOT_IN_DHCP: Type = -348;
    pub const ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_DISPOSITION: Type = -349;
    pub const ERR_RESPONSE_HEADERS_MULTIPLE_LOCATION: Type = -350;
    pub const ERR_HTTP2_SERVER_REFUSED_STREAM: Type = -351;
    pub const ERR_HTTP2_PING_FAILED: Type = -352;
    pub const ERR_CONTENT_LENGTH_MISMATCH: Type = -354;
    pub const ERR_INCOMPLETE_CHUNKED_ENCODING: Type = -355;
    pub const ERR_QUIC_PROTOCOL_ERROR: Type = -356;
    pub const ERR_RESPONSE_HEADERS_TRUNCATED: Type = -357;
    pub const ERR_QUIC_HANDSHAKE_FAILED: Type = -358;
    pub const ERR_HTTP2_INADEQUATE_TRANSPORT_SECURITY: Type = -360;
    pub const ERR_HTTP2_FLOW_CONTROL_ERROR: Type = -361;
    pub const ERR_HTTP2_FRAME_SIZE_ERROR: Type = -362;
    pub const ERR_HTTP2_COMPRESSION_ERROR: Type = -363;
    pub const ERR_PROXY_AUTH_REQUESTED_WITH_NO_CONNECTION: Type = -364;
    pub const ERR_HTTP_1_1_REQUIRED: Type = -365;
    pub const ERR_PROXY_HTTP_1_1_REQUIRED: Type = -366;
    pub const ERR_PAC_SCRIPT_TERMINATED: Type = -367;
    pub const ERR_INVALID_HTTP_RESPONSE: Type = -370;
    pub const ERR_CONTENT_DECODING_INIT_FAILED: Type = -371;
    pub const ERR_HTTP2_RST_STREAM_NO_ERROR_RECEIVED: Type = -372;
    pub const ERR_TOO_MANY_RETRIES: Type = -375;
    pub const ERR_HTTP2_STREAM_CLOSED: Type = -376;
    pub const ERR_HTTP_RESPONSE_CODE_FAILURE: Type = -379;
    pub const ERR_QUIC_CERT_ROOT_NOT_KNOWN: Type = -380;
    pub const ERR_QUIC_GOAWAY_REQUEST_CAN_BE_RETRIED: Type = -381;
    pub const ERR_TOO_MANY_ACCEPT_CH_RESTARTS: Type = -382;
    pub const ERR_INCONSISTENT_IP_ADDRESS_SPACE: Type = -383;
    pub const ERR_CACHED_IP_ADDRESS_SPACE_BLOCKED_BY_LOCAL_NETWORK_ACCESS_POLICY: Type = -384;
    pub const ERR_BLOCKED_BY_LOCAL_NETWORK_ACCESS_CHECKS: Type = -385;
    pub const ERR_ZSTD_WINDOW_SIZE_TOO_BIG: Type = -386;
    pub const ERR_DICTIONARY_LOAD_FAILED: Type = -387;
    pub const ERR_UNEXPECTED_CONTENT_DICTIONARY_HEADER: Type = -388;
    pub const ERR_CACHE_MISS: Type = -400;
    pub const ERR_CACHE_READ_FAILURE: Type = -401;
    pub const ERR_CACHE_WRITE_FAILURE: Type = -402;
    pub const ERR_CACHE_OPERATION_NOT_SUPPORTED: Type = -403;
    pub const ERR_CACHE_OPEN_FAILURE: Type = -404;
    pub const ERR_CACHE_CREATE_FAILURE: Type = -405;
    pub const ERR_CACHE_RACE: Type = -406;
    pub const ERR_CACHE_CHECKSUM_READ_FAILURE: Type = -407;
    pub const ERR_CACHE_CHECKSUM_MISMATCH: Type = -408;
    pub const ERR_CACHE_LOCK_TIMEOUT: Type = -409;
    pub const ERR_CACHE_AUTH_FAILURE_AFTER_READ: Type = -410;
    pub const ERR_CACHE_ENTRY_NOT_SUITABLE: Type = -411;
    pub const ERR_CACHE_DOOM_FAILURE: Type = -412;
    pub const ERR_CACHE_OPEN_OR_CREATE_FAILURE: Type = -413;
    pub const ERR_CACHE_COMPRESSION_FAILURE: Type = -414;
    pub const ERR_INSECURE_RESPONSE: Type = -501;
    pub const ERR_NO_PRIVATE_KEY_FOR_CERT: Type = -502;
    pub const ERR_ADD_USER_CERT_FAILED: Type = -503;
    pub const ERR_INVALID_SIGNED_EXCHANGE: Type = -504;
    pub const ERR_INVALID_WEB_BUNDLE: Type = -505;
    pub const ERR_TRUST_TOKEN_OPERATION_FAILED: Type = -506;
    pub const ERR_TRUST_TOKEN_OPERATION_SUCCESS_WITHOUT_SENDING_REQUEST: Type = -507;
    pub const ERR_HTTPENGINE_PROVIDER_IN_USE: Type = -508;
    pub const ERR_PKCS12_IMPORT_BAD_PASSWORD: Type = -701;
    pub const ERR_PKCS12_IMPORT_FAILED: Type = -702;
    pub const ERR_IMPORT_CA_CERT_NOT_CA: Type = -703;
    pub const ERR_IMPORT_CERT_ALREADY_EXISTS: Type = -704;
    pub const ERR_IMPORT_CA_CERT_FAILED: Type = -705;
    pub const ERR_IMPORT_SERVER_CERT_FAILED: Type = -706;
    pub const ERR_PKCS12_IMPORT_INVALID_MAC: Type = -707;
    pub const ERR_PKCS12_IMPORT_INVALID_FILE: Type = -708;
    pub const ERR_PKCS12_IMPORT_UNSUPPORTED: Type = -709;
    pub const ERR_KEY_GENERATION_FAILED: Type = -710;
    pub const ERR_PRIVATE_KEY_EXPORT_FAILED: Type = -712;
    pub const ERR_SELF_SIGNED_CERT_GENERATION_FAILED: Type = -713;
    pub const ERR_CERT_DATABASE_CHANGED: Type = -714;
    pub const ERR_CERT_VERIFIER_CHANGED: Type = -716;
    pub const ERR_DNS_MALFORMED_RESPONSE: Type = -800;
    pub const ERR_DNS_SERVER_REQUIRES_TCP: Type = -801;
    pub const ERR_DNS_TIMED_OUT: Type = -803;
    pub const ERR_DNS_CACHE_MISS: Type = -804;
    pub const ERR_DNS_SEARCH_EMPTY: Type = -805;
    pub const ERR_DNS_SORT_ERROR: Type = -806;
    pub const ERR_DNS_SECURE_RESOLVER_HOSTNAME_RESOLUTION_FAILED: Type = -808;
    pub const ERR_DNS_NAME_HTTPS_ONLY: Type = -809;
    pub const ERR_DNS_REQUEST_CANCELLED: Type = -810;
    pub const ERR_DNS_NO_MATCHING_SUPPORTED_ALPN: Type = -811;
    pub const ERR_DNS_SECURE_PROBE_RECORD_INVALID: Type = -814;
    pub const ERR_DNS_CACHE_INVALIDATION_IN_PROGRESS: Type = -815;
    pub const ERR_DNS_FORMAT_ERROR: Type = -816;
    pub const ERR_DNS_SERVER_FAILURE: Type = -817;
    pub const ERR_DNS_NOT_IMPLEMENTED: Type = -818;
    pub const ERR_DNS_REFUSED: Type = -819;
    pub const ERR_DNS_OTHER_FAILURE: Type = -820;
    pub const ERR_BLOB_INVALID_CONSTRUCTION_ARGUMENTS: Type = -900;
    pub const ERR_BLOB_OUT_OF_MEMORY: Type = -901;
    pub const ERR_BLOB_FILE_WRITE_FAILED: Type = -902;
    pub const ERR_BLOB_SOURCE_DIED_IN_TRANSIT: Type = -903;
    pub const ERR_BLOB_DEREFERENCED_WHILE_BUILDING: Type = -904;
    pub const ERR_BLOB_REFERENCED_BLOB_BROKEN: Type = -905;
    pub const ERR_BLOB_REFERENCED_FILE_UNAVAILABLE: Type = -906;
}
pub mod cef_cert_status_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CERT_STATUS_NONE: Type = 0;
    pub const CERT_STATUS_COMMON_NAME_INVALID: Type = 1;
    pub const CERT_STATUS_DATE_INVALID: Type = 2;
    pub const CERT_STATUS_AUTHORITY_INVALID: Type = 4;
    pub const CERT_STATUS_NO_REVOCATION_MECHANISM: Type = 16;
    pub const CERT_STATUS_UNABLE_TO_CHECK_REVOCATION: Type = 32;
    pub const CERT_STATUS_REVOKED: Type = 64;
    pub const CERT_STATUS_INVALID: Type = 128;
    pub const CERT_STATUS_WEAK_SIGNATURE_ALGORITHM: Type = 256;
    pub const CERT_STATUS_NON_UNIQUE_NAME: Type = 1024;
    pub const CERT_STATUS_WEAK_KEY: Type = 2048;
    pub const CERT_STATUS_PINNED_KEY_MISSING: Type = 8192;
    pub const CERT_STATUS_NAME_CONSTRAINT_VIOLATION: Type = 16384;
    pub const CERT_STATUS_VALIDITY_TOO_LONG: Type = 32768;
    pub const CERT_STATUS_IS_EV: Type = 65536;
    pub const CERT_STATUS_REV_CHECKING_ENABLED: Type = 131072;
    pub const CERT_STATUS_SHA1_SIGNATURE_PRESENT: Type = 524288;
    pub const CERT_STATUS_CT_COMPLIANCE_FAILED: Type = 1048576;
}
pub mod cef_resultcode_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_RESULT_CODE_NORMAL_EXIT: Type = 0;
    pub const CEF_RESULT_CODE_KILLED: Type = 1;
    pub const CEF_RESULT_CODE_HUNG: Type = 2;
    pub const CEF_RESULT_CODE_KILLED_BAD_MESSAGE: Type = 3;
    pub const CEF_RESULT_CODE_GPU_DEAD_ON_ARRIVAL: Type = 4;
    pub const CEF_RESULT_CODE_CHROME_FIRST: Type = 5;
    pub const CEF_RESULT_CODE_BAD_PROCESS_TYPE: Type = 6;
    pub const CEF_RESULT_CODE_MISSING_DATA: Type = 7;
    pub const CEF_RESULT_CODE_UNSUPPORTED_PARAM: Type = 13;
    pub const CEF_RESULT_CODE_PROFILE_IN_USE: Type = 21;
    pub const CEF_RESULT_CODE_PACK_EXTENSION_ERROR: Type = 22;
    pub const CEF_RESULT_CODE_NORMAL_EXIT_PROCESS_NOTIFIED: Type = 24;
    pub const CEF_RESULT_CODE_INVALID_SANDBOX_STATE: Type = 31;
    pub const CEF_RESULT_CODE_CLOUD_POLICY_ENROLLMENT_FAILED: Type = 32;
    pub const CEF_RESULT_CODE_GPU_EXIT_ON_CONTEXT_LOST: Type = 34;
    pub const CEF_RESULT_CODE_NORMAL_EXIT_PACK_EXTENSION_SUCCESS: Type = 36;
    pub const CEF_RESULT_CODE_SYSTEM_RESOURCE_EXHAUSTED: Type = 37;
    pub const CEF_RESULT_CODE_NORMAL_EXIT_AUTO_DE_ELEVATED: Type = 38;
    pub const CEF_RESULT_CODE_TERMINATED_BY_OTHER_PROCESS_ON_COMMIT_FAILURE: Type = 39;
    pub const CEF_RESULT_CODE_INVALID_ISOLATED_BROWSER_PROCESS: Type = 40;
    pub const CEF_RESULT_CODE_CHROME_LAST: Type = 41;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_FIRST: Type = 7006;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_INTEGRITY: Type = 7006;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_DROPTOKEN: Type = 7007;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_FLUSHANDLES: Type = 7008;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_CACHEDISABLE: Type = 7009;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_CLOSEHANDLES: Type = 7010;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_MITIGATION: Type = 7011;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_MEMORY_EXCEEDED: Type = 7012;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_WARMUP: Type = 7013;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_BROKER_SHUTDOWN_HUNG: Type = 7014;
    pub const CEF_RESULT_CODE_SANDBOX_FATAL_LAST: Type = 7015;
    pub const CEF_RESULT_CODE_NUM_VALUES: Type = 7016;
}
pub mod cef_window_open_disposition_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_WOD_UNKNOWN: Type = 0;
    pub const CEF_WOD_CURRENT_TAB: Type = 1;
    pub const CEF_WOD_SINGLETON_TAB: Type = 2;
    pub const CEF_WOD_NEW_FOREGROUND_TAB: Type = 3;
    pub const CEF_WOD_NEW_BACKGROUND_TAB: Type = 4;
    pub const CEF_WOD_NEW_POPUP: Type = 5;
    pub const CEF_WOD_NEW_WINDOW: Type = 6;
    pub const CEF_WOD_SAVE_TO_DISK: Type = 7;
    pub const CEF_WOD_OFF_THE_RECORD: Type = 8;
    pub const CEF_WOD_IGNORE_ACTION: Type = 9;
    pub const CEF_WOD_SWITCH_TO_TAB: Type = 10;
    pub const CEF_WOD_NEW_PICTURE_IN_PICTURE: Type = 11;
    pub const CEF_WOD_NEW_SPLIT_VIEW: Type = 12;
    pub const CEF_WOD_NUM_VALUES: Type = 13;
}
pub mod cef_drag_operations_mask_t {
    pub type Type = ::std::os::raw::c_int;
    pub const DRAG_OPERATION_NONE: Type = 0;
    pub const DRAG_OPERATION_COPY: Type = 1;
    pub const DRAG_OPERATION_LINK: Type = 2;
    pub const DRAG_OPERATION_GENERIC: Type = 4;
    pub const DRAG_OPERATION_PRIVATE: Type = 8;
    pub const DRAG_OPERATION_MOVE: Type = 16;
    pub const DRAG_OPERATION_DELETE: Type = 32;
    pub const DRAG_OPERATION_EVERY: Type = -1;
}
pub mod cef_text_input_mode_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TEXT_INPUT_MODE_DEFAULT: Type = 0;
    pub const CEF_TEXT_INPUT_MODE_NONE: Type = 1;
    pub const CEF_TEXT_INPUT_MODE_TEXT: Type = 2;
    pub const CEF_TEXT_INPUT_MODE_TEL: Type = 3;
    pub const CEF_TEXT_INPUT_MODE_URL: Type = 4;
    pub const CEF_TEXT_INPUT_MODE_EMAIL: Type = 5;
    pub const CEF_TEXT_INPUT_MODE_NUMERIC: Type = 6;
    pub const CEF_TEXT_INPUT_MODE_DECIMAL: Type = 7;
    pub const CEF_TEXT_INPUT_MODE_SEARCH: Type = 8;
    pub const CEF_TEXT_INPUT_MODE_NUM_VALUES: Type = 9;
}
pub mod cef_v8_propertyattribute_t {
    pub type Type = ::std::os::raw::c_int;
    pub const V8_PROPERTY_ATTRIBUTE_NONE: Type = 0;
    pub const V8_PROPERTY_ATTRIBUTE_READONLY: Type = 1;
    pub const V8_PROPERTY_ATTRIBUTE_DONTENUM: Type = 2;
    pub const V8_PROPERTY_ATTRIBUTE_DONTDELETE: Type = 4;
}
pub mod cef_postdataelement_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const PDE_TYPE_EMPTY: Type = 0;
    pub const PDE_TYPE_BYTES: Type = 1;
    pub const PDE_TYPE_FILE: Type = 2;
    pub const PDE_TYPE_NUM_VALUES: Type = 3;
}
pub mod cef_resource_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const RT_MAIN_FRAME: Type = 0;
    pub const RT_SUB_FRAME: Type = 1;
    pub const RT_STYLESHEET: Type = 2;
    pub const RT_SCRIPT: Type = 3;
    pub const RT_IMAGE: Type = 4;
    pub const RT_FONT_RESOURCE: Type = 5;
    pub const RT_SUB_RESOURCE: Type = 6;
    pub const RT_OBJECT: Type = 7;
    pub const RT_MEDIA: Type = 8;
    pub const RT_WORKER: Type = 9;
    pub const RT_SHARED_WORKER: Type = 10;
    pub const RT_PREFETCH: Type = 11;
    pub const RT_FAVICON: Type = 12;
    pub const RT_XHR: Type = 13;
    pub const RT_PING: Type = 14;
    pub const RT_SERVICE_WORKER: Type = 15;
    pub const RT_CSP_REPORT: Type = 16;
    pub const RT_PLUGIN_RESOURCE: Type = 17;
    pub const RT_NAVIGATION_PRELOAD_MAIN_FRAME: Type = 19;
    pub const RT_NAVIGATION_PRELOAD_SUB_FRAME: Type = 20;
    pub const RT_NUM_VALUES: Type = 21;
}
pub mod cef_transition_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const TT_LINK: Type = 0;
    pub const TT_EXPLICIT: Type = 1;
    pub const TT_AUTO_BOOKMARK: Type = 2;
    pub const TT_AUTO_SUBFRAME: Type = 3;
    pub const TT_MANUAL_SUBFRAME: Type = 4;
    pub const TT_GENERATED: Type = 5;
    pub const TT_AUTO_TOPLEVEL: Type = 6;
    pub const TT_FORM_SUBMIT: Type = 7;
    pub const TT_RELOAD: Type = 8;
    pub const TT_KEYWORD: Type = 9;
    pub const TT_KEYWORD_GENERATED: Type = 10;
    pub const TT_NUM_VALUES: Type = 11;
    pub const TT_SOURCE_MASK: Type = 255;
    pub const TT_BLOCKED_FLAG: Type = 8388608;
    pub const TT_FORWARD_BACK_FLAG: Type = 16777216;
    pub const TT_DIRECT_LOAD_FLAG: Type = 33554432;
    pub const TT_HOME_PAGE_FLAG: Type = 67108864;
    pub const TT_FROM_API_FLAG: Type = 134217728;
    pub const TT_CHAIN_START_FLAG: Type = 268435456;
    pub const TT_CHAIN_END_FLAG: Type = 536870912;
    pub const TT_CLIENT_REDIRECT_FLAG: Type = 1073741824;
    pub const TT_SERVER_REDIRECT_FLAG: Type = -2147483648;
    pub const TT_IS_REDIRECT_MASK: Type = -1073741824;
    pub const TT_QUALIFIER_MASK: Type = -256;
}
pub mod cef_urlrequest_flags_t {
    pub type Type = ::std::os::raw::c_int;
    pub const UR_FLAG_NONE: Type = 0;
    pub const UR_FLAG_SKIP_CACHE: Type = 1;
    pub const UR_FLAG_ONLY_FROM_CACHE: Type = 2;
    pub const UR_FLAG_DISABLE_CACHE: Type = 4;
    pub const UR_FLAG_ALLOW_STORED_CREDENTIALS: Type = 8;
    pub const UR_FLAG_REPORT_UPLOAD_PROGRESS: Type = 16;
    pub const UR_FLAG_NO_DOWNLOAD_DATA: Type = 32;
    pub const UR_FLAG_NO_RETRY_ON_5XX: Type = 64;
    pub const UR_FLAG_STOP_ON_REDIRECT: Type = 128;
}
pub mod cef_urlrequest_status_t {
    pub type Type = ::std::os::raw::c_int;
    pub const UR_UNKNOWN: Type = 0;
    pub const UR_SUCCESS: Type = 1;
    pub const UR_IO_PENDING: Type = 2;
    pub const UR_CANCELED: Type = 3;
    pub const UR_FAILED: Type = 4;
    pub const UR_NUM_VALUES: Type = 5;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_draggable_region_t {
    pub bounds: cef_rect_t,
    pub draggable: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_draggable_region_t"][::std::mem::size_of::<_cef_draggable_region_t>() - 20usize];
    ["Alignment of _cef_draggable_region_t"]
        [::std::mem::align_of::<_cef_draggable_region_t>() - 4usize];
    ["Offset of field: _cef_draggable_region_t::bounds"]
        [::std::mem::offset_of!(_cef_draggable_region_t, bounds) - 0usize];
    ["Offset of field: _cef_draggable_region_t::draggable"]
        [::std::mem::offset_of!(_cef_draggable_region_t, draggable) - 16usize];
};
pub type cef_draggable_region_t = _cef_draggable_region_t;
pub mod cef_process_id_t {
    pub type Type = ::std::os::raw::c_int;
    pub const PID_BROWSER: Type = 0;
    pub const PID_RENDERER: Type = 1;
}
pub mod cef_thread_id_t {
    pub type Type = ::std::os::raw::c_int;
    pub const TID_UI: Type = 0;
    pub const TID_FILE_BACKGROUND: Type = 1;
    pub const TID_FILE_USER_VISIBLE: Type = 2;
    pub const TID_FILE_USER_BLOCKING: Type = 3;
    pub const TID_PROCESS_LAUNCHER: Type = 4;
    pub const TID_IO: Type = 5;
    pub const TID_RENDERER: Type = 6;
    pub const TID_NUM_VALUES: Type = 7;
}
pub mod cef_thread_priority_t {
    pub type Type = ::std::os::raw::c_int;
    pub const TP_BACKGROUND: Type = 0;
    pub const TP_NORMAL: Type = 1;
    pub const TP_DISPLAY: Type = 2;
    pub const TP_REALTIME_AUDIO: Type = 3;
    pub const TP_NUM_VALUES: Type = 4;
}
pub mod cef_message_loop_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const ML_TYPE_DEFAULT: Type = 0;
    pub const ML_TYPE_UI: Type = 1;
    pub const ML_TYPE_IO: Type = 2;
    pub const ML_NUM_VALUES: Type = 3;
}
pub mod cef_com_init_mode_t {
    pub type Type = ::std::os::raw::c_int;
    pub const COM_INIT_MODE_NONE: Type = 0;
    pub const COM_INIT_MODE_STA: Type = 1;
    pub const COM_INIT_MODE_MTA: Type = 2;
}
pub mod cef_value_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const VTYPE_INVALID: Type = 0;
    pub const VTYPE_NULL: Type = 1;
    pub const VTYPE_BOOL: Type = 2;
    pub const VTYPE_INT: Type = 3;
    pub const VTYPE_DOUBLE: Type = 4;
    pub const VTYPE_STRING: Type = 5;
    pub const VTYPE_BINARY: Type = 6;
    pub const VTYPE_DICTIONARY: Type = 7;
    pub const VTYPE_LIST: Type = 8;
    pub const VTYPE_NUM_VALUES: Type = 9;
}
pub mod cef_jsdialog_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const JSDIALOGTYPE_ALERT: Type = 0;
    pub const JSDIALOGTYPE_CONFIRM: Type = 1;
    pub const JSDIALOGTYPE_PROMPT: Type = 2;
    pub const JSDIALOGTYPE_NUM_VALUES: Type = 3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_screen_info_t {
    pub size: usize,
    pub device_scale_factor: f32,
    pub depth: ::std::os::raw::c_int,
    pub depth_per_component: ::std::os::raw::c_int,
    pub is_monochrome: ::std::os::raw::c_int,
    pub rect: cef_rect_t,
    pub available_rect: cef_rect_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_screen_info_t"][::std::mem::size_of::<_cef_screen_info_t>() - 52usize];
    ["Alignment of _cef_screen_info_t"][::std::mem::align_of::<_cef_screen_info_t>() - 4usize];
    ["Offset of field: _cef_screen_info_t::size"]
        [::std::mem::offset_of!(_cef_screen_info_t, size) - 0usize];
    ["Offset of field: _cef_screen_info_t::device_scale_factor"]
        [::std::mem::offset_of!(_cef_screen_info_t, device_scale_factor) - 4usize];
    ["Offset of field: _cef_screen_info_t::depth"]
        [::std::mem::offset_of!(_cef_screen_info_t, depth) - 8usize];
    ["Offset of field: _cef_screen_info_t::depth_per_component"]
        [::std::mem::offset_of!(_cef_screen_info_t, depth_per_component) - 12usize];
    ["Offset of field: _cef_screen_info_t::is_monochrome"]
        [::std::mem::offset_of!(_cef_screen_info_t, is_monochrome) - 16usize];
    ["Offset of field: _cef_screen_info_t::rect"]
        [::std::mem::offset_of!(_cef_screen_info_t, rect) - 20usize];
    ["Offset of field: _cef_screen_info_t::available_rect"]
        [::std::mem::offset_of!(_cef_screen_info_t, available_rect) - 36usize];
};
pub type cef_screen_info_t = _cef_screen_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_linux_window_properties_t {
    pub size: usize,
    pub wayland_app_id: cef_string_t,
    pub wm_class_class: cef_string_t,
    pub wm_class_name: cef_string_t,
    pub wm_role_name: cef_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_linux_window_properties_t"]
        [::std::mem::size_of::<_cef_linux_window_properties_t>() - 52usize];
    ["Alignment of _cef_linux_window_properties_t"]
        [::std::mem::align_of::<_cef_linux_window_properties_t>() - 4usize];
    ["Offset of field: _cef_linux_window_properties_t::size"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, size) - 0usize];
    ["Offset of field: _cef_linux_window_properties_t::wayland_app_id"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wayland_app_id) - 4usize];
    ["Offset of field: _cef_linux_window_properties_t::wm_class_class"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wm_class_class) - 16usize];
    ["Offset of field: _cef_linux_window_properties_t::wm_class_name"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wm_class_name) - 28usize];
    ["Offset of field: _cef_linux_window_properties_t::wm_role_name"]
        [::std::mem::offset_of!(_cef_linux_window_properties_t, wm_role_name) - 40usize];
};
pub type cef_linux_window_properties_t = _cef_linux_window_properties_t;
pub mod cef_menu_id_t {
    pub type Type = ::std::os::raw::c_int;
    pub const MENU_ID_BACK: Type = 100;
    pub const MENU_ID_FORWARD: Type = 101;
    pub const MENU_ID_RELOAD: Type = 102;
    pub const MENU_ID_RELOAD_NOCACHE: Type = 103;
    pub const MENU_ID_STOPLOAD: Type = 104;
    pub const MENU_ID_UNDO: Type = 110;
    pub const MENU_ID_REDO: Type = 111;
    pub const MENU_ID_CUT: Type = 112;
    pub const MENU_ID_COPY: Type = 113;
    pub const MENU_ID_PASTE: Type = 114;
    pub const MENU_ID_PASTE_MATCH_STYLE: Type = 115;
    pub const MENU_ID_DELETE: Type = 116;
    pub const MENU_ID_SELECT_ALL: Type = 117;
    pub const MENU_ID_FIND: Type = 130;
    pub const MENU_ID_PRINT: Type = 131;
    pub const MENU_ID_VIEW_SOURCE: Type = 132;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_0: Type = 200;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_1: Type = 201;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_2: Type = 202;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_3: Type = 203;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_4: Type = 204;
    pub const MENU_ID_SPELLCHECK_SUGGESTION_LAST: Type = 204;
    pub const MENU_ID_NO_SPELLING_SUGGESTIONS: Type = 205;
    pub const MENU_ID_ADD_TO_DICTIONARY: Type = 206;
    pub const MENU_ID_CUSTOM_FIRST: Type = 220;
    pub const MENU_ID_CUSTOM_LAST: Type = 250;
    pub const MENU_ID_USER_FIRST: Type = 26500;
    pub const MENU_ID_USER_LAST: Type = 28500;
}
pub mod cef_mouse_button_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const MBT_LEFT: Type = 0;
    pub const MBT_MIDDLE: Type = 1;
    pub const MBT_RIGHT: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_mouse_event_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub modifiers: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_mouse_event_t"][::std::mem::size_of::<_cef_mouse_event_t>() - 12usize];
    ["Alignment of _cef_mouse_event_t"][::std::mem::align_of::<_cef_mouse_event_t>() - 4usize];
    ["Offset of field: _cef_mouse_event_t::x"]
        [::std::mem::offset_of!(_cef_mouse_event_t, x) - 0usize];
    ["Offset of field: _cef_mouse_event_t::y"]
        [::std::mem::offset_of!(_cef_mouse_event_t, y) - 4usize];
    ["Offset of field: _cef_mouse_event_t::modifiers"]
        [::std::mem::offset_of!(_cef_mouse_event_t, modifiers) - 8usize];
};
pub type cef_mouse_event_t = _cef_mouse_event_t;
pub mod cef_touch_event_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TET_RELEASED: Type = 0;
    pub const CEF_TET_PRESSED: Type = 1;
    pub const CEF_TET_MOVED: Type = 2;
    pub const CEF_TET_CANCELLED: Type = 3;
}
pub mod cef_pointer_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_POINTER_TYPE_TOUCH: Type = 0;
    pub const CEF_POINTER_TYPE_MOUSE: Type = 1;
    pub const CEF_POINTER_TYPE_PEN: Type = 2;
    pub const CEF_POINTER_TYPE_ERASER: Type = 3;
    pub const CEF_POINTER_TYPE_UNKNOWN: Type = 4;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_touch_event_t {
    pub id: ::std::os::raw::c_int,
    pub x: f32,
    pub y: f32,
    pub radius_x: f32,
    pub radius_y: f32,
    pub rotation_angle: f32,
    pub pressure: f32,
    pub type_: cef_touch_event_type_t::Type,
    pub modifiers: u32,
    pub pointer_type: cef_pointer_type_t::Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_touch_event_t"][::std::mem::size_of::<_cef_touch_event_t>() - 40usize];
    ["Alignment of _cef_touch_event_t"][::std::mem::align_of::<_cef_touch_event_t>() - 4usize];
    ["Offset of field: _cef_touch_event_t::id"]
        [::std::mem::offset_of!(_cef_touch_event_t, id) - 0usize];
    ["Offset of field: _cef_touch_event_t::x"]
        [::std::mem::offset_of!(_cef_touch_event_t, x) - 4usize];
    ["Offset of field: _cef_touch_event_t::y"]
        [::std::mem::offset_of!(_cef_touch_event_t, y) - 8usize];
    ["Offset of field: _cef_touch_event_t::radius_x"]
        [::std::mem::offset_of!(_cef_touch_event_t, radius_x) - 12usize];
    ["Offset of field: _cef_touch_event_t::radius_y"]
        [::std::mem::offset_of!(_cef_touch_event_t, radius_y) - 16usize];
    ["Offset of field: _cef_touch_event_t::rotation_angle"]
        [::std::mem::offset_of!(_cef_touch_event_t, rotation_angle) - 20usize];
    ["Offset of field: _cef_touch_event_t::pressure"]
        [::std::mem::offset_of!(_cef_touch_event_t, pressure) - 24usize];
    ["Offset of field: _cef_touch_event_t::type_"]
        [::std::mem::offset_of!(_cef_touch_event_t, type_) - 28usize];
    ["Offset of field: _cef_touch_event_t::modifiers"]
        [::std::mem::offset_of!(_cef_touch_event_t, modifiers) - 32usize];
    ["Offset of field: _cef_touch_event_t::pointer_type"]
        [::std::mem::offset_of!(_cef_touch_event_t, pointer_type) - 36usize];
};
pub type cef_touch_event_t = _cef_touch_event_t;
pub mod cef_paint_element_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const PET_VIEW: Type = 0;
    pub const PET_POPUP: Type = 1;
}
pub mod cef_event_flags_t {
    pub type Type = ::std::os::raw::c_int;
    pub const EVENTFLAG_NONE: Type = 0;
    pub const EVENTFLAG_CAPS_LOCK_ON: Type = 1;
    pub const EVENTFLAG_SHIFT_DOWN: Type = 2;
    pub const EVENTFLAG_CONTROL_DOWN: Type = 4;
    pub const EVENTFLAG_ALT_DOWN: Type = 8;
    pub const EVENTFLAG_LEFT_MOUSE_BUTTON: Type = 16;
    pub const EVENTFLAG_MIDDLE_MOUSE_BUTTON: Type = 32;
    pub const EVENTFLAG_RIGHT_MOUSE_BUTTON: Type = 64;
    pub const EVENTFLAG_COMMAND_DOWN: Type = 128;
    pub const EVENTFLAG_NUM_LOCK_ON: Type = 256;
    pub const EVENTFLAG_IS_KEY_PAD: Type = 512;
    pub const EVENTFLAG_IS_LEFT: Type = 1024;
    pub const EVENTFLAG_IS_RIGHT: Type = 2048;
    pub const EVENTFLAG_ALTGR_DOWN: Type = 4096;
    pub const EVENTFLAG_IS_REPEAT: Type = 8192;
    pub const EVENTFLAG_PRECISION_SCROLLING_DELTA: Type = 16384;
    pub const EVENTFLAG_SCROLL_BY_PAGE: Type = 32768;
}
pub mod cef_menu_item_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const MENUITEMTYPE_NONE: Type = 0;
    pub const MENUITEMTYPE_COMMAND: Type = 1;
    pub const MENUITEMTYPE_CHECK: Type = 2;
    pub const MENUITEMTYPE_RADIO: Type = 3;
    pub const MENUITEMTYPE_SEPARATOR: Type = 4;
    pub const MENUITEMTYPE_SUBMENU: Type = 5;
}
pub mod cef_context_menu_type_flags_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CM_TYPEFLAG_NONE: Type = 0;
    pub const CM_TYPEFLAG_PAGE: Type = 1;
    pub const CM_TYPEFLAG_FRAME: Type = 2;
    pub const CM_TYPEFLAG_LINK: Type = 4;
    pub const CM_TYPEFLAG_MEDIA: Type = 8;
    pub const CM_TYPEFLAG_SELECTION: Type = 16;
    pub const CM_TYPEFLAG_EDITABLE: Type = 32;
}
pub mod cef_context_menu_media_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CM_MEDIATYPE_NONE: Type = 0;
    pub const CM_MEDIATYPE_IMAGE: Type = 1;
    pub const CM_MEDIATYPE_VIDEO: Type = 2;
    pub const CM_MEDIATYPE_AUDIO: Type = 3;
    pub const CM_MEDIATYPE_CANVAS: Type = 4;
    pub const CM_MEDIATYPE_FILE: Type = 5;
    pub const CM_MEDIATYPE_PLUGIN: Type = 6;
    pub const CM_MEDIATYPE_NUM_VALUES: Type = 7;
}
pub mod cef_context_menu_media_state_flags_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CM_MEDIAFLAG_NONE: Type = 0;
    pub const CM_MEDIAFLAG_IN_ERROR: Type = 1;
    pub const CM_MEDIAFLAG_PAUSED: Type = 2;
    pub const CM_MEDIAFLAG_MUTED: Type = 4;
    pub const CM_MEDIAFLAG_LOOP: Type = 8;
    pub const CM_MEDIAFLAG_CAN_SAVE: Type = 16;
    pub const CM_MEDIAFLAG_HAS_AUDIO: Type = 32;
    pub const CM_MEDIAFLAG_CAN_TOGGLE_CONTROLS: Type = 64;
    pub const CM_MEDIAFLAG_CONTROLS: Type = 128;
    pub const CM_MEDIAFLAG_CAN_PRINT: Type = 256;
    pub const CM_MEDIAFLAG_CAN_ROTATE: Type = 512;
    pub const CM_MEDIAFLAG_CAN_PICTURE_IN_PICTURE: Type = 1024;
    pub const CM_MEDIAFLAG_PICTURE_IN_PICTURE: Type = 2048;
    pub const CM_MEDIAFLAG_CAN_LOOP: Type = 4096;
}
pub mod cef_context_menu_edit_state_flags_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CM_EDITFLAG_NONE: Type = 0;
    pub const CM_EDITFLAG_CAN_UNDO: Type = 1;
    pub const CM_EDITFLAG_CAN_REDO: Type = 2;
    pub const CM_EDITFLAG_CAN_CUT: Type = 4;
    pub const CM_EDITFLAG_CAN_COPY: Type = 8;
    pub const CM_EDITFLAG_CAN_PASTE: Type = 16;
    pub const CM_EDITFLAG_CAN_DELETE: Type = 32;
    pub const CM_EDITFLAG_CAN_SELECT_ALL: Type = 64;
    pub const CM_EDITFLAG_CAN_TRANSLATE: Type = 128;
    pub const CM_EDITFLAG_CAN_EDIT_RICHLY: Type = 256;
}
pub mod cef_quick_menu_edit_state_flags_t {
    pub type Type = ::std::os::raw::c_int;
    pub const QM_EDITFLAG_NONE: Type = 0;
    pub const QM_EDITFLAG_CAN_ELLIPSIS: Type = 1;
    pub const QM_EDITFLAG_CAN_CUT: Type = 2;
    pub const QM_EDITFLAG_CAN_COPY: Type = 4;
    pub const QM_EDITFLAG_CAN_PASTE: Type = 8;
}
pub mod cef_key_event_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const KEYEVENT_RAWKEYDOWN: Type = 0;
    pub const KEYEVENT_KEYDOWN: Type = 1;
    pub const KEYEVENT_KEYUP: Type = 2;
    pub const KEYEVENT_CHAR: Type = 3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_key_event_t {
    pub size: usize,
    pub type_: cef_key_event_type_t::Type,
    pub modifiers: u32,
    pub windows_key_code: ::std::os::raw::c_int,
    pub native_key_code: ::std::os::raw::c_int,
    pub is_system_key: ::std::os::raw::c_int,
    pub character: char16_t,
    pub unmodified_character: char16_t,
    pub focus_on_editable_field: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_key_event_t"][::std::mem::size_of::<_cef_key_event_t>() - 32usize];
    ["Alignment of _cef_key_event_t"][::std::mem::align_of::<_cef_key_event_t>() - 4usize];
    ["Offset of field: _cef_key_event_t::size"]
        [::std::mem::offset_of!(_cef_key_event_t, size) - 0usize];
    ["Offset of field: _cef_key_event_t::type_"]
        [::std::mem::offset_of!(_cef_key_event_t, type_) - 4usize];
    ["Offset of field: _cef_key_event_t::modifiers"]
        [::std::mem::offset_of!(_cef_key_event_t, modifiers) - 8usize];
    ["Offset of field: _cef_key_event_t::windows_key_code"]
        [::std::mem::offset_of!(_cef_key_event_t, windows_key_code) - 12usize];
    ["Offset of field: _cef_key_event_t::native_key_code"]
        [::std::mem::offset_of!(_cef_key_event_t, native_key_code) - 16usize];
    ["Offset of field: _cef_key_event_t::is_system_key"]
        [::std::mem::offset_of!(_cef_key_event_t, is_system_key) - 20usize];
    ["Offset of field: _cef_key_event_t::character"]
        [::std::mem::offset_of!(_cef_key_event_t, character) - 24usize];
    ["Offset of field: _cef_key_event_t::unmodified_character"]
        [::std::mem::offset_of!(_cef_key_event_t, unmodified_character) - 26usize];
    ["Offset of field: _cef_key_event_t::focus_on_editable_field"]
        [::std::mem::offset_of!(_cef_key_event_t, focus_on_editable_field) - 28usize];
};
pub type cef_key_event_t = _cef_key_event_t;
pub mod cef_focus_source_t {
    pub type Type = ::std::os::raw::c_int;
    pub const FOCUS_SOURCE_NAVIGATION: Type = 0;
    pub const FOCUS_SOURCE_SYSTEM: Type = 1;
    pub const FOCUS_SOURCE_NUM_VALUES: Type = 2;
}
pub mod cef_navigation_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const NAVIGATION_LINK_CLICKED: Type = 0;
    pub const NAVIGATION_FORM_SUBMITTED: Type = 1;
    pub const NAVIGATION_BACK_FORWARD: Type = 2;
    pub const NAVIGATION_RELOAD: Type = 3;
    pub const NAVIGATION_FORM_RESUBMITTED: Type = 4;
    pub const NAVIGATION_OTHER: Type = 5;
    pub const NAVIGATION_NUM_VALUES: Type = 6;
}
pub mod cef_xml_encoding_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const XML_ENCODING_NONE: Type = 0;
    pub const XML_ENCODING_UTF8: Type = 1;
    pub const XML_ENCODING_UTF16LE: Type = 2;
    pub const XML_ENCODING_UTF16BE: Type = 3;
    pub const XML_ENCODING_ASCII: Type = 4;
    pub const XML_ENCODING_NUM_VALUES: Type = 5;
}
pub mod cef_xml_node_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const XML_NODE_UNSUPPORTED: Type = 0;
    pub const XML_NODE_PROCESSING_INSTRUCTION: Type = 1;
    pub const XML_NODE_DOCUMENT_TYPE: Type = 2;
    pub const XML_NODE_ELEMENT_START: Type = 3;
    pub const XML_NODE_ELEMENT_END: Type = 4;
    pub const XML_NODE_ATTRIBUTE: Type = 5;
    pub const XML_NODE_TEXT: Type = 6;
    pub const XML_NODE_CDATA: Type = 7;
    pub const XML_NODE_ENTITY_REFERENCE: Type = 8;
    pub const XML_NODE_WHITESPACE: Type = 9;
    pub const XML_NODE_COMMENT: Type = 10;
    pub const XML_NODE_NUM_VALUES: Type = 11;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_popup_features_t {
    pub size: usize,
    pub x: ::std::os::raw::c_int,
    pub xSet: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub ySet: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub widthSet: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub heightSet: ::std::os::raw::c_int,
    pub isPopup: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_popup_features_t"][::std::mem::size_of::<_cef_popup_features_t>() - 40usize];
    ["Alignment of _cef_popup_features_t"]
        [::std::mem::align_of::<_cef_popup_features_t>() - 4usize];
    ["Offset of field: _cef_popup_features_t::size"]
        [::std::mem::offset_of!(_cef_popup_features_t, size) - 0usize];
    ["Offset of field: _cef_popup_features_t::x"]
        [::std::mem::offset_of!(_cef_popup_features_t, x) - 4usize];
    ["Offset of field: _cef_popup_features_t::xSet"]
        [::std::mem::offset_of!(_cef_popup_features_t, xSet) - 8usize];
    ["Offset of field: _cef_popup_features_t::y"]
        [::std::mem::offset_of!(_cef_popup_features_t, y) - 12usize];
    ["Offset of field: _cef_popup_features_t::ySet"]
        [::std::mem::offset_of!(_cef_popup_features_t, ySet) - 16usize];
    ["Offset of field: _cef_popup_features_t::width"]
        [::std::mem::offset_of!(_cef_popup_features_t, width) - 20usize];
    ["Offset of field: _cef_popup_features_t::widthSet"]
        [::std::mem::offset_of!(_cef_popup_features_t, widthSet) - 24usize];
    ["Offset of field: _cef_popup_features_t::height"]
        [::std::mem::offset_of!(_cef_popup_features_t, height) - 28usize];
    ["Offset of field: _cef_popup_features_t::heightSet"]
        [::std::mem::offset_of!(_cef_popup_features_t, heightSet) - 32usize];
    ["Offset of field: _cef_popup_features_t::isPopup"]
        [::std::mem::offset_of!(_cef_popup_features_t, isPopup) - 36usize];
};
pub type cef_popup_features_t = _cef_popup_features_t;
pub mod cef_dom_document_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_DOCUMENT_TYPE_UNKNOWN: Type = 0;
    pub const DOM_DOCUMENT_TYPE_HTML: Type = 1;
    pub const DOM_DOCUMENT_TYPE_XHTML: Type = 2;
    pub const DOM_DOCUMENT_TYPE_PLUGIN: Type = 3;
    pub const DOM_DOCUMENT_TYPE_NUM_VALUES: Type = 4;
}
pub mod cef_dom_event_category_t {
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_EVENT_CATEGORY_UNKNOWN: Type = 0;
    pub const DOM_EVENT_CATEGORY_UI: Type = 1;
    pub const DOM_EVENT_CATEGORY_MOUSE: Type = 2;
    pub const DOM_EVENT_CATEGORY_MUTATION: Type = 4;
    pub const DOM_EVENT_CATEGORY_KEYBOARD: Type = 8;
    pub const DOM_EVENT_CATEGORY_TEXT: Type = 16;
    pub const DOM_EVENT_CATEGORY_COMPOSITION: Type = 32;
    pub const DOM_EVENT_CATEGORY_DRAG: Type = 64;
    pub const DOM_EVENT_CATEGORY_CLIPBOARD: Type = 128;
    pub const DOM_EVENT_CATEGORY_MESSAGE: Type = 256;
    pub const DOM_EVENT_CATEGORY_WHEEL: Type = 512;
    pub const DOM_EVENT_CATEGORY_BEFORE_TEXT_INSERTED: Type = 1024;
    pub const DOM_EVENT_CATEGORY_OVERFLOW: Type = 2048;
    pub const DOM_EVENT_CATEGORY_PAGE_TRANSITION: Type = 4096;
    pub const DOM_EVENT_CATEGORY_POPSTATE: Type = 8192;
    pub const DOM_EVENT_CATEGORY_PROGRESS: Type = 16384;
    pub const DOM_EVENT_CATEGORY_XMLHTTPREQUEST_PROGRESS: Type = 32768;
}
pub mod cef_dom_event_phase_t {
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_EVENT_PHASE_UNKNOWN: Type = 0;
    pub const DOM_EVENT_PHASE_CAPTURING: Type = 1;
    pub const DOM_EVENT_PHASE_AT_TARGET: Type = 2;
    pub const DOM_EVENT_PHASE_BUBBLING: Type = 3;
    pub const DOM_EVENT_PHASE_NUM_VALUES: Type = 4;
}
pub mod cef_dom_node_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_NODE_TYPE_UNSUPPORTED: Type = 0;
    pub const DOM_NODE_TYPE_ELEMENT: Type = 1;
    pub const DOM_NODE_TYPE_ATTRIBUTE: Type = 2;
    pub const DOM_NODE_TYPE_TEXT: Type = 3;
    pub const DOM_NODE_TYPE_CDATA_SECTION: Type = 4;
    pub const DOM_NODE_TYPE_PROCESSING_INSTRUCTIONS: Type = 5;
    pub const DOM_NODE_TYPE_COMMENT: Type = 6;
    pub const DOM_NODE_TYPE_DOCUMENT: Type = 7;
    pub const DOM_NODE_TYPE_DOCUMENT_TYPE: Type = 8;
    pub const DOM_NODE_TYPE_DOCUMENT_FRAGMENT: Type = 9;
    pub const DOM_NODE_TYPE_NUM_VALUES: Type = 10;
}
pub mod cef_dom_form_control_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const DOM_FORM_CONTROL_TYPE_UNSUPPORTED: Type = 0;
    pub const DOM_FORM_CONTROL_TYPE_BUTTON_BUTTON: Type = 1;
    pub const DOM_FORM_CONTROL_TYPE_BUTTON_SUBMIT: Type = 2;
    pub const DOM_FORM_CONTROL_TYPE_BUTTON_RESET: Type = 3;
    pub const DOM_FORM_CONTROL_TYPE_BUTTON_POPOVER: Type = 4;
    pub const DOM_FORM_CONTROL_TYPE_FIELDSET: Type = 5;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_BUTTON: Type = 6;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_CHECKBOX: Type = 7;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_COLOR: Type = 8;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_DATE: Type = 9;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_DATETIME_LOCAL: Type = 10;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_EMAIL: Type = 11;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_FILE: Type = 12;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_HIDDEN: Type = 13;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_IMAGE: Type = 14;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_MONTH: Type = 15;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_NUMBER: Type = 16;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_PASSWORD: Type = 17;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_RADIO: Type = 18;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_RANGE: Type = 19;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_RESET: Type = 20;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_SEARCH: Type = 21;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_SUBMIT: Type = 22;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_TELEPHONE: Type = 23;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_TEXT: Type = 24;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_TIME: Type = 25;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_URL: Type = 26;
    pub const DOM_FORM_CONTROL_TYPE_INPUT_WEEK: Type = 27;
    pub const DOM_FORM_CONTROL_TYPE_OUTPUT: Type = 28;
    pub const DOM_FORM_CONTROL_TYPE_SELECT_ONE: Type = 29;
    pub const DOM_FORM_CONTROL_TYPE_SELECT_MULTIPLE: Type = 30;
    pub const DOM_FORM_CONTROL_TYPE_TEXT_AREA: Type = 31;
    pub const DOM_FORM_CONTROL_TYPE_NUM_VALUES: Type = 32;
}
pub mod cef_file_dialog_mode_t {
    pub type Type = ::std::os::raw::c_int;
    pub const FILE_DIALOG_OPEN: Type = 0;
    pub const FILE_DIALOG_OPEN_MULTIPLE: Type = 1;
    pub const FILE_DIALOG_OPEN_FOLDER: Type = 2;
    pub const FILE_DIALOG_SAVE: Type = 3;
    pub const FILE_DIALOG_NUM_VALUES: Type = 4;
}
pub mod cef_color_model_t {
    pub type Type = ::std::os::raw::c_int;
    pub const COLOR_MODEL_UNKNOWN: Type = 0;
    pub const COLOR_MODEL_GRAY: Type = 1;
    pub const COLOR_MODEL_COLOR: Type = 2;
    pub const COLOR_MODEL_CMYK: Type = 3;
    pub const COLOR_MODEL_CMY: Type = 4;
    pub const COLOR_MODEL_KCMY: Type = 5;
    pub const COLOR_MODEL_CMY_K: Type = 6;
    pub const COLOR_MODEL_BLACK: Type = 7;
    pub const COLOR_MODEL_GRAYSCALE: Type = 8;
    pub const COLOR_MODEL_RGB: Type = 9;
    pub const COLOR_MODEL_RGB16: Type = 10;
    pub const COLOR_MODEL_RGBA: Type = 11;
    pub const COLOR_MODEL_COLORMODE_COLOR: Type = 12;
    pub const COLOR_MODEL_COLORMODE_MONOCHROME: Type = 13;
    pub const COLOR_MODEL_HP_COLOR_COLOR: Type = 14;
    pub const COLOR_MODEL_HP_COLOR_BLACK: Type = 15;
    pub const COLOR_MODEL_PRINTOUTMODE_NORMAL: Type = 16;
    pub const COLOR_MODEL_PRINTOUTMODE_NORMAL_GRAY: Type = 17;
    pub const COLOR_MODEL_PROCESSCOLORMODEL_CMYK: Type = 18;
    pub const COLOR_MODEL_PROCESSCOLORMODEL_GREYSCALE: Type = 19;
    pub const COLOR_MODEL_PROCESSCOLORMODEL_RGB: Type = 20;
    pub const COLOR_MODEL_NUM_VALUES: Type = 21;
}
pub mod cef_duplex_mode_t {
    pub type Type = ::std::os::raw::c_int;
    pub const DUPLEX_MODE_UNKNOWN: Type = -1;
    pub const DUPLEX_MODE_SIMPLEX: Type = 0;
    pub const DUPLEX_MODE_LONG_EDGE: Type = 1;
    pub const DUPLEX_MODE_SHORT_EDGE: Type = 2;
    pub const DUPLEX_MODE_NUM_VALUES: Type = 3;
}
pub mod cef_cursor_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CT_POINTER: Type = 0;
    pub const CT_CROSS: Type = 1;
    pub const CT_HAND: Type = 2;
    pub const CT_IBEAM: Type = 3;
    pub const CT_WAIT: Type = 4;
    pub const CT_HELP: Type = 5;
    pub const CT_EASTRESIZE: Type = 6;
    pub const CT_NORTHRESIZE: Type = 7;
    pub const CT_NORTHEASTRESIZE: Type = 8;
    pub const CT_NORTHWESTRESIZE: Type = 9;
    pub const CT_SOUTHRESIZE: Type = 10;
    pub const CT_SOUTHEASTRESIZE: Type = 11;
    pub const CT_SOUTHWESTRESIZE: Type = 12;
    pub const CT_WESTRESIZE: Type = 13;
    pub const CT_NORTHSOUTHRESIZE: Type = 14;
    pub const CT_EASTWESTRESIZE: Type = 15;
    pub const CT_NORTHEASTSOUTHWESTRESIZE: Type = 16;
    pub const CT_NORTHWESTSOUTHEASTRESIZE: Type = 17;
    pub const CT_COLUMNRESIZE: Type = 18;
    pub const CT_ROWRESIZE: Type = 19;
    pub const CT_MIDDLEPANNING: Type = 20;
    pub const CT_EASTPANNING: Type = 21;
    pub const CT_NORTHPANNING: Type = 22;
    pub const CT_NORTHEASTPANNING: Type = 23;
    pub const CT_NORTHWESTPANNING: Type = 24;
    pub const CT_SOUTHPANNING: Type = 25;
    pub const CT_SOUTHEASTPANNING: Type = 26;
    pub const CT_SOUTHWESTPANNING: Type = 27;
    pub const CT_WESTPANNING: Type = 28;
    pub const CT_MOVE: Type = 29;
    pub const CT_VERTICALTEXT: Type = 30;
    pub const CT_CELL: Type = 31;
    pub const CT_CONTEXTMENU: Type = 32;
    pub const CT_ALIAS: Type = 33;
    pub const CT_PROGRESS: Type = 34;
    pub const CT_NODROP: Type = 35;
    pub const CT_COPY: Type = 36;
    pub const CT_NONE: Type = 37;
    pub const CT_NOTALLOWED: Type = 38;
    pub const CT_ZOOMIN: Type = 39;
    pub const CT_ZOOMOUT: Type = 40;
    pub const CT_GRAB: Type = 41;
    pub const CT_GRABBING: Type = 42;
    pub const CT_MIDDLE_PANNING_VERTICAL: Type = 43;
    pub const CT_MIDDLE_PANNING_HORIZONTAL: Type = 44;
    pub const CT_CUSTOM: Type = 45;
    pub const CT_DND_NONE: Type = 46;
    pub const CT_DND_MOVE: Type = 47;
    pub const CT_DND_COPY: Type = 48;
    pub const CT_DND_LINK: Type = 49;
    pub const CT_NUM_VALUES: Type = 50;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cursor_info_t {
    pub hotspot: cef_point_t,
    pub image_scale_factor: f32,
    pub buffer: *mut ::std::os::raw::c_void,
    pub size: cef_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_cursor_info_t"][::std::mem::size_of::<_cef_cursor_info_t>() - 24usize];
    ["Alignment of _cef_cursor_info_t"][::std::mem::align_of::<_cef_cursor_info_t>() - 4usize];
    ["Offset of field: _cef_cursor_info_t::hotspot"]
        [::std::mem::offset_of!(_cef_cursor_info_t, hotspot) - 0usize];
    ["Offset of field: _cef_cursor_info_t::image_scale_factor"]
        [::std::mem::offset_of!(_cef_cursor_info_t, image_scale_factor) - 8usize];
    ["Offset of field: _cef_cursor_info_t::buffer"]
        [::std::mem::offset_of!(_cef_cursor_info_t, buffer) - 12usize];
    ["Offset of field: _cef_cursor_info_t::size"]
        [::std::mem::offset_of!(_cef_cursor_info_t, size) - 16usize];
};
pub type cef_cursor_info_t = _cef_cursor_info_t;
pub mod cef_uri_unescape_rule_t {
    pub type Type = ::std::os::raw::c_int;
    pub const UU_NONE: Type = 0;
    pub const UU_NORMAL: Type = 1;
    pub const UU_SPACES: Type = 2;
    pub const UU_PATH_SEPARATORS: Type = 4;
    pub const UU_URL_SPECIAL_CHARS_EXCEPT_PATH_SEPARATORS: Type = 8;
    pub const UU_REPLACE_PLUS_WITH_SPACE: Type = 16;
}
pub mod cef_json_parser_options_t {
    pub type Type = ::std::os::raw::c_int;
    pub const JSON_PARSER_RFC: Type = 0;
    pub const JSON_PARSER_ALLOW_TRAILING_COMMAS: Type = 1;
}
pub mod cef_json_writer_options_t {
    pub type Type = ::std::os::raw::c_int;
    pub const JSON_WRITER_DEFAULT: Type = 0;
    pub const JSON_WRITER_OMIT_BINARY_VALUES: Type = 1;
    pub const JSON_WRITER_OMIT_DOUBLE_TYPE_PRESERVATION: Type = 2;
    pub const JSON_WRITER_PRETTY_PRINT: Type = 4;
}
pub mod cef_pdf_print_margin_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const PDF_PRINT_MARGIN_DEFAULT: Type = 0;
    pub const PDF_PRINT_MARGIN_NONE: Type = 1;
    pub const PDF_PRINT_MARGIN_CUSTOM: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_pdf_print_settings_t {
    pub size: usize,
    pub landscape: ::std::os::raw::c_int,
    pub print_background: ::std::os::raw::c_int,
    pub scale: f64,
    pub paper_width: f64,
    pub paper_height: f64,
    pub prefer_css_page_size: ::std::os::raw::c_int,
    pub margin_type: cef_pdf_print_margin_type_t::Type,
    pub margin_top: f64,
    pub margin_right: f64,
    pub margin_bottom: f64,
    pub margin_left: f64,
    pub page_ranges: cef_string_t,
    pub display_header_footer: ::std::os::raw::c_int,
    pub header_template: cef_string_t,
    pub footer_template: cef_string_t,
    pub generate_tagged_pdf: ::std::os::raw::c_int,
    pub generate_document_outline: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_pdf_print_settings_t"]
        [::std::mem::size_of::<_cef_pdf_print_settings_t>() - 128usize];
    ["Alignment of _cef_pdf_print_settings_t"]
        [::std::mem::align_of::<_cef_pdf_print_settings_t>() - 8usize];
    ["Offset of field: _cef_pdf_print_settings_t::size"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, size) - 0usize];
    ["Offset of field: _cef_pdf_print_settings_t::landscape"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, landscape) - 4usize];
    ["Offset of field: _cef_pdf_print_settings_t::print_background"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, print_background) - 8usize];
    ["Offset of field: _cef_pdf_print_settings_t::scale"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, scale) - 16usize];
    ["Offset of field: _cef_pdf_print_settings_t::paper_width"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, paper_width) - 24usize];
    ["Offset of field: _cef_pdf_print_settings_t::paper_height"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, paper_height) - 32usize];
    ["Offset of field: _cef_pdf_print_settings_t::prefer_css_page_size"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, prefer_css_page_size) - 40usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_type"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_type) - 44usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_top"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_top) - 48usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_right"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_right) - 56usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_bottom"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_bottom) - 64usize];
    ["Offset of field: _cef_pdf_print_settings_t::margin_left"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, margin_left) - 72usize];
    ["Offset of field: _cef_pdf_print_settings_t::page_ranges"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, page_ranges) - 80usize];
    ["Offset of field: _cef_pdf_print_settings_t::display_header_footer"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, display_header_footer) - 92usize];
    ["Offset of field: _cef_pdf_print_settings_t::header_template"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, header_template) - 96usize];
    ["Offset of field: _cef_pdf_print_settings_t::footer_template"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, footer_template) - 108usize];
    ["Offset of field: _cef_pdf_print_settings_t::generate_tagged_pdf"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, generate_tagged_pdf) - 120usize];
    ["Offset of field: _cef_pdf_print_settings_t::generate_document_outline"]
        [::std::mem::offset_of!(_cef_pdf_print_settings_t, generate_document_outline) - 124usize];
};
pub type cef_pdf_print_settings_t = _cef_pdf_print_settings_t;
pub mod cef_scale_factor_t {
    pub type Type = ::std::os::raw::c_int;
    pub const SCALE_FACTOR_NONE: Type = 0;
    pub const SCALE_FACTOR_100P: Type = 1;
    pub const SCALE_FACTOR_125P: Type = 2;
    pub const SCALE_FACTOR_133P: Type = 3;
    pub const SCALE_FACTOR_140P: Type = 4;
    pub const SCALE_FACTOR_150P: Type = 5;
    pub const SCALE_FACTOR_180P: Type = 6;
    pub const SCALE_FACTOR_200P: Type = 7;
    pub const SCALE_FACTOR_250P: Type = 8;
    pub const SCALE_FACTOR_300P: Type = 9;
    pub const SCALE_FACTOR_NUM_VALUES: Type = 10;
}
pub mod cef_referrer_policy_t {
    pub type Type = ::std::os::raw::c_int;
    pub const REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_FROM_SECURE_TO_INSECURE: Type = 0;
    pub const REFERRER_POLICY_DEFAULT: Type = 0;
    pub const REFERRER_POLICY_REDUCE_REFERRER_GRANULARITY_ON_TRANSITION_CROSS_ORIGIN: Type = 1;
    pub const REFERRER_POLICY_ORIGIN_ONLY_ON_TRANSITION_CROSS_ORIGIN: Type = 2;
    pub const REFERRER_POLICY_NEVER_CLEAR_REFERRER: Type = 3;
    pub const REFERRER_POLICY_ORIGIN: Type = 4;
    pub const REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_CROSS_ORIGIN: Type = 5;
    pub const REFERRER_POLICY_ORIGIN_CLEAR_ON_TRANSITION_FROM_SECURE_TO_INSECURE: Type = 6;
    pub const REFERRER_POLICY_NO_REFERRER: Type = 7;
    pub const REFERRER_POLICY_NUM_VALUES: Type = 8;
}
pub mod cef_response_filter_status_t {
    pub type Type = ::std::os::raw::c_int;
    pub const RESPONSE_FILTER_NEED_MORE_DATA: Type = 0;
    pub const RESPONSE_FILTER_DONE: Type = 1;
    pub const RESPONSE_FILTER_ERROR: Type = 2;
}
pub mod cef_alpha_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_ALPHA_TYPE_OPAQUE: Type = 0;
    pub const CEF_ALPHA_TYPE_PREMULTIPLIED: Type = 1;
    pub const CEF_ALPHA_TYPE_POSTMULTIPLIED: Type = 2;
}
pub mod cef_text_style_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TEXT_STYLE_BOLD: Type = 0;
    pub const CEF_TEXT_STYLE_ITALIC: Type = 1;
    pub const CEF_TEXT_STYLE_STRIKE: Type = 2;
    pub const CEF_TEXT_STYLE_DIAGONAL_STRIKE: Type = 3;
    pub const CEF_TEXT_STYLE_UNDERLINE: Type = 4;
    pub const CEF_TEXT_STYLE_NUM_VALUES: Type = 5;
}
pub mod cef_axis_alignment_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_AXIS_ALIGNMENT_START: Type = 0;
    pub const CEF_AXIS_ALIGNMENT_CENTER: Type = 1;
    pub const CEF_AXIS_ALIGNMENT_END: Type = 2;
    pub const CEF_AXIS_ALIGNMENT_STRETCH: Type = 3;
    pub const CEF_AXIS_ALIGNMENT_NUM_VALUES: Type = 4;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_box_layout_settings_t {
    pub size: usize,
    pub horizontal: ::std::os::raw::c_int,
    pub inside_border_horizontal_spacing: ::std::os::raw::c_int,
    pub inside_border_vertical_spacing: ::std::os::raw::c_int,
    pub inside_border_insets: cef_insets_t,
    pub between_child_spacing: ::std::os::raw::c_int,
    pub main_axis_alignment: cef_axis_alignment_t::Type,
    pub cross_axis_alignment: cef_axis_alignment_t::Type,
    pub minimum_cross_axis_size: ::std::os::raw::c_int,
    pub default_flex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_box_layout_settings_t"]
        [::std::mem::size_of::<_cef_box_layout_settings_t>() - 52usize];
    ["Alignment of _cef_box_layout_settings_t"]
        [::std::mem::align_of::<_cef_box_layout_settings_t>() - 4usize];
    ["Offset of field: _cef_box_layout_settings_t::size"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, size) - 0usize];
    ["Offset of field: _cef_box_layout_settings_t::horizontal"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, horizontal) - 4usize];
    ["Offset of field: _cef_box_layout_settings_t::inside_border_horizontal_spacing"][::std::mem::offset_of!(
        _cef_box_layout_settings_t,
        inside_border_horizontal_spacing
    ) - 8usize];
    ["Offset of field: _cef_box_layout_settings_t::inside_border_vertical_spacing"][::std::mem::offset_of!(
        _cef_box_layout_settings_t,
        inside_border_vertical_spacing
    ) - 12usize];
    ["Offset of field: _cef_box_layout_settings_t::inside_border_insets"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, inside_border_insets) - 16usize];
    ["Offset of field: _cef_box_layout_settings_t::between_child_spacing"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, between_child_spacing) - 32usize];
    ["Offset of field: _cef_box_layout_settings_t::main_axis_alignment"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, main_axis_alignment) - 36usize];
    ["Offset of field: _cef_box_layout_settings_t::cross_axis_alignment"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, cross_axis_alignment) - 40usize];
    ["Offset of field: _cef_box_layout_settings_t::minimum_cross_axis_size"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, minimum_cross_axis_size) - 44usize];
    ["Offset of field: _cef_box_layout_settings_t::default_flex"]
        [::std::mem::offset_of!(_cef_box_layout_settings_t, default_flex) - 48usize];
};
pub type cef_box_layout_settings_t = _cef_box_layout_settings_t;
pub mod cef_button_state_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_BUTTON_STATE_NORMAL: Type = 0;
    pub const CEF_BUTTON_STATE_HOVERED: Type = 1;
    pub const CEF_BUTTON_STATE_PRESSED: Type = 2;
    pub const CEF_BUTTON_STATE_DISABLED: Type = 3;
    pub const CEF_BUTTON_STATE_NUM_VALUES: Type = 4;
}
pub mod cef_horizontal_alignment_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_HORIZONTAL_ALIGNMENT_LEFT: Type = 0;
    pub const CEF_HORIZONTAL_ALIGNMENT_CENTER: Type = 1;
    pub const CEF_HORIZONTAL_ALIGNMENT_RIGHT: Type = 2;
}
pub mod cef_menu_anchor_position_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MENU_ANCHOR_TOPLEFT: Type = 0;
    pub const CEF_MENU_ANCHOR_TOPRIGHT: Type = 1;
    pub const CEF_MENU_ANCHOR_BOTTOMCENTER: Type = 2;
    pub const CEF_MENU_ANCHOR_NUM_VALUES: Type = 3;
}
pub mod cef_menu_color_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MENU_COLOR_TEXT: Type = 0;
    pub const CEF_MENU_COLOR_TEXT_HOVERED: Type = 1;
    pub const CEF_MENU_COLOR_TEXT_ACCELERATOR: Type = 2;
    pub const CEF_MENU_COLOR_TEXT_ACCELERATOR_HOVERED: Type = 3;
    pub const CEF_MENU_COLOR_BACKGROUND: Type = 4;
    pub const CEF_MENU_COLOR_BACKGROUND_HOVERED: Type = 5;
    pub const CEF_MENU_COLOR_NUM_VALUES: Type = 6;
}
pub mod cef_ssl_version_t {
    pub type Type = ::std::os::raw::c_int;
    pub const SSL_CONNECTION_VERSION_UNKNOWN: Type = 0;
    pub const SSL_CONNECTION_VERSION_SSL2: Type = 1;
    pub const SSL_CONNECTION_VERSION_SSL3: Type = 2;
    pub const SSL_CONNECTION_VERSION_TLS1: Type = 3;
    pub const SSL_CONNECTION_VERSION_TLS1_1: Type = 4;
    pub const SSL_CONNECTION_VERSION_TLS1_2: Type = 5;
    pub const SSL_CONNECTION_VERSION_TLS1_3: Type = 6;
    pub const SSL_CONNECTION_VERSION_QUIC: Type = 7;
    pub const SSL_CONNECTION_VERSION_NUM_VALUES: Type = 8;
}
pub mod cef_ssl_content_status_t {
    pub type Type = ::std::os::raw::c_int;
    pub const SSL_CONTENT_NORMAL_CONTENT: Type = 0;
    pub const SSL_CONTENT_DISPLAYED_INSECURE_CONTENT: Type = 1;
    pub const SSL_CONTENT_RAN_INSECURE_CONTENT: Type = 2;
}
pub mod cef_scheme_options_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_SCHEME_OPTION_NONE: Type = 0;
    pub const CEF_SCHEME_OPTION_STANDARD: Type = 1;
    pub const CEF_SCHEME_OPTION_LOCAL: Type = 2;
    pub const CEF_SCHEME_OPTION_DISPLAY_ISOLATED: Type = 4;
    pub const CEF_SCHEME_OPTION_SECURE: Type = 8;
    pub const CEF_SCHEME_OPTION_CORS_ENABLED: Type = 16;
    pub const CEF_SCHEME_OPTION_CSP_BYPASSING: Type = 32;
    pub const CEF_SCHEME_OPTION_FETCH_ENABLED: Type = 64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_range_t {
    pub from: u32,
    pub to: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_range_t"][::std::mem::size_of::<_cef_range_t>() - 8usize];
    ["Alignment of _cef_range_t"][::std::mem::align_of::<_cef_range_t>() - 4usize];
    ["Offset of field: _cef_range_t::from"][::std::mem::offset_of!(_cef_range_t, from) - 0usize];
    ["Offset of field: _cef_range_t::to"][::std::mem::offset_of!(_cef_range_t, to) - 4usize];
};
pub type cef_range_t = _cef_range_t;
pub mod cef_composition_underline_style_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CUS_SOLID: Type = 0;
    pub const CEF_CUS_DOT: Type = 1;
    pub const CEF_CUS_DASH: Type = 2;
    pub const CEF_CUS_NONE: Type = 3;
    pub const CEF_CUS_NUM_VALUES: Type = 4;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_composition_underline_t {
    pub size: usize,
    pub range: cef_range_t,
    pub color: cef_color_t,
    pub background_color: cef_color_t,
    pub thick: ::std::os::raw::c_int,
    pub style: cef_composition_underline_style_t::Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_composition_underline_t"]
        [::std::mem::size_of::<_cef_composition_underline_t>() - 28usize];
    ["Alignment of _cef_composition_underline_t"]
        [::std::mem::align_of::<_cef_composition_underline_t>() - 4usize];
    ["Offset of field: _cef_composition_underline_t::size"]
        [::std::mem::offset_of!(_cef_composition_underline_t, size) - 0usize];
    ["Offset of field: _cef_composition_underline_t::range"]
        [::std::mem::offset_of!(_cef_composition_underline_t, range) - 4usize];
    ["Offset of field: _cef_composition_underline_t::color"]
        [::std::mem::offset_of!(_cef_composition_underline_t, color) - 12usize];
    ["Offset of field: _cef_composition_underline_t::background_color"]
        [::std::mem::offset_of!(_cef_composition_underline_t, background_color) - 16usize];
    ["Offset of field: _cef_composition_underline_t::thick"]
        [::std::mem::offset_of!(_cef_composition_underline_t, thick) - 20usize];
    ["Offset of field: _cef_composition_underline_t::style"]
        [::std::mem::offset_of!(_cef_composition_underline_t, style) - 24usize];
};
pub type cef_composition_underline_t = _cef_composition_underline_t;
pub mod cef_channel_layout_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CHANNEL_LAYOUT_NONE: Type = 0;
    pub const CEF_CHANNEL_LAYOUT_UNSUPPORTED: Type = 1;
    pub const CEF_CHANNEL_LAYOUT_MONO: Type = 2;
    pub const CEF_CHANNEL_LAYOUT_STEREO: Type = 3;
    pub const CEF_CHANNEL_LAYOUT_2_1: Type = 4;
    pub const CEF_CHANNEL_LAYOUT_SURROUND: Type = 5;
    pub const CEF_CHANNEL_LAYOUT_4_0: Type = 6;
    pub const CEF_CHANNEL_LAYOUT_2_2: Type = 7;
    pub const CEF_CHANNEL_LAYOUT_QUAD: Type = 8;
    pub const CEF_CHANNEL_LAYOUT_5_0: Type = 9;
    pub const CEF_CHANNEL_LAYOUT_5_1: Type = 10;
    pub const CEF_CHANNEL_LAYOUT_5_0_BACK: Type = 11;
    pub const CEF_CHANNEL_LAYOUT_5_1_BACK: Type = 12;
    pub const CEF_CHANNEL_LAYOUT_7_0: Type = 13;
    pub const CEF_CHANNEL_LAYOUT_7_1: Type = 14;
    pub const CEF_CHANNEL_LAYOUT_7_1_WIDE: Type = 15;
    pub const CEF_CHANNEL_LAYOUT_STEREO_DOWNMIX: Type = 16;
    pub const CEF_CHANNEL_LAYOUT_2POINT1: Type = 17;
    pub const CEF_CHANNEL_LAYOUT_3_1: Type = 18;
    pub const CEF_CHANNEL_LAYOUT_4_1: Type = 19;
    pub const CEF_CHANNEL_LAYOUT_6_0: Type = 20;
    pub const CEF_CHANNEL_LAYOUT_6_0_FRONT: Type = 21;
    pub const CEF_CHANNEL_LAYOUT_HEXAGONAL: Type = 22;
    pub const CEF_CHANNEL_LAYOUT_6_1: Type = 23;
    pub const CEF_CHANNEL_LAYOUT_6_1_BACK: Type = 24;
    pub const CEF_CHANNEL_LAYOUT_6_1_FRONT: Type = 25;
    pub const CEF_CHANNEL_LAYOUT_7_0_FRONT: Type = 26;
    pub const CEF_CHANNEL_LAYOUT_7_1_WIDE_BACK: Type = 27;
    pub const CEF_CHANNEL_LAYOUT_OCTAGONAL: Type = 28;
    pub const CEF_CHANNEL_LAYOUT_DISCRETE: Type = 29;
    pub const CEF_CHANNEL_LAYOUT_STEREO_AND_KEYBOARD_MIC: Type = 30;
    pub const CEF_CHANNEL_LAYOUT_4_1_QUAD_SIDE: Type = 31;
    pub const CEF_CHANNEL_LAYOUT_BITSTREAM: Type = 32;
    pub const CEF_CHANNEL_LAYOUT_5_1_4_DOWNMIX: Type = 33;
    pub const CEF_CHANNEL_LAYOUT_1_1: Type = 34;
    pub const CEF_CHANNEL_LAYOUT_3_1_BACK: Type = 35;
    pub const CEF_CHANNEL_LAYOUT_5_1_4: Type = 36;
    pub const CEF_CHANNEL_LAYOUT_7_1_4: Type = 37;
    pub const CEF_CHANNEL_NUM_VALUES: Type = 38;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_audio_parameters_t {
    pub size: usize,
    pub channel_layout: cef_channel_layout_t::Type,
    pub sample_rate: ::std::os::raw::c_int,
    pub frames_per_buffer: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_audio_parameters_t"][::std::mem::size_of::<_cef_audio_parameters_t>() - 16usize];
    ["Alignment of _cef_audio_parameters_t"]
        [::std::mem::align_of::<_cef_audio_parameters_t>() - 4usize];
    ["Offset of field: _cef_audio_parameters_t::size"]
        [::std::mem::offset_of!(_cef_audio_parameters_t, size) - 0usize];
    ["Offset of field: _cef_audio_parameters_t::channel_layout"]
        [::std::mem::offset_of!(_cef_audio_parameters_t, channel_layout) - 4usize];
    ["Offset of field: _cef_audio_parameters_t::sample_rate"]
        [::std::mem::offset_of!(_cef_audio_parameters_t, sample_rate) - 8usize];
    ["Offset of field: _cef_audio_parameters_t::frames_per_buffer"]
        [::std::mem::offset_of!(_cef_audio_parameters_t, frames_per_buffer) - 12usize];
};
pub type cef_audio_parameters_t = _cef_audio_parameters_t;
pub mod cef_media_route_create_result_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MRCR_UNKNOWN_ERROR: Type = 0;
    pub const CEF_MRCR_OK: Type = 1;
    pub const CEF_MRCR_TIMED_OUT: Type = 2;
    pub const CEF_MRCR_ROUTE_NOT_FOUND: Type = 3;
    pub const CEF_MRCR_SINK_NOT_FOUND: Type = 4;
    pub const CEF_MRCR_INVALID_ORIGIN: Type = 5;
    pub const CEF_MRCR_OFF_THE_RECORD_MISMATCH_DEPRECATED: Type = 6;
    pub const CEF_MRCR_NO_SUPPORTED_PROVIDER: Type = 7;
    pub const CEF_MRCR_CANCELLED: Type = 8;
    pub const CEF_MRCR_ROUTE_ALREADY_EXISTS: Type = 9;
    pub const CEF_MRCR_DESKTOP_PICKER_FAILED: Type = 10;
    pub const CEF_MRCR_ROUTE_ALREADY_TERMINATED: Type = 11;
    pub const CEF_MRCR_REDUNDANT_REQUEST: Type = 12;
    pub const CEF_MRCR_USER_NOT_ALLOWED: Type = 13;
    pub const CEF_MRCR_NOTIFICATION_DISABLED: Type = 14;
    pub const CEF_MRCR_NUM_VALUES: Type = 15;
}
pub mod cef_media_route_connection_state_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MRCS_UNKNOWN: Type = -1;
    pub const CEF_MRCS_CONNECTING: Type = 0;
    pub const CEF_MRCS_CONNECTED: Type = 1;
    pub const CEF_MRCS_CLOSED: Type = 2;
    pub const CEF_MRCS_TERMINATED: Type = 3;
    pub const CEF_MRCS_NUM_VALUES: Type = 4;
}
pub mod cef_media_sink_icon_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MSIT_CAST: Type = 0;
    pub const CEF_MSIT_CAST_AUDIO_GROUP: Type = 1;
    pub const CEF_MSIT_CAST_AUDIO: Type = 2;
    pub const CEF_MSIT_MEETING: Type = 3;
    pub const CEF_MSIT_HANGOUT: Type = 4;
    pub const CEF_MSIT_EDUCATION: Type = 5;
    pub const CEF_MSIT_WIRED_DISPLAY: Type = 6;
    pub const CEF_MSIT_GENERIC: Type = 7;
    pub const CEF_MSIT_NUM_VALUES: Type = 8;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_media_sink_device_info_t {
    pub size: usize,
    pub ip_address: cef_string_t,
    pub port: ::std::os::raw::c_int,
    pub model_name: cef_string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_sink_device_info_t"]
        [::std::mem::size_of::<_cef_media_sink_device_info_t>() - 32usize];
    ["Alignment of _cef_media_sink_device_info_t"]
        [::std::mem::align_of::<_cef_media_sink_device_info_t>() - 4usize];
    ["Offset of field: _cef_media_sink_device_info_t::size"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_t, size) - 0usize];
    ["Offset of field: _cef_media_sink_device_info_t::ip_address"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_t, ip_address) - 4usize];
    ["Offset of field: _cef_media_sink_device_info_t::port"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_t, port) - 16usize];
    ["Offset of field: _cef_media_sink_device_info_t::model_name"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_t, model_name) - 20usize];
};
pub type cef_media_sink_device_info_t = _cef_media_sink_device_info_t;
pub mod cef_text_field_commands_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TFC_UNKNOWN: Type = 0;
    pub const CEF_TFC_CUT: Type = 1;
    pub const CEF_TFC_COPY: Type = 2;
    pub const CEF_TFC_PASTE: Type = 3;
    pub const CEF_TFC_SELECT_ALL: Type = 4;
    pub const CEF_TFC_SELECT_WORD: Type = 5;
    pub const CEF_TFC_UNDO: Type = 6;
    pub const CEF_TFC_DELETE: Type = 7;
    pub const CEF_TFC_NUM_VALUES: Type = 8;
}
pub mod cef_chrome_toolbar_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CTT_UNKNOWN: Type = 0;
    pub const CEF_CTT_NONE: Type = 1;
    pub const CEF_CTT_NORMAL: Type = 2;
    pub const CEF_CTT_LOCATION: Type = 3;
    pub const CEF_CTT_NUM_VALUES: Type = 4;
}
pub mod cef_chrome_page_action_icon_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CPAIT_BOOKMARK_STAR: Type = 0;
    pub const CEF_CPAIT_CLICK_TO_CALL: Type = 1;
    pub const CEF_CPAIT_COOKIE_CONTROLS: Type = 2;
    pub const CEF_CPAIT_FILE_SYSTEM_ACCESS: Type = 3;
    pub const CEF_CPAIT_FIND: Type = 4;
    pub const CEF_CPAIT_MEMORY_SAVER: Type = 5;
    pub const CEF_CPAIT_INTENT_PICKER: Type = 6;
    pub const CEF_CPAIT_LOCAL_CARD_MIGRATION: Type = 7;
    pub const CEF_CPAIT_MANAGE_PASSWORDS: Type = 8;
    pub const CEF_CPAIT_PAYMENTS_OFFER_NOTIFICATION: Type = 9;
    pub const CEF_CPAIT_PRICE_TRACKING: Type = 10;
    pub const CEF_CPAIT_PWA_INSTALL: Type = 11;
    pub const CEF_CPAIT_QR_CODE_GENERATOR_DEPRECATED: Type = 12;
    pub const CEF_CPAIT_READER_MODE_DEPRECATED: Type = 13;
    pub const CEF_CPAIT_SAVE_AUTOFILL_ADDRESS: Type = 14;
    pub const CEF_CPAIT_SAVE_CARD: Type = 15;
    pub const CEF_CPAIT_SEND_TAB_TO_SELF_DEPRECATED: Type = 16;
    pub const CEF_CPAIT_SHARING_HUB: Type = 17;
    pub const CEF_CPAIT_SIDE_SEARCH_DEPRECATED: Type = 18;
    pub const CEF_CPAIT_SMS_REMOTE_FETCHER: Type = 19;
    pub const CEF_CPAIT_TRANSLATE: Type = 20;
    pub const CEF_CPAIT_VIRTUAL_CARD_ENROLL: Type = 21;
    pub const CEF_CPAIT_VIRTUAL_CARD_INFORMATION: Type = 22;
    pub const CEF_CPAIT_ZOOM: Type = 23;
    pub const CEF_CPAIT_SAVE_IBAN: Type = 24;
    pub const CEF_CPAIT_MANDATORY_REAUTH: Type = 25;
    pub const CEF_CPAIT_PRICE_INSIGHTS: Type = 26;
    pub const CEF_CPAIT_READ_ANYTHING_DEPRECATED: Type = 27;
    pub const CEF_CPAIT_PRODUCT_SPECIFICATIONS: Type = 28;
    pub const CEF_CPAIT_LENS_OVERLAY: Type = 29;
    pub const CEF_CPAIT_DISCOUNTS: Type = 30;
    pub const CEF_CPAIT_OPTIMIZATION_GUIDE: Type = 31;
    pub const CEF_CPAIT_COLLABORATION_MESSAGING: Type = 32;
    pub const CEF_CPAIT_CHANGE_PASSWORD: Type = 33;
    pub const CEF_CPAIT_LENS_OVERLAY_HOMEWORK: Type = 34;
    pub const CEF_CPAIT_AI_MODE: Type = 35;
    pub const CEF_CPAIT_READING_MODE: Type = 36;
    pub const CEF_CPAIT_CONTEXTUAL_SIDE_PANEL: Type = 37;
    pub const CEF_CPAIT_JS_OPTIMIZATIONS: Type = 38;
    pub const CEF_CPAIT_RECORD_REPLAY: Type = 39;
    pub const CEF_CPAIT_INDIGO: Type = 40;
    pub const CEF_CPAIT_FEDERATION: Type = 41;
    pub const CEF_CPAIT_GLIC: Type = 42;
    pub const CEF_CPAIT_ANCHORED_CONTEXTUAL_CUE: Type = 43;
    pub const CEF_CPAIT_WEB_AUTHN_AMBIENT_SIGNIN: Type = 44;
    pub const CEF_CPAIT_AUTOFILL_PAYMENT: Type = 45;
    pub const CEF_CPAIT_MULTISTEP_FILTER: Type = 46;
    pub const CEF_CPAIT_NUM_VALUES: Type = 47;
}
pub mod cef_chrome_toolbar_button_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_CTBT_CAST_DEPRECATED: Type = 0;
    pub const CEF_CTBT_DOWNLOAD_DEPRECATED: Type = 1;
    pub const CEF_CTBT_SEND_TAB_TO_SELF_DEPRECATED: Type = 2;
    pub const CEF_CTBT_SIDE_PANEL_DEPRECATED: Type = 3;
    pub const CEF_CTBT_MEDIA: Type = 4;
    pub const CEF_CTBT_TAB_SEARCH: Type = 5;
    pub const CEF_CTBT_BATTERY_SAVER: Type = 6;
    pub const CEF_CTBT_AVATAR: Type = 7;
    pub const CEF_CTBT_NUM_VALUES: Type = 8;
}
pub mod cef_docking_mode_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_DOCKING_MODE_TOP_LEFT: Type = 0;
    pub const CEF_DOCKING_MODE_TOP_RIGHT: Type = 1;
    pub const CEF_DOCKING_MODE_BOTTOM_LEFT: Type = 2;
    pub const CEF_DOCKING_MODE_BOTTOM_RIGHT: Type = 3;
    pub const CEF_DOCKING_MODE_CUSTOM: Type = 4;
    pub const CEF_DOCKING_MODE_NUM_VALUES: Type = 5;
}
pub mod cef_show_state_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_SHOW_STATE_NORMAL: Type = 0;
    pub const CEF_SHOW_STATE_MINIMIZED: Type = 1;
    pub const CEF_SHOW_STATE_MAXIMIZED: Type = 2;
    pub const CEF_SHOW_STATE_FULLSCREEN: Type = 3;
    pub const CEF_SHOW_STATE_HIDDEN: Type = 4;
    pub const CEF_SHOW_STATE_NUM_VALUES: Type = 5;
}
pub mod cef_touch_handle_state_flags_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_THS_FLAG_NONE: Type = 0;
    pub const CEF_THS_FLAG_ENABLED: Type = 1;
    pub const CEF_THS_FLAG_ORIENTATION: Type = 2;
    pub const CEF_THS_FLAG_ORIGIN: Type = 4;
    pub const CEF_THS_FLAG_ALPHA: Type = 8;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_touch_handle_state_t {
    pub size: usize,
    pub touch_handle_id: ::std::os::raw::c_int,
    pub flags: u32,
    pub enabled: ::std::os::raw::c_int,
    pub orientation: cef_horizontal_alignment_t::Type,
    pub mirror_vertical: ::std::os::raw::c_int,
    pub mirror_horizontal: ::std::os::raw::c_int,
    pub origin: cef_point_t,
    pub alpha: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_touch_handle_state_t"]
        [::std::mem::size_of::<_cef_touch_handle_state_t>() - 40usize];
    ["Alignment of _cef_touch_handle_state_t"]
        [::std::mem::align_of::<_cef_touch_handle_state_t>() - 4usize];
    ["Offset of field: _cef_touch_handle_state_t::size"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, size) - 0usize];
    ["Offset of field: _cef_touch_handle_state_t::touch_handle_id"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, touch_handle_id) - 4usize];
    ["Offset of field: _cef_touch_handle_state_t::flags"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, flags) - 8usize];
    ["Offset of field: _cef_touch_handle_state_t::enabled"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, enabled) - 12usize];
    ["Offset of field: _cef_touch_handle_state_t::orientation"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, orientation) - 16usize];
    ["Offset of field: _cef_touch_handle_state_t::mirror_vertical"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, mirror_vertical) - 20usize];
    ["Offset of field: _cef_touch_handle_state_t::mirror_horizontal"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, mirror_horizontal) - 24usize];
    ["Offset of field: _cef_touch_handle_state_t::origin"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, origin) - 28usize];
    ["Offset of field: _cef_touch_handle_state_t::alpha"]
        [::std::mem::offset_of!(_cef_touch_handle_state_t, alpha) - 36usize];
};
pub type cef_touch_handle_state_t = _cef_touch_handle_state_t;
pub mod cef_media_access_permission_types_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_MEDIA_PERMISSION_NONE: Type = 0;
    pub const CEF_MEDIA_PERMISSION_DEVICE_AUDIO_CAPTURE: Type = 1;
    pub const CEF_MEDIA_PERMISSION_DEVICE_VIDEO_CAPTURE: Type = 2;
    pub const CEF_MEDIA_PERMISSION_DESKTOP_AUDIO_CAPTURE: Type = 4;
    pub const CEF_MEDIA_PERMISSION_DESKTOP_VIDEO_CAPTURE: Type = 8;
}
pub mod cef_permission_request_types_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_PERMISSION_TYPE_NONE: Type = 0;
    pub const CEF_PERMISSION_TYPE_AR_SESSION: Type = 1;
    pub const CEF_PERMISSION_TYPE_CAMERA_PAN_TILT_ZOOM: Type = 2;
    pub const CEF_PERMISSION_TYPE_CAMERA_STREAM: Type = 4;
    pub const CEF_PERMISSION_TYPE_CAPTURED_SURFACE_CONTROL: Type = 8;
    pub const CEF_PERMISSION_TYPE_CLIPBOARD: Type = 16;
    pub const CEF_PERMISSION_TYPE_TOP_LEVEL_STORAGE_ACCESS: Type = 32;
    pub const CEF_PERMISSION_TYPE_DISK_QUOTA: Type = 64;
    pub const CEF_PERMISSION_TYPE_LOCAL_FONTS: Type = 128;
    pub const CEF_PERMISSION_TYPE_GEOLOCATION: Type = 256;
    pub const CEF_PERMISSION_TYPE_HAND_TRACKING: Type = 512;
    pub const CEF_PERMISSION_TYPE_IDENTITY_PROVIDER: Type = 1024;
    pub const CEF_PERMISSION_TYPE_IDLE_DETECTION: Type = 2048;
    pub const CEF_PERMISSION_TYPE_MIC_STREAM: Type = 4096;
    pub const CEF_PERMISSION_TYPE_MIDI_SYSEX: Type = 8192;
    pub const CEF_PERMISSION_TYPE_MULTIPLE_DOWNLOADS: Type = 16384;
    pub const CEF_PERMISSION_TYPE_NOTIFICATIONS: Type = 32768;
    pub const CEF_PERMISSION_TYPE_KEYBOARD_LOCK: Type = 65536;
    pub const CEF_PERMISSION_TYPE_POINTER_LOCK: Type = 131072;
    pub const CEF_PERMISSION_TYPE_PROTECTED_MEDIA_IDENTIFIER: Type = 262144;
    pub const CEF_PERMISSION_TYPE_REGISTER_PROTOCOL_HANDLER: Type = 524288;
    pub const CEF_PERMISSION_TYPE_STORAGE_ACCESS: Type = 1048576;
    pub const CEF_PERMISSION_TYPE_VR_SESSION: Type = 2097152;
    pub const CEF_PERMISSION_TYPE_WEB_APP_INSTALLATION: Type = 4194304;
    pub const CEF_PERMISSION_TYPE_WINDOW_MANAGEMENT: Type = 8388608;
    pub const CEF_PERMISSION_TYPE_FILE_SYSTEM_ACCESS: Type = 16777216;
    pub const CEF_PERMISSION_TYPE_LOCAL_NETWORK_ACCESS_DEPRECATED: Type = 33554432;
    pub const CEF_PERMISSION_TYPE_LOCAL_NETWORK: Type = 67108864;
    pub const CEF_PERMISSION_TYPE_LOOPBACK_NETWORK: Type = 134217728;
    pub const CEF_PERMISSION_TYPE_SENSORS: Type = 268435456;
}
pub mod cef_permission_request_result_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_PERMISSION_RESULT_ACCEPT: Type = 0;
    pub const CEF_PERMISSION_RESULT_DENY: Type = 1;
    pub const CEF_PERMISSION_RESULT_DISMISS: Type = 2;
    pub const CEF_PERMISSION_RESULT_IGNORE: Type = 3;
    pub const CEF_PERMISSION_RESULT_NUM_VALUES: Type = 4;
}
pub mod cef_test_cert_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TEST_CERT_OK_IP: Type = 0;
    pub const CEF_TEST_CERT_OK_DOMAIN: Type = 1;
    pub const CEF_TEST_CERT_EXPIRED: Type = 2;
    pub const CEF_TEST_CERT_NUM_VALUES: Type = 3;
}
pub mod cef_preferences_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_PREFERENCES_TYPE_GLOBAL: Type = 0;
    pub const CEF_PREFERENCES_TYPE_REQUEST_CONTEXT: Type = 1;
    pub const CEF_PREFERENCES_TYPE_NUM_VALUES: Type = 2;
}
pub mod cef_download_interrupt_reason_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_NONE: Type = 0;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_FAILED: Type = 1;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_ACCESS_DENIED: Type = 2;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_NO_SPACE: Type = 3;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_NAME_TOO_LONG: Type = 5;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_TOO_LARGE: Type = 6;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_VIRUS_INFECTED: Type = 7;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_TRANSIENT_ERROR: Type = 10;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_BLOCKED: Type = 11;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_SECURITY_CHECK_FAILED: Type = 12;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_TOO_SHORT: Type = 13;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_HASH_MISMATCH: Type = 14;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_FILE_SAME_AS_SOURCE: Type = 15;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_FAILED: Type = 20;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_TIMEOUT: Type = 21;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_DISCONNECTED: Type = 22;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_SERVER_DOWN: Type = 23;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_NETWORK_INVALID_REQUEST: Type = 24;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_FAILED: Type = 30;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_NO_RANGE: Type = 31;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_BAD_CONTENT: Type = 33;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_UNAUTHORIZED: Type = 34;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_CERT_PROBLEM: Type = 35;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_FORBIDDEN: Type = 36;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_UNREACHABLE: Type = 37;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_CONTENT_LENGTH_MISMATCH: Type = 38;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_SERVER_CROSS_ORIGIN_REDIRECT: Type = 39;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_USER_CANCELED: Type = 40;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_USER_SHUTDOWN: Type = 41;
    pub const CEF_DOWNLOAD_INTERRUPT_REASON_CRASH: Type = 50;
}
pub mod cef_gesture_command_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_GESTURE_COMMAND_BACK: Type = 0;
    pub const CEF_GESTURE_COMMAND_FORWARD: Type = 1;
}
pub mod cef_zoom_command_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_ZOOM_COMMAND_OUT: Type = 0;
    pub const CEF_ZOOM_COMMAND_RESET: Type = 1;
    pub const CEF_ZOOM_COMMAND_IN: Type = 2;
}
pub mod cef_color_variant_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_COLOR_VARIANT_SYSTEM: Type = 0;
    pub const CEF_COLOR_VARIANT_LIGHT: Type = 1;
    pub const CEF_COLOR_VARIANT_DARK: Type = 2;
    pub const CEF_COLOR_VARIANT_TONAL_SPOT: Type = 3;
    pub const CEF_COLOR_VARIANT_NEUTRAL: Type = 4;
    pub const CEF_COLOR_VARIANT_VIBRANT: Type = 5;
    pub const CEF_COLOR_VARIANT_EXPRESSIVE: Type = 6;
    pub const CEF_COLOR_VARIANT_NUM_VALUES: Type = 7;
}
pub mod cef_task_type_t {
    pub type Type = ::std::os::raw::c_int;
    pub const CEF_TASK_TYPE_UNKNOWN: Type = 0;
    pub const CEF_TASK_TYPE_BROWSER: Type = 1;
    pub const CEF_TASK_TYPE_GPU: Type = 2;
    pub const CEF_TASK_TYPE_ZYGOTE: Type = 3;
    pub const CEF_TASK_TYPE_UTILITY: Type = 4;
    pub const CEF_TASK_TYPE_RENDERER: Type = 5;
    pub const CEF_TASK_TYPE_EXTENSION: Type = 6;
    pub const CEF_TASK_TYPE_GUEST: Type = 7;
    pub const CEF_TASK_TYPE_PLUGIN_DEPRECATED: Type = 8;
    pub const CEF_TASK_TYPE_SANDBOX_HELPER: Type = 9;
    pub const CEF_TASK_TYPE_DEDICATED_WORKER: Type = 10;
    pub const CEF_TASK_TYPE_SHARED_WORKER: Type = 11;
    pub const CEF_TASK_TYPE_SERVICE_WORKER: Type = 12;
    pub const CEF_TASK_TYPE_NUM_VALUES: Type = 13;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_task_info_t {
    pub size: usize,
    pub id: i64,
    pub type_: cef_task_type_t::Type,
    pub is_killable: ::std::os::raw::c_int,
    pub title: cef_string_t,
    pub cpu_usage: f64,
    pub number_of_processors: ::std::os::raw::c_int,
    pub memory: i64,
    pub gpu_memory: i64,
    pub is_gpu_memory_inflated: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_task_info_t"][::std::mem::size_of::<_cef_task_info_t>() - 80usize];
    ["Alignment of _cef_task_info_t"][::std::mem::align_of::<_cef_task_info_t>() - 8usize];
    ["Offset of field: _cef_task_info_t::size"]
        [::std::mem::offset_of!(_cef_task_info_t, size) - 0usize];
    ["Offset of field: _cef_task_info_t::id"]
        [::std::mem::offset_of!(_cef_task_info_t, id) - 8usize];
    ["Offset of field: _cef_task_info_t::type_"]
        [::std::mem::offset_of!(_cef_task_info_t, type_) - 16usize];
    ["Offset of field: _cef_task_info_t::is_killable"]
        [::std::mem::offset_of!(_cef_task_info_t, is_killable) - 20usize];
    ["Offset of field: _cef_task_info_t::title"]
        [::std::mem::offset_of!(_cef_task_info_t, title) - 24usize];
    ["Offset of field: _cef_task_info_t::cpu_usage"]
        [::std::mem::offset_of!(_cef_task_info_t, cpu_usage) - 40usize];
    ["Offset of field: _cef_task_info_t::number_of_processors"]
        [::std::mem::offset_of!(_cef_task_info_t, number_of_processors) - 48usize];
    ["Offset of field: _cef_task_info_t::memory"]
        [::std::mem::offset_of!(_cef_task_info_t, memory) - 56usize];
    ["Offset of field: _cef_task_info_t::gpu_memory"]
        [::std::mem::offset_of!(_cef_task_info_t, gpu_memory) - 64usize];
    ["Offset of field: _cef_task_info_t::is_gpu_memory_inflated"]
        [::std::mem::offset_of!(_cef_task_info_t, is_gpu_memory_inflated) - 72usize];
};
pub type cef_task_info_t = _cef_task_info_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_base_ref_counted_t {
    pub size: usize,
    pub add_ref:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_base_ref_counted_t)>,
    pub release: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
    pub has_one_ref: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
    pub has_at_least_one_ref: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_base_ref_counted_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_base_ref_counted_t"][::std::mem::size_of::<_cef_base_ref_counted_t>() - 20usize];
    ["Alignment of _cef_base_ref_counted_t"]
        [::std::mem::align_of::<_cef_base_ref_counted_t>() - 4usize];
    ["Offset of field: _cef_base_ref_counted_t::size"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, size) - 0usize];
    ["Offset of field: _cef_base_ref_counted_t::add_ref"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, add_ref) - 4usize];
    ["Offset of field: _cef_base_ref_counted_t::release"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, release) - 8usize];
    ["Offset of field: _cef_base_ref_counted_t::has_one_ref"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, has_one_ref) - 12usize];
    ["Offset of field: _cef_base_ref_counted_t::has_at_least_one_ref"]
        [::std::mem::offset_of!(_cef_base_ref_counted_t, has_at_least_one_ref) - 16usize];
};
pub type cef_base_ref_counted_t = _cef_base_ref_counted_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_base_scoped_t {
    pub size: usize,
    pub del: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_base_scoped_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_base_scoped_t"][::std::mem::size_of::<_cef_base_scoped_t>() - 8usize];
    ["Alignment of _cef_base_scoped_t"][::std::mem::align_of::<_cef_base_scoped_t>() - 4usize];
    ["Offset of field: _cef_base_scoped_t::size"]
        [::std::mem::offset_of!(_cef_base_scoped_t, size) - 0usize];
    ["Offset of field: _cef_base_scoped_t::del"]
        [::std::mem::offset_of!(_cef_base_scoped_t, del) - 4usize];
};
pub type cef_base_scoped_t = _cef_base_scoped_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_dev_tools_message_observer_t {
    pub base: cef_base_ref_counted_t,
    pub on_dev_tools_message: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            message: *const ::std::os::raw::c_void,
            message_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub on_dev_tools_method_result: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            message_id: ::std::os::raw::c_int,
            success: ::std::os::raw::c_int,
            result: *const ::std::os::raw::c_void,
            result_size: usize,
        ),
    >,
    pub on_dev_tools_event: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
            method: *const cef_string_t,
            params: *const ::std::os::raw::c_void,
            params_size: usize,
        ),
    >,
    pub on_dev_tools_agent_attached: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
        ),
    >,
    pub on_dev_tools_agent_detached: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dev_tools_message_observer_t,
            browser: *mut _cef_browser_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_dev_tools_message_observer_t"]
        [::std::mem::size_of::<_cef_dev_tools_message_observer_t>() - 40usize];
    ["Alignment of _cef_dev_tools_message_observer_t"]
        [::std::mem::align_of::<_cef_dev_tools_message_observer_t>() - 4usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::base"]
        [::std::mem::offset_of!(_cef_dev_tools_message_observer_t, base) - 0usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_message"]
        [::std::mem::offset_of!(_cef_dev_tools_message_observer_t, on_dev_tools_message) - 20usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_method_result"][::std::mem::offset_of!(
        _cef_dev_tools_message_observer_t,
        on_dev_tools_method_result
    ) - 24usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_event"]
        [::std::mem::offset_of!(_cef_dev_tools_message_observer_t, on_dev_tools_event) - 28usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_agent_attached"][::std::mem::offset_of!(
        _cef_dev_tools_message_observer_t,
        on_dev_tools_agent_attached
    )
        - 32usize];
    ["Offset of field: _cef_dev_tools_message_observer_t::on_dev_tools_agent_detached"][::std::mem::offset_of!(
        _cef_dev_tools_message_observer_t,
        on_dev_tools_agent_detached
    )
        - 36usize];
};
pub type cef_dev_tools_message_observer_t = _cef_dev_tools_message_observer_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_value_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_owned: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_same: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            that: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub is_equal: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            that: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub copy: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> *mut _cef_value_t,
    >,
    pub get_type: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> cef_value_type_t::Type,
    >,
    pub get_bool: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    pub get_int: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    pub get_double:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_value_t) -> f64>,
    pub get_string: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> cef_string_userfree_t,
    >,
    pub get_binary: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> *mut _cef_binary_value_t,
    >,
    pub get_dictionary: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> *mut _cef_dictionary_value_t,
    >,
    pub get_list: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> *mut _cef_list_value_t,
    >,
    pub set_null: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t) -> ::std::os::raw::c_int,
    >,
    pub set_bool: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_int: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_double: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_value_t, value: f64) -> ::std::os::raw::c_int,
    >,
    pub set_string: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_binary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_dictionary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_list: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_value_t,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_value_t"][::std::mem::size_of::<_cef_value_t>() - 108usize];
    ["Alignment of _cef_value_t"][::std::mem::align_of::<_cef_value_t>() - 4usize];
    ["Offset of field: _cef_value_t::base"][::std::mem::offset_of!(_cef_value_t, base) - 0usize];
    ["Offset of field: _cef_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_value_t, is_valid) - 20usize];
    ["Offset of field: _cef_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_value_t, is_owned) - 24usize];
    ["Offset of field: _cef_value_t::is_read_only"]
        [::std::mem::offset_of!(_cef_value_t, is_read_only) - 28usize];
    ["Offset of field: _cef_value_t::is_same"]
        [::std::mem::offset_of!(_cef_value_t, is_same) - 32usize];
    ["Offset of field: _cef_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_value_t, is_equal) - 36usize];
    ["Offset of field: _cef_value_t::copy"][::std::mem::offset_of!(_cef_value_t, copy) - 40usize];
    ["Offset of field: _cef_value_t::get_type"]
        [::std::mem::offset_of!(_cef_value_t, get_type) - 44usize];
    ["Offset of field: _cef_value_t::get_bool"]
        [::std::mem::offset_of!(_cef_value_t, get_bool) - 48usize];
    ["Offset of field: _cef_value_t::get_int"]
        [::std::mem::offset_of!(_cef_value_t, get_int) - 52usize];
    ["Offset of field: _cef_value_t::get_double"]
        [::std::mem::offset_of!(_cef_value_t, get_double) - 56usize];
    ["Offset of field: _cef_value_t::get_string"]
        [::std::mem::offset_of!(_cef_value_t, get_string) - 60usize];
    ["Offset of field: _cef_value_t::get_binary"]
        [::std::mem::offset_of!(_cef_value_t, get_binary) - 64usize];
    ["Offset of field: _cef_value_t::get_dictionary"]
        [::std::mem::offset_of!(_cef_value_t, get_dictionary) - 68usize];
    ["Offset of field: _cef_value_t::get_list"]
        [::std::mem::offset_of!(_cef_value_t, get_list) - 72usize];
    ["Offset of field: _cef_value_t::set_null"]
        [::std::mem::offset_of!(_cef_value_t, set_null) - 76usize];
    ["Offset of field: _cef_value_t::set_bool"]
        [::std::mem::offset_of!(_cef_value_t, set_bool) - 80usize];
    ["Offset of field: _cef_value_t::set_int"]
        [::std::mem::offset_of!(_cef_value_t, set_int) - 84usize];
    ["Offset of field: _cef_value_t::set_double"]
        [::std::mem::offset_of!(_cef_value_t, set_double) - 88usize];
    ["Offset of field: _cef_value_t::set_string"]
        [::std::mem::offset_of!(_cef_value_t, set_string) - 92usize];
    ["Offset of field: _cef_value_t::set_binary"]
        [::std::mem::offset_of!(_cef_value_t, set_binary) - 96usize];
    ["Offset of field: _cef_value_t::set_dictionary"]
        [::std::mem::offset_of!(_cef_value_t, set_dictionary) - 100usize];
    ["Offset of field: _cef_value_t::set_list"]
        [::std::mem::offset_of!(_cef_value_t, set_list) - 104usize];
};
pub type cef_value_t = _cef_value_t;
unsafe extern "C" {
    pub fn cef_value_create() -> *mut cef_value_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_binary_value_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_binary_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_owned: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_binary_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_same: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_binary_value_t,
            that: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub is_equal: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_binary_value_t,
            that: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub copy: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_binary_value_t) -> *mut _cef_binary_value_t,
    >,
    pub get_raw_data: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_binary_value_t,
        ) -> *const ::std::os::raw::c_void,
    >,
    pub get_size:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_binary_value_t) -> usize>,
    pub get_data: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_binary_value_t,
            buffer: *mut ::std::os::raw::c_void,
            buffer_size: usize,
            data_offset: usize,
        ) -> usize,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_binary_value_t"][::std::mem::size_of::<_cef_binary_value_t>() - 52usize];
    ["Alignment of _cef_binary_value_t"][::std::mem::align_of::<_cef_binary_value_t>() - 4usize];
    ["Offset of field: _cef_binary_value_t::base"]
        [::std::mem::offset_of!(_cef_binary_value_t, base) - 0usize];
    ["Offset of field: _cef_binary_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_valid) - 20usize];
    ["Offset of field: _cef_binary_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_owned) - 24usize];
    ["Offset of field: _cef_binary_value_t::is_same"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_same) - 28usize];
    ["Offset of field: _cef_binary_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_binary_value_t, is_equal) - 32usize];
    ["Offset of field: _cef_binary_value_t::copy"]
        [::std::mem::offset_of!(_cef_binary_value_t, copy) - 36usize];
    ["Offset of field: _cef_binary_value_t::get_raw_data"]
        [::std::mem::offset_of!(_cef_binary_value_t, get_raw_data) - 40usize];
    ["Offset of field: _cef_binary_value_t::get_size"]
        [::std::mem::offset_of!(_cef_binary_value_t, get_size) - 44usize];
    ["Offset of field: _cef_binary_value_t::get_data"]
        [::std::mem::offset_of!(_cef_binary_value_t, get_data) - 48usize];
};
pub type cef_binary_value_t = _cef_binary_value_t;
unsafe extern "C" {
    pub fn cef_binary_value_create(
        data: *const ::std::os::raw::c_void, data_size: usize,
    ) -> *mut cef_binary_value_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_dictionary_value_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_owned: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_same: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            that: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub is_equal: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            that: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub copy: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            exclude_empty_children: ::std::os::raw::c_int,
        ) -> *mut _cef_dictionary_value_t,
    >,
    pub get_size: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_dictionary_value_t) -> usize,
    >,
    pub clear: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_dictionary_value_t) -> ::std::os::raw::c_int,
    >,
    pub has_key: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_keys: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            keys: cef_string_list_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub remove: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_type: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> cef_value_type_t::Type,
    >,
    pub get_value: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_value_t,
    >,
    pub get_bool: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_int: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_double: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> f64,
    >,
    pub get_string: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
    pub get_binary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_binary_value_t,
    >,
    pub get_dictionary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_dictionary_value_t,
    >,
    pub get_list: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> *mut _cef_list_value_t,
    >,
    pub set_value: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_null: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_bool: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_int: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_double: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: f64,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_string: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_binary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_dictionary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_list: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_dictionary_value_t,
            key: *const cef_string_t,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_dictionary_value_t"]
        [::std::mem::size_of::<_cef_dictionary_value_t>() - 136usize];
    ["Alignment of _cef_dictionary_value_t"]
        [::std::mem::align_of::<_cef_dictionary_value_t>() - 4usize];
    ["Offset of field: _cef_dictionary_value_t::base"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, base) - 0usize];
    ["Offset of field: _cef_dictionary_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_valid) - 20usize];
    ["Offset of field: _cef_dictionary_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_owned) - 24usize];
    ["Offset of field: _cef_dictionary_value_t::is_read_only"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_read_only) - 28usize];
    ["Offset of field: _cef_dictionary_value_t::is_same"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_same) - 32usize];
    ["Offset of field: _cef_dictionary_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, is_equal) - 36usize];
    ["Offset of field: _cef_dictionary_value_t::copy"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, copy) - 40usize];
    ["Offset of field: _cef_dictionary_value_t::get_size"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_size) - 44usize];
    ["Offset of field: _cef_dictionary_value_t::clear"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, clear) - 48usize];
    ["Offset of field: _cef_dictionary_value_t::has_key"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, has_key) - 52usize];
    ["Offset of field: _cef_dictionary_value_t::get_keys"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_keys) - 56usize];
    ["Offset of field: _cef_dictionary_value_t::remove"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, remove) - 60usize];
    ["Offset of field: _cef_dictionary_value_t::get_type"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_type) - 64usize];
    ["Offset of field: _cef_dictionary_value_t::get_value"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_value) - 68usize];
    ["Offset of field: _cef_dictionary_value_t::get_bool"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_bool) - 72usize];
    ["Offset of field: _cef_dictionary_value_t::get_int"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_int) - 76usize];
    ["Offset of field: _cef_dictionary_value_t::get_double"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_double) - 80usize];
    ["Offset of field: _cef_dictionary_value_t::get_string"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_string) - 84usize];
    ["Offset of field: _cef_dictionary_value_t::get_binary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_binary) - 88usize];
    ["Offset of field: _cef_dictionary_value_t::get_dictionary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_dictionary) - 92usize];
    ["Offset of field: _cef_dictionary_value_t::get_list"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, get_list) - 96usize];
    ["Offset of field: _cef_dictionary_value_t::set_value"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_value) - 100usize];
    ["Offset of field: _cef_dictionary_value_t::set_null"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_null) - 104usize];
    ["Offset of field: _cef_dictionary_value_t::set_bool"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_bool) - 108usize];
    ["Offset of field: _cef_dictionary_value_t::set_int"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_int) - 112usize];
    ["Offset of field: _cef_dictionary_value_t::set_double"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_double) - 116usize];
    ["Offset of field: _cef_dictionary_value_t::set_string"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_string) - 120usize];
    ["Offset of field: _cef_dictionary_value_t::set_binary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_binary) - 124usize];
    ["Offset of field: _cef_dictionary_value_t::set_dictionary"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_dictionary) - 128usize];
    ["Offset of field: _cef_dictionary_value_t::set_list"]
        [::std::mem::offset_of!(_cef_dictionary_value_t, set_list) - 132usize];
};
pub type cef_dictionary_value_t = _cef_dictionary_value_t;
unsafe extern "C" {
    pub fn cef_dictionary_value_create() -> *mut cef_dictionary_value_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_list_value_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_owned: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    pub is_same: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            that: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub is_equal: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            that: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub copy: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_list_value_t) -> *mut _cef_list_value_t,
    >,
    pub set_size: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_size:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_list_value_t) -> usize>,
    pub clear: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_list_value_t) -> ::std::os::raw::c_int,
    >,
    pub remove: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_type: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> cef_value_type_t::Type,
    >,
    pub get_value: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_value_t,
    >,
    pub get_bool: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_int: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_double: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_list_value_t, index: usize) -> f64,
    >,
    pub get_string: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> cef_string_userfree_t,
    >,
    pub get_binary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_binary_value_t,
    >,
    pub get_dictionary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_dictionary_value_t,
    >,
    pub get_list: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> *mut _cef_list_value_t,
    >,
    pub set_value: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_null: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_bool: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_int: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_double: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: f64,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_string: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_binary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_binary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_dictionary: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_dictionary_value_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_list: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_list_value_t,
            index: usize,
            value: *mut _cef_list_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_list_value_t"][::std::mem::size_of::<_cef_list_value_t>() - 132usize];
    ["Alignment of _cef_list_value_t"][::std::mem::align_of::<_cef_list_value_t>() - 4usize];
    ["Offset of field: _cef_list_value_t::base"]
        [::std::mem::offset_of!(_cef_list_value_t, base) - 0usize];
    ["Offset of field: _cef_list_value_t::is_valid"]
        [::std::mem::offset_of!(_cef_list_value_t, is_valid) - 20usize];
    ["Offset of field: _cef_list_value_t::is_owned"]
        [::std::mem::offset_of!(_cef_list_value_t, is_owned) - 24usize];
    ["Offset of field: _cef_list_value_t::is_read_only"]
        [::std::mem::offset_of!(_cef_list_value_t, is_read_only) - 28usize];
    ["Offset of field: _cef_list_value_t::is_same"]
        [::std::mem::offset_of!(_cef_list_value_t, is_same) - 32usize];
    ["Offset of field: _cef_list_value_t::is_equal"]
        [::std::mem::offset_of!(_cef_list_value_t, is_equal) - 36usize];
    ["Offset of field: _cef_list_value_t::copy"]
        [::std::mem::offset_of!(_cef_list_value_t, copy) - 40usize];
    ["Offset of field: _cef_list_value_t::set_size"]
        [::std::mem::offset_of!(_cef_list_value_t, set_size) - 44usize];
    ["Offset of field: _cef_list_value_t::get_size"]
        [::std::mem::offset_of!(_cef_list_value_t, get_size) - 48usize];
    ["Offset of field: _cef_list_value_t::clear"]
        [::std::mem::offset_of!(_cef_list_value_t, clear) - 52usize];
    ["Offset of field: _cef_list_value_t::remove"]
        [::std::mem::offset_of!(_cef_list_value_t, remove) - 56usize];
    ["Offset of field: _cef_list_value_t::get_type"]
        [::std::mem::offset_of!(_cef_list_value_t, get_type) - 60usize];
    ["Offset of field: _cef_list_value_t::get_value"]
        [::std::mem::offset_of!(_cef_list_value_t, get_value) - 64usize];
    ["Offset of field: _cef_list_value_t::get_bool"]
        [::std::mem::offset_of!(_cef_list_value_t, get_bool) - 68usize];
    ["Offset of field: _cef_list_value_t::get_int"]
        [::std::mem::offset_of!(_cef_list_value_t, get_int) - 72usize];
    ["Offset of field: _cef_list_value_t::get_double"]
        [::std::mem::offset_of!(_cef_list_value_t, get_double) - 76usize];
    ["Offset of field: _cef_list_value_t::get_string"]
        [::std::mem::offset_of!(_cef_list_value_t, get_string) - 80usize];
    ["Offset of field: _cef_list_value_t::get_binary"]
        [::std::mem::offset_of!(_cef_list_value_t, get_binary) - 84usize];
    ["Offset of field: _cef_list_value_t::get_dictionary"]
        [::std::mem::offset_of!(_cef_list_value_t, get_dictionary) - 88usize];
    ["Offset of field: _cef_list_value_t::get_list"]
        [::std::mem::offset_of!(_cef_list_value_t, get_list) - 92usize];
    ["Offset of field: _cef_list_value_t::set_value"]
        [::std::mem::offset_of!(_cef_list_value_t, set_value) - 96usize];
    ["Offset of field: _cef_list_value_t::set_null"]
        [::std::mem::offset_of!(_cef_list_value_t, set_null) - 100usize];
    ["Offset of field: _cef_list_value_t::set_bool"]
        [::std::mem::offset_of!(_cef_list_value_t, set_bool) - 104usize];
    ["Offset of field: _cef_list_value_t::set_int"]
        [::std::mem::offset_of!(_cef_list_value_t, set_int) - 108usize];
    ["Offset of field: _cef_list_value_t::set_double"]
        [::std::mem::offset_of!(_cef_list_value_t, set_double) - 112usize];
    ["Offset of field: _cef_list_value_t::set_string"]
        [::std::mem::offset_of!(_cef_list_value_t, set_string) - 116usize];
    ["Offset of field: _cef_list_value_t::set_binary"]
        [::std::mem::offset_of!(_cef_list_value_t, set_binary) - 120usize];
    ["Offset of field: _cef_list_value_t::set_dictionary"]
        [::std::mem::offset_of!(_cef_list_value_t, set_dictionary) - 124usize];
    ["Offset of field: _cef_list_value_t::set_list"]
        [::std::mem::offset_of!(_cef_list_value_t, set_list) - 128usize];
};
pub type cef_list_value_t = _cef_list_value_t;
unsafe extern "C" {
    pub fn cef_list_value_create() -> *mut cef_list_value_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_image_t {
    pub base: cef_base_ref_counted_t,
    pub is_empty: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_image_t) -> ::std::os::raw::c_int,
    >,
    pub is_same: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            that: *mut _cef_image_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub add_bitmap: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            pixel_width: ::std::os::raw::c_int,
            pixel_height: ::std::os::raw::c_int,
            color_type: cef_color_type_t::Type,
            alpha_type: cef_alpha_type_t::Type,
            pixel_data: *const ::std::os::raw::c_void,
            pixel_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub add_png: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            png_data: *const ::std::os::raw::c_void,
            png_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub add_jpeg: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            jpeg_data: *const ::std::os::raw::c_void,
            jpeg_data_size: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_width:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_image_t) -> usize>,
    pub get_height:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_image_t) -> usize>,
    pub has_representation: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
        ) -> ::std::os::raw::c_int,
    >,
    pub remove_representation: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_representation_info: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            actual_scale_factor: *mut f32,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_as_bitmap: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            color_type: cef_color_type_t::Type,
            alpha_type: cef_alpha_type_t::Type,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
    pub get_as_png: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            with_transparency: ::std::os::raw::c_int,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
    pub get_as_jpeg: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_image_t,
            scale_factor: f32,
            quality: ::std::os::raw::c_int,
            pixel_width: *mut ::std::os::raw::c_int,
            pixel_height: *mut ::std::os::raw::c_int,
        ) -> *mut _cef_binary_value_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_image_t"][::std::mem::size_of::<_cef_image_t>() - 72usize];
    ["Alignment of _cef_image_t"][::std::mem::align_of::<_cef_image_t>() - 4usize];
    ["Offset of field: _cef_image_t::base"][::std::mem::offset_of!(_cef_image_t, base) - 0usize];
    ["Offset of field: _cef_image_t::is_empty"]
        [::std::mem::offset_of!(_cef_image_t, is_empty) - 20usize];
    ["Offset of field: _cef_image_t::is_same"]
        [::std::mem::offset_of!(_cef_image_t, is_same) - 24usize];
    ["Offset of field: _cef_image_t::add_bitmap"]
        [::std::mem::offset_of!(_cef_image_t, add_bitmap) - 28usize];
    ["Offset of field: _cef_image_t::add_png"]
        [::std::mem::offset_of!(_cef_image_t, add_png) - 32usize];
    ["Offset of field: _cef_image_t::add_jpeg"]
        [::std::mem::offset_of!(_cef_image_t, add_jpeg) - 36usize];
    ["Offset of field: _cef_image_t::get_width"]
        [::std::mem::offset_of!(_cef_image_t, get_width) - 40usize];
    ["Offset of field: _cef_image_t::get_height"]
        [::std::mem::offset_of!(_cef_image_t, get_height) - 44usize];
    ["Offset of field: _cef_image_t::has_representation"]
        [::std::mem::offset_of!(_cef_image_t, has_representation) - 48usize];
    ["Offset of field: _cef_image_t::remove_representation"]
        [::std::mem::offset_of!(_cef_image_t, remove_representation) - 52usize];
    ["Offset of field: _cef_image_t::get_representation_info"]
        [::std::mem::offset_of!(_cef_image_t, get_representation_info) - 56usize];
    ["Offset of field: _cef_image_t::get_as_bitmap"]
        [::std::mem::offset_of!(_cef_image_t, get_as_bitmap) - 60usize];
    ["Offset of field: _cef_image_t::get_as_png"]
        [::std::mem::offset_of!(_cef_image_t, get_as_png) - 64usize];
    ["Offset of field: _cef_image_t::get_as_jpeg"]
        [::std::mem::offset_of!(_cef_image_t, get_as_jpeg) - 68usize];
};
pub type cef_image_t = _cef_image_t;
unsafe extern "C" {
    pub fn cef_image_create() -> *mut cef_image_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_read_handler_t {
    pub base: cef_base_ref_counted_t,
    pub read: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_read_handler_t,
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    pub seek: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_read_handler_t,
            offset: i64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tell:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_read_handler_t) -> i64>,
    pub eof: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_read_handler_t) -> ::std::os::raw::c_int,
    >,
    pub may_block: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_read_handler_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_read_handler_t"][::std::mem::size_of::<_cef_read_handler_t>() - 40usize];
    ["Alignment of _cef_read_handler_t"][::std::mem::align_of::<_cef_read_handler_t>() - 4usize];
    ["Offset of field: _cef_read_handler_t::base"]
        [::std::mem::offset_of!(_cef_read_handler_t, base) - 0usize];
    ["Offset of field: _cef_read_handler_t::read"]
        [::std::mem::offset_of!(_cef_read_handler_t, read) - 20usize];
    ["Offset of field: _cef_read_handler_t::seek"]
        [::std::mem::offset_of!(_cef_read_handler_t, seek) - 24usize];
    ["Offset of field: _cef_read_handler_t::tell"]
        [::std::mem::offset_of!(_cef_read_handler_t, tell) - 28usize];
    ["Offset of field: _cef_read_handler_t::eof"]
        [::std::mem::offset_of!(_cef_read_handler_t, eof) - 32usize];
    ["Offset of field: _cef_read_handler_t::may_block"]
        [::std::mem::offset_of!(_cef_read_handler_t, may_block) - 36usize];
};
pub type cef_read_handler_t = _cef_read_handler_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_stream_reader_t {
    pub base: cef_base_ref_counted_t,
    pub read: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_stream_reader_t,
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    pub seek: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_stream_reader_t,
            offset: i64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tell:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_stream_reader_t) -> i64>,
    pub eof: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_stream_reader_t) -> ::std::os::raw::c_int,
    >,
    pub may_block: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_stream_reader_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_stream_reader_t"][::std::mem::size_of::<_cef_stream_reader_t>() - 40usize];
    ["Alignment of _cef_stream_reader_t"][::std::mem::align_of::<_cef_stream_reader_t>() - 4usize];
    ["Offset of field: _cef_stream_reader_t::base"]
        [::std::mem::offset_of!(_cef_stream_reader_t, base) - 0usize];
    ["Offset of field: _cef_stream_reader_t::read"]
        [::std::mem::offset_of!(_cef_stream_reader_t, read) - 20usize];
    ["Offset of field: _cef_stream_reader_t::seek"]
        [::std::mem::offset_of!(_cef_stream_reader_t, seek) - 24usize];
    ["Offset of field: _cef_stream_reader_t::tell"]
        [::std::mem::offset_of!(_cef_stream_reader_t, tell) - 28usize];
    ["Offset of field: _cef_stream_reader_t::eof"]
        [::std::mem::offset_of!(_cef_stream_reader_t, eof) - 32usize];
    ["Offset of field: _cef_stream_reader_t::may_block"]
        [::std::mem::offset_of!(_cef_stream_reader_t, may_block) - 36usize];
};
pub type cef_stream_reader_t = _cef_stream_reader_t;
unsafe extern "C" {
    pub fn cef_stream_reader_create_for_file(
        fileName: *const cef_string_t,
    ) -> *mut cef_stream_reader_t;
}
unsafe extern "C" {
    pub fn cef_stream_reader_create_for_data(
        data: *mut ::std::os::raw::c_void, size: usize,
    ) -> *mut cef_stream_reader_t;
}
unsafe extern "C" {
    pub fn cef_stream_reader_create_for_handler(
        handler: *mut cef_read_handler_t,
    ) -> *mut cef_stream_reader_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_write_handler_t {
    pub base: cef_base_ref_counted_t,
    pub write: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_write_handler_t,
            ptr: *const ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    pub seek: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_write_handler_t,
            offset: i64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tell:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_write_handler_t) -> i64>,
    pub flush: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_write_handler_t) -> ::std::os::raw::c_int,
    >,
    pub may_block: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_write_handler_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_write_handler_t"][::std::mem::size_of::<_cef_write_handler_t>() - 40usize];
    ["Alignment of _cef_write_handler_t"][::std::mem::align_of::<_cef_write_handler_t>() - 4usize];
    ["Offset of field: _cef_write_handler_t::base"]
        [::std::mem::offset_of!(_cef_write_handler_t, base) - 0usize];
    ["Offset of field: _cef_write_handler_t::write"]
        [::std::mem::offset_of!(_cef_write_handler_t, write) - 20usize];
    ["Offset of field: _cef_write_handler_t::seek"]
        [::std::mem::offset_of!(_cef_write_handler_t, seek) - 24usize];
    ["Offset of field: _cef_write_handler_t::tell"]
        [::std::mem::offset_of!(_cef_write_handler_t, tell) - 28usize];
    ["Offset of field: _cef_write_handler_t::flush"]
        [::std::mem::offset_of!(_cef_write_handler_t, flush) - 32usize];
    ["Offset of field: _cef_write_handler_t::may_block"]
        [::std::mem::offset_of!(_cef_write_handler_t, may_block) - 36usize];
};
pub type cef_write_handler_t = _cef_write_handler_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_stream_writer_t {
    pub base: cef_base_ref_counted_t,
    pub write: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_stream_writer_t,
            ptr: *const ::std::os::raw::c_void,
            size: usize,
            n: usize,
        ) -> usize,
    >,
    pub seek: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_stream_writer_t,
            offset: i64,
            whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub tell:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_stream_writer_t) -> i64>,
    pub flush: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_stream_writer_t) -> ::std::os::raw::c_int,
    >,
    pub may_block: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_stream_writer_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_stream_writer_t"][::std::mem::size_of::<_cef_stream_writer_t>() - 40usize];
    ["Alignment of _cef_stream_writer_t"][::std::mem::align_of::<_cef_stream_writer_t>() - 4usize];
    ["Offset of field: _cef_stream_writer_t::base"]
        [::std::mem::offset_of!(_cef_stream_writer_t, base) - 0usize];
    ["Offset of field: _cef_stream_writer_t::write"]
        [::std::mem::offset_of!(_cef_stream_writer_t, write) - 20usize];
    ["Offset of field: _cef_stream_writer_t::seek"]
        [::std::mem::offset_of!(_cef_stream_writer_t, seek) - 24usize];
    ["Offset of field: _cef_stream_writer_t::tell"]
        [::std::mem::offset_of!(_cef_stream_writer_t, tell) - 28usize];
    ["Offset of field: _cef_stream_writer_t::flush"]
        [::std::mem::offset_of!(_cef_stream_writer_t, flush) - 32usize];
    ["Offset of field: _cef_stream_writer_t::may_block"]
        [::std::mem::offset_of!(_cef_stream_writer_t, may_block) - 36usize];
};
pub type cef_stream_writer_t = _cef_stream_writer_t;
unsafe extern "C" {
    pub fn cef_stream_writer_create_for_file(
        fileName: *const cef_string_t,
    ) -> *mut cef_stream_writer_t;
}
unsafe extern "C" {
    pub fn cef_stream_writer_create_for_handler(
        handler: *mut cef_write_handler_t,
    ) -> *mut cef_stream_writer_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_drag_data_t {
    pub base: cef_base_ref_counted_t,
    pub clone: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> *mut _cef_drag_data_t,
    >,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    pub is_link: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    pub is_fragment: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    pub is_file: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
    pub get_link_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    pub get_link_title: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    pub get_link_metadata: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    pub get_fragment_text: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    pub get_fragment_html: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    pub get_fragment_base_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    pub get_file_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_string_userfree_t,
    >,
    pub get_file_contents: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_drag_data_t,
            writer: *mut _cef_stream_writer_t,
        ) -> usize,
    >,
    pub get_file_names: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_drag_data_t,
            names: cef_string_list_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_file_paths: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_drag_data_t,
            paths: cef_string_list_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_link_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t, url: *const cef_string_t),
    >,
    pub set_link_title: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t, title: *const cef_string_t),
    >,
    pub set_link_metadata: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t, data: *const cef_string_t),
    >,
    pub set_fragment_text: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t, text: *const cef_string_t),
    >,
    pub set_fragment_html: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t, html: *const cef_string_t),
    >,
    pub set_fragment_base_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t, base_url: *const cef_string_t),
    >,
    pub reset_file_contents:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_drag_data_t)>,
    pub add_file: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_drag_data_t,
            path: *const cef_string_t,
            display_name: *const cef_string_t,
        ),
    >,
    pub clear_filenames:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_drag_data_t)>,
    pub get_image: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> *mut _cef_image_t,
    >,
    pub get_image_hotspot: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> cef_point_t,
    >,
    pub has_image: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_drag_data_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_drag_data_t"][::std::mem::size_of::<_cef_drag_data_t>() - 128usize];
    ["Alignment of _cef_drag_data_t"][::std::mem::align_of::<_cef_drag_data_t>() - 4usize];
    ["Offset of field: _cef_drag_data_t::base"]
        [::std::mem::offset_of!(_cef_drag_data_t, base) - 0usize];
    ["Offset of field: _cef_drag_data_t::clone"]
        [::std::mem::offset_of!(_cef_drag_data_t, clone) - 20usize];
    ["Offset of field: _cef_drag_data_t::is_read_only"]
        [::std::mem::offset_of!(_cef_drag_data_t, is_read_only) - 24usize];
    ["Offset of field: _cef_drag_data_t::is_link"]
        [::std::mem::offset_of!(_cef_drag_data_t, is_link) - 28usize];
    ["Offset of field: _cef_drag_data_t::is_fragment"]
        [::std::mem::offset_of!(_cef_drag_data_t, is_fragment) - 32usize];
    ["Offset of field: _cef_drag_data_t::is_file"]
        [::std::mem::offset_of!(_cef_drag_data_t, is_file) - 36usize];
    ["Offset of field: _cef_drag_data_t::get_link_url"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_link_url) - 40usize];
    ["Offset of field: _cef_drag_data_t::get_link_title"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_link_title) - 44usize];
    ["Offset of field: _cef_drag_data_t::get_link_metadata"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_link_metadata) - 48usize];
    ["Offset of field: _cef_drag_data_t::get_fragment_text"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_fragment_text) - 52usize];
    ["Offset of field: _cef_drag_data_t::get_fragment_html"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_fragment_html) - 56usize];
    ["Offset of field: _cef_drag_data_t::get_fragment_base_url"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_fragment_base_url) - 60usize];
    ["Offset of field: _cef_drag_data_t::get_file_name"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_file_name) - 64usize];
    ["Offset of field: _cef_drag_data_t::get_file_contents"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_file_contents) - 68usize];
    ["Offset of field: _cef_drag_data_t::get_file_names"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_file_names) - 72usize];
    ["Offset of field: _cef_drag_data_t::get_file_paths"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_file_paths) - 76usize];
    ["Offset of field: _cef_drag_data_t::set_link_url"]
        [::std::mem::offset_of!(_cef_drag_data_t, set_link_url) - 80usize];
    ["Offset of field: _cef_drag_data_t::set_link_title"]
        [::std::mem::offset_of!(_cef_drag_data_t, set_link_title) - 84usize];
    ["Offset of field: _cef_drag_data_t::set_link_metadata"]
        [::std::mem::offset_of!(_cef_drag_data_t, set_link_metadata) - 88usize];
    ["Offset of field: _cef_drag_data_t::set_fragment_text"]
        [::std::mem::offset_of!(_cef_drag_data_t, set_fragment_text) - 92usize];
    ["Offset of field: _cef_drag_data_t::set_fragment_html"]
        [::std::mem::offset_of!(_cef_drag_data_t, set_fragment_html) - 96usize];
    ["Offset of field: _cef_drag_data_t::set_fragment_base_url"]
        [::std::mem::offset_of!(_cef_drag_data_t, set_fragment_base_url) - 100usize];
    ["Offset of field: _cef_drag_data_t::reset_file_contents"]
        [::std::mem::offset_of!(_cef_drag_data_t, reset_file_contents) - 104usize];
    ["Offset of field: _cef_drag_data_t::add_file"]
        [::std::mem::offset_of!(_cef_drag_data_t, add_file) - 108usize];
    ["Offset of field: _cef_drag_data_t::clear_filenames"]
        [::std::mem::offset_of!(_cef_drag_data_t, clear_filenames) - 112usize];
    ["Offset of field: _cef_drag_data_t::get_image"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_image) - 116usize];
    ["Offset of field: _cef_drag_data_t::get_image_hotspot"]
        [::std::mem::offset_of!(_cef_drag_data_t, get_image_hotspot) - 120usize];
    ["Offset of field: _cef_drag_data_t::has_image"]
        [::std::mem::offset_of!(_cef_drag_data_t, has_image) - 124usize];
};
pub type cef_drag_data_t = _cef_drag_data_t;
unsafe extern "C" {
    pub fn cef_drag_data_create() -> *mut cef_drag_data_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_domvisitor_t {
    pub base: cef_base_ref_counted_t,
    pub visit: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domvisitor_t,
            document: *mut _cef_domdocument_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_domvisitor_t"][::std::mem::size_of::<_cef_domvisitor_t>() - 24usize];
    ["Alignment of _cef_domvisitor_t"][::std::mem::align_of::<_cef_domvisitor_t>() - 4usize];
    ["Offset of field: _cef_domvisitor_t::base"]
        [::std::mem::offset_of!(_cef_domvisitor_t, base) - 0usize];
    ["Offset of field: _cef_domvisitor_t::visit"]
        [::std::mem::offset_of!(_cef_domvisitor_t, visit) - 20usize];
};
pub type cef_domvisitor_t = _cef_domvisitor_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_domdocument_t {
    pub base: cef_base_ref_counted_t,
    pub get_type: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> cef_dom_document_type_t::Type,
    >,
    pub get_document: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    pub get_body: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    pub get_head: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    pub get_title: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    pub get_element_by_id: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domdocument_t,
            id: *const cef_string_t,
        ) -> *mut _cef_domnode_t,
    >,
    pub get_focused_node: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> *mut _cef_domnode_t,
    >,
    pub has_selection: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> ::std::os::raw::c_int,
    >,
    pub get_selection_start_offset: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> ::std::os::raw::c_int,
    >,
    pub get_selection_end_offset: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> ::std::os::raw::c_int,
    >,
    pub get_selection_as_markup: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    pub get_selection_as_text: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    pub get_base_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domdocument_t) -> cef_string_userfree_t,
    >,
    pub get_complete_url: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domdocument_t,
            partialURL: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_domdocument_t"][::std::mem::size_of::<_cef_domdocument_t>() - 76usize];
    ["Alignment of _cef_domdocument_t"][::std::mem::align_of::<_cef_domdocument_t>() - 4usize];
    ["Offset of field: _cef_domdocument_t::base"]
        [::std::mem::offset_of!(_cef_domdocument_t, base) - 0usize];
    ["Offset of field: _cef_domdocument_t::get_type"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_type) - 20usize];
    ["Offset of field: _cef_domdocument_t::get_document"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_document) - 24usize];
    ["Offset of field: _cef_domdocument_t::get_body"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_body) - 28usize];
    ["Offset of field: _cef_domdocument_t::get_head"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_head) - 32usize];
    ["Offset of field: _cef_domdocument_t::get_title"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_title) - 36usize];
    ["Offset of field: _cef_domdocument_t::get_element_by_id"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_element_by_id) - 40usize];
    ["Offset of field: _cef_domdocument_t::get_focused_node"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_focused_node) - 44usize];
    ["Offset of field: _cef_domdocument_t::has_selection"]
        [::std::mem::offset_of!(_cef_domdocument_t, has_selection) - 48usize];
    ["Offset of field: _cef_domdocument_t::get_selection_start_offset"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_selection_start_offset) - 52usize];
    ["Offset of field: _cef_domdocument_t::get_selection_end_offset"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_selection_end_offset) - 56usize];
    ["Offset of field: _cef_domdocument_t::get_selection_as_markup"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_selection_as_markup) - 60usize];
    ["Offset of field: _cef_domdocument_t::get_selection_as_text"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_selection_as_text) - 64usize];
    ["Offset of field: _cef_domdocument_t::get_base_url"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_base_url) - 68usize];
    ["Offset of field: _cef_domdocument_t::get_complete_url"]
        [::std::mem::offset_of!(_cef_domdocument_t, get_complete_url) - 72usize];
};
pub type cef_domdocument_t = _cef_domdocument_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_domnode_t {
    pub base: cef_base_ref_counted_t,
    pub get_type: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_dom_node_type_t::Type,
    >,
    pub is_text: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    pub is_element: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    pub is_editable: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    pub is_form_control_element: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    pub get_form_control_element_type: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_dom_form_control_type_t::Type,
    >,
    pub is_same: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domnode_t,
            that: *mut _cef_domnode_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    pub get_value: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    pub set_value: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domnode_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_as_markup: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    pub get_document: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domdocument_t,
    >,
    pub get_parent: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    pub get_previous_sibling: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    pub get_next_sibling: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    pub has_children: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    pub get_first_child: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    pub get_last_child: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> *mut _cef_domnode_t,
    >,
    pub get_element_tag_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    pub has_element_attributes: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> ::std::os::raw::c_int,
    >,
    pub has_element_attribute: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domnode_t,
            attrName: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_element_attribute: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domnode_t,
            attrName: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
    pub get_element_attributes: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t, attrMap: cef_string_map_t),
    >,
    pub set_element_attribute: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_domnode_t,
            attrName: *const cef_string_t,
            value: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_element_inner_text: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_string_userfree_t,
    >,
    pub get_element_bounds:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_domnode_t) -> cef_rect_t>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_domnode_t"][::std::mem::size_of::<_cef_domnode_t>() - 124usize];
    ["Alignment of _cef_domnode_t"][::std::mem::align_of::<_cef_domnode_t>() - 4usize];
    ["Offset of field: _cef_domnode_t::base"]
        [::std::mem::offset_of!(_cef_domnode_t, base) - 0usize];
    ["Offset of field: _cef_domnode_t::get_type"]
        [::std::mem::offset_of!(_cef_domnode_t, get_type) - 20usize];
    ["Offset of field: _cef_domnode_t::is_text"]
        [::std::mem::offset_of!(_cef_domnode_t, is_text) - 24usize];
    ["Offset of field: _cef_domnode_t::is_element"]
        [::std::mem::offset_of!(_cef_domnode_t, is_element) - 28usize];
    ["Offset of field: _cef_domnode_t::is_editable"]
        [::std::mem::offset_of!(_cef_domnode_t, is_editable) - 32usize];
    ["Offset of field: _cef_domnode_t::is_form_control_element"]
        [::std::mem::offset_of!(_cef_domnode_t, is_form_control_element) - 36usize];
    ["Offset of field: _cef_domnode_t::get_form_control_element_type"]
        [::std::mem::offset_of!(_cef_domnode_t, get_form_control_element_type) - 40usize];
    ["Offset of field: _cef_domnode_t::is_same"]
        [::std::mem::offset_of!(_cef_domnode_t, is_same) - 44usize];
    ["Offset of field: _cef_domnode_t::get_name"]
        [::std::mem::offset_of!(_cef_domnode_t, get_name) - 48usize];
    ["Offset of field: _cef_domnode_t::get_value"]
        [::std::mem::offset_of!(_cef_domnode_t, get_value) - 52usize];
    ["Offset of field: _cef_domnode_t::set_value"]
        [::std::mem::offset_of!(_cef_domnode_t, set_value) - 56usize];
    ["Offset of field: _cef_domnode_t::get_as_markup"]
        [::std::mem::offset_of!(_cef_domnode_t, get_as_markup) - 60usize];
    ["Offset of field: _cef_domnode_t::get_document"]
        [::std::mem::offset_of!(_cef_domnode_t, get_document) - 64usize];
    ["Offset of field: _cef_domnode_t::get_parent"]
        [::std::mem::offset_of!(_cef_domnode_t, get_parent) - 68usize];
    ["Offset of field: _cef_domnode_t::get_previous_sibling"]
        [::std::mem::offset_of!(_cef_domnode_t, get_previous_sibling) - 72usize];
    ["Offset of field: _cef_domnode_t::get_next_sibling"]
        [::std::mem::offset_of!(_cef_domnode_t, get_next_sibling) - 76usize];
    ["Offset of field: _cef_domnode_t::has_children"]
        [::std::mem::offset_of!(_cef_domnode_t, has_children) - 80usize];
    ["Offset of field: _cef_domnode_t::get_first_child"]
        [::std::mem::offset_of!(_cef_domnode_t, get_first_child) - 84usize];
    ["Offset of field: _cef_domnode_t::get_last_child"]
        [::std::mem::offset_of!(_cef_domnode_t, get_last_child) - 88usize];
    ["Offset of field: _cef_domnode_t::get_element_tag_name"]
        [::std::mem::offset_of!(_cef_domnode_t, get_element_tag_name) - 92usize];
    ["Offset of field: _cef_domnode_t::has_element_attributes"]
        [::std::mem::offset_of!(_cef_domnode_t, has_element_attributes) - 96usize];
    ["Offset of field: _cef_domnode_t::has_element_attribute"]
        [::std::mem::offset_of!(_cef_domnode_t, has_element_attribute) - 100usize];
    ["Offset of field: _cef_domnode_t::get_element_attribute"]
        [::std::mem::offset_of!(_cef_domnode_t, get_element_attribute) - 104usize];
    ["Offset of field: _cef_domnode_t::get_element_attributes"]
        [::std::mem::offset_of!(_cef_domnode_t, get_element_attributes) - 108usize];
    ["Offset of field: _cef_domnode_t::set_element_attribute"]
        [::std::mem::offset_of!(_cef_domnode_t, set_element_attribute) - 112usize];
    ["Offset of field: _cef_domnode_t::get_element_inner_text"]
        [::std::mem::offset_of!(_cef_domnode_t, get_element_inner_text) - 116usize];
    ["Offset of field: _cef_domnode_t::get_element_bounds"]
        [::std::mem::offset_of!(_cef_domnode_t, get_element_bounds) - 120usize];
};
pub type cef_domnode_t = _cef_domnode_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_shared_memory_region_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_shared_memory_region_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub size: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_shared_memory_region_t) -> usize,
    >,
    pub memory: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_shared_memory_region_t,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_shared_memory_region_t"]
        [::std::mem::size_of::<_cef_shared_memory_region_t>() - 32usize];
    ["Alignment of _cef_shared_memory_region_t"]
        [::std::mem::align_of::<_cef_shared_memory_region_t>() - 4usize];
    ["Offset of field: _cef_shared_memory_region_t::base"]
        [::std::mem::offset_of!(_cef_shared_memory_region_t, base) - 0usize];
    ["Offset of field: _cef_shared_memory_region_t::is_valid"]
        [::std::mem::offset_of!(_cef_shared_memory_region_t, is_valid) - 20usize];
    ["Offset of field: _cef_shared_memory_region_t::size"]
        [::std::mem::offset_of!(_cef_shared_memory_region_t, size) - 24usize];
    ["Offset of field: _cef_shared_memory_region_t::memory"]
        [::std::mem::offset_of!(_cef_shared_memory_region_t, memory) - 28usize];
};
pub type cef_shared_memory_region_t = _cef_shared_memory_region_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_process_message_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_process_message_t) -> ::std::os::raw::c_int,
    >,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_process_message_t) -> ::std::os::raw::c_int,
    >,
    pub copy: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_process_message_t,
        ) -> *mut _cef_process_message_t,
    >,
    pub get_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_process_message_t) -> cef_string_userfree_t,
    >,
    pub get_argument_list: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_process_message_t) -> *mut _cef_list_value_t,
    >,
    pub get_shared_memory_region: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_process_message_t,
        ) -> *mut _cef_shared_memory_region_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_process_message_t"][::std::mem::size_of::<_cef_process_message_t>() - 44usize];
    ["Alignment of _cef_process_message_t"]
        [::std::mem::align_of::<_cef_process_message_t>() - 4usize];
    ["Offset of field: _cef_process_message_t::base"]
        [::std::mem::offset_of!(_cef_process_message_t, base) - 0usize];
    ["Offset of field: _cef_process_message_t::is_valid"]
        [::std::mem::offset_of!(_cef_process_message_t, is_valid) - 20usize];
    ["Offset of field: _cef_process_message_t::is_read_only"]
        [::std::mem::offset_of!(_cef_process_message_t, is_read_only) - 24usize];
    ["Offset of field: _cef_process_message_t::copy"]
        [::std::mem::offset_of!(_cef_process_message_t, copy) - 28usize];
    ["Offset of field: _cef_process_message_t::get_name"]
        [::std::mem::offset_of!(_cef_process_message_t, get_name) - 32usize];
    ["Offset of field: _cef_process_message_t::get_argument_list"]
        [::std::mem::offset_of!(_cef_process_message_t, get_argument_list) - 36usize];
    ["Offset of field: _cef_process_message_t::get_shared_memory_region"]
        [::std::mem::offset_of!(_cef_process_message_t, get_shared_memory_region) - 40usize];
};
pub type cef_process_message_t = _cef_process_message_t;
unsafe extern "C" {
    pub fn cef_process_message_create(name: *const cef_string_t) -> *mut cef_process_message_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_request_t {
    pub base: cef_base_ref_counted_t,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> ::std::os::raw::c_int,
    >,
    pub get_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    pub set_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t, url: *const cef_string_t),
    >,
    pub get_method: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    pub set_method: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t, method: *const cef_string_t),
    >,
    pub set_referrer: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_t,
            referrer_url: *const cef_string_t,
            policy: cef_referrer_policy_t::Type,
        ),
    >,
    pub get_referrer_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    pub get_referrer_policy: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> cef_referrer_policy_t::Type,
    >,
    pub get_post_data: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> *mut _cef_post_data_t,
    >,
    pub set_post_data: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t, postData: *mut _cef_post_data_t),
    >,
    pub get_header_map: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t, headerMap: cef_string_multimap_t),
    >,
    pub set_header_map: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t, headerMap: cef_string_multimap_t),
    >,
    pub get_header_by_name: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_t,
            name: *const cef_string_t,
        ) -> cef_string_userfree_t,
    >,
    pub set_header_by_name: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_t,
            name: *const cef_string_t,
            value: *const cef_string_t,
            overwrite: ::std::os::raw::c_int,
        ),
    >,
    pub set: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_t,
            url: *const cef_string_t,
            method: *const cef_string_t,
            postData: *mut _cef_post_data_t,
            headerMap: cef_string_multimap_t,
        ),
    >,
    pub get_flags: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> ::std::os::raw::c_int,
    >,
    pub set_flags: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t, flags: ::std::os::raw::c_int),
    >,
    pub get_first_party_for_cookies: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> cef_string_userfree_t,
    >,
    pub set_first_party_for_cookies: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t, url: *const cef_string_t),
    >,
    pub get_resource_type: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> cef_resource_type_t::Type,
    >,
    pub get_transition_type: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_t) -> cef_transition_type_t::Type,
    >,
    pub get_identifier:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_request_t) -> u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_request_t"][::std::mem::size_of::<_cef_request_t>() - 108usize];
    ["Alignment of _cef_request_t"][::std::mem::align_of::<_cef_request_t>() - 4usize];
    ["Offset of field: _cef_request_t::base"]
        [::std::mem::offset_of!(_cef_request_t, base) - 0usize];
    ["Offset of field: _cef_request_t::is_read_only"]
        [::std::mem::offset_of!(_cef_request_t, is_read_only) - 20usize];
    ["Offset of field: _cef_request_t::get_url"]
        [::std::mem::offset_of!(_cef_request_t, get_url) - 24usize];
    ["Offset of field: _cef_request_t::set_url"]
        [::std::mem::offset_of!(_cef_request_t, set_url) - 28usize];
    ["Offset of field: _cef_request_t::get_method"]
        [::std::mem::offset_of!(_cef_request_t, get_method) - 32usize];
    ["Offset of field: _cef_request_t::set_method"]
        [::std::mem::offset_of!(_cef_request_t, set_method) - 36usize];
    ["Offset of field: _cef_request_t::set_referrer"]
        [::std::mem::offset_of!(_cef_request_t, set_referrer) - 40usize];
    ["Offset of field: _cef_request_t::get_referrer_url"]
        [::std::mem::offset_of!(_cef_request_t, get_referrer_url) - 44usize];
    ["Offset of field: _cef_request_t::get_referrer_policy"]
        [::std::mem::offset_of!(_cef_request_t, get_referrer_policy) - 48usize];
    ["Offset of field: _cef_request_t::get_post_data"]
        [::std::mem::offset_of!(_cef_request_t, get_post_data) - 52usize];
    ["Offset of field: _cef_request_t::set_post_data"]
        [::std::mem::offset_of!(_cef_request_t, set_post_data) - 56usize];
    ["Offset of field: _cef_request_t::get_header_map"]
        [::std::mem::offset_of!(_cef_request_t, get_header_map) - 60usize];
    ["Offset of field: _cef_request_t::set_header_map"]
        [::std::mem::offset_of!(_cef_request_t, set_header_map) - 64usize];
    ["Offset of field: _cef_request_t::get_header_by_name"]
        [::std::mem::offset_of!(_cef_request_t, get_header_by_name) - 68usize];
    ["Offset of field: _cef_request_t::set_header_by_name"]
        [::std::mem::offset_of!(_cef_request_t, set_header_by_name) - 72usize];
    ["Offset of field: _cef_request_t::set"][::std::mem::offset_of!(_cef_request_t, set) - 76usize];
    ["Offset of field: _cef_request_t::get_flags"]
        [::std::mem::offset_of!(_cef_request_t, get_flags) - 80usize];
    ["Offset of field: _cef_request_t::set_flags"]
        [::std::mem::offset_of!(_cef_request_t, set_flags) - 84usize];
    ["Offset of field: _cef_request_t::get_first_party_for_cookies"]
        [::std::mem::offset_of!(_cef_request_t, get_first_party_for_cookies) - 88usize];
    ["Offset of field: _cef_request_t::set_first_party_for_cookies"]
        [::std::mem::offset_of!(_cef_request_t, set_first_party_for_cookies) - 92usize];
    ["Offset of field: _cef_request_t::get_resource_type"]
        [::std::mem::offset_of!(_cef_request_t, get_resource_type) - 96usize];
    ["Offset of field: _cef_request_t::get_transition_type"]
        [::std::mem::offset_of!(_cef_request_t, get_transition_type) - 100usize];
    ["Offset of field: _cef_request_t::get_identifier"]
        [::std::mem::offset_of!(_cef_request_t, get_identifier) - 104usize];
};
pub type cef_request_t = _cef_request_t;
unsafe extern "C" {
    pub fn cef_request_create() -> *mut cef_request_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_post_data_t {
    pub base: cef_base_ref_counted_t,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_post_data_t) -> ::std::os::raw::c_int,
    >,
    pub has_excluded_elements: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_post_data_t) -> ::std::os::raw::c_int,
    >,
    pub get_element_count:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_post_data_t) -> usize>,
    pub get_elements: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_post_data_t,
            elementsCount: *mut usize,
            elements: *mut *mut _cef_post_data_element_t,
        ),
    >,
    pub remove_element: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_post_data_t,
            element: *mut _cef_post_data_element_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub add_element: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_post_data_t,
            element: *mut _cef_post_data_element_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub remove_elements:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_post_data_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_post_data_t"][::std::mem::size_of::<_cef_post_data_t>() - 48usize];
    ["Alignment of _cef_post_data_t"][::std::mem::align_of::<_cef_post_data_t>() - 4usize];
    ["Offset of field: _cef_post_data_t::base"]
        [::std::mem::offset_of!(_cef_post_data_t, base) - 0usize];
    ["Offset of field: _cef_post_data_t::is_read_only"]
        [::std::mem::offset_of!(_cef_post_data_t, is_read_only) - 20usize];
    ["Offset of field: _cef_post_data_t::has_excluded_elements"]
        [::std::mem::offset_of!(_cef_post_data_t, has_excluded_elements) - 24usize];
    ["Offset of field: _cef_post_data_t::get_element_count"]
        [::std::mem::offset_of!(_cef_post_data_t, get_element_count) - 28usize];
    ["Offset of field: _cef_post_data_t::get_elements"]
        [::std::mem::offset_of!(_cef_post_data_t, get_elements) - 32usize];
    ["Offset of field: _cef_post_data_t::remove_element"]
        [::std::mem::offset_of!(_cef_post_data_t, remove_element) - 36usize];
    ["Offset of field: _cef_post_data_t::add_element"]
        [::std::mem::offset_of!(_cef_post_data_t, add_element) - 40usize];
    ["Offset of field: _cef_post_data_t::remove_elements"]
        [::std::mem::offset_of!(_cef_post_data_t, remove_elements) - 44usize];
};
pub type cef_post_data_t = _cef_post_data_t;
unsafe extern "C" {
    pub fn cef_post_data_create() -> *mut cef_post_data_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_post_data_element_t {
    pub base: cef_base_ref_counted_t,
    pub is_read_only: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_post_data_element_t) -> ::std::os::raw::c_int,
    >,
    pub set_to_empty:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_post_data_element_t)>,
    pub set_to_file: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_post_data_element_t,
            fileName: *const cef_string_t,
        ),
    >,
    pub set_to_bytes: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_post_data_element_t,
            size: usize,
            bytes: *const ::std::os::raw::c_void,
        ),
    >,
    pub get_type: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_post_data_element_t,
        ) -> cef_postdataelement_type_t::Type,
    >,
    pub get_file: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_post_data_element_t) -> cef_string_userfree_t,
    >,
    pub get_bytes_count: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_post_data_element_t) -> usize,
    >,
    pub get_bytes: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_post_data_element_t,
            size: usize,
            bytes: *mut ::std::os::raw::c_void,
        ) -> usize,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_post_data_element_t"]
        [::std::mem::size_of::<_cef_post_data_element_t>() - 52usize];
    ["Alignment of _cef_post_data_element_t"]
        [::std::mem::align_of::<_cef_post_data_element_t>() - 4usize];
    ["Offset of field: _cef_post_data_element_t::base"]
        [::std::mem::offset_of!(_cef_post_data_element_t, base) - 0usize];
    ["Offset of field: _cef_post_data_element_t::is_read_only"]
        [::std::mem::offset_of!(_cef_post_data_element_t, is_read_only) - 20usize];
    ["Offset of field: _cef_post_data_element_t::set_to_empty"]
        [::std::mem::offset_of!(_cef_post_data_element_t, set_to_empty) - 24usize];
    ["Offset of field: _cef_post_data_element_t::set_to_file"]
        [::std::mem::offset_of!(_cef_post_data_element_t, set_to_file) - 28usize];
    ["Offset of field: _cef_post_data_element_t::set_to_bytes"]
        [::std::mem::offset_of!(_cef_post_data_element_t, set_to_bytes) - 32usize];
    ["Offset of field: _cef_post_data_element_t::get_type"]
        [::std::mem::offset_of!(_cef_post_data_element_t, get_type) - 36usize];
    ["Offset of field: _cef_post_data_element_t::get_file"]
        [::std::mem::offset_of!(_cef_post_data_element_t, get_file) - 40usize];
    ["Offset of field: _cef_post_data_element_t::get_bytes_count"]
        [::std::mem::offset_of!(_cef_post_data_element_t, get_bytes_count) - 44usize];
    ["Offset of field: _cef_post_data_element_t::get_bytes"]
        [::std::mem::offset_of!(_cef_post_data_element_t, get_bytes) - 48usize];
};
pub type cef_post_data_element_t = _cef_post_data_element_t;
unsafe extern "C" {
    pub fn cef_post_data_element_create() -> *mut cef_post_data_element_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_string_visitor_t {
    pub base: cef_base_ref_counted_t,
    pub visit: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_string_visitor_t, string: *const cef_string_t),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_string_visitor_t"][::std::mem::size_of::<_cef_string_visitor_t>() - 24usize];
    ["Alignment of _cef_string_visitor_t"]
        [::std::mem::align_of::<_cef_string_visitor_t>() - 4usize];
    ["Offset of field: _cef_string_visitor_t::base"]
        [::std::mem::offset_of!(_cef_string_visitor_t, base) - 0usize];
    ["Offset of field: _cef_string_visitor_t::visit"]
        [::std::mem::offset_of!(_cef_string_visitor_t, visit) - 20usize];
};
pub type cef_string_visitor_t = _cef_string_visitor_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlrequest_client_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlrequest_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_frame_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> ::std::os::raw::c_int,
    >,
    pub undo: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub redo: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub cut: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub copy: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub paste: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub paste_and_match_style:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub del: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub select_all: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub view_source: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_frame_t)>,
    pub get_source: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t, visitor: *mut _cef_string_visitor_t),
    >,
    pub get_text: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t, visitor: *mut _cef_string_visitor_t),
    >,
    pub load_request: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t, request: *mut _cef_request_t),
    >,
    pub load_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t, url: *const cef_string_t),
    >,
    pub execute_java_script: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_frame_t,
            code: *const cef_string_t,
            script_url: *const cef_string_t,
            start_line: ::std::os::raw::c_int,
        ),
    >,
    pub is_main: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> ::std::os::raw::c_int,
    >,
    pub is_focused: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> ::std::os::raw::c_int,
    >,
    pub get_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> cef_string_userfree_t,
    >,
    pub get_identifier: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> cef_string_userfree_t,
    >,
    pub get_parent: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> *mut _cef_frame_t,
    >,
    pub get_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> cef_string_userfree_t,
    >,
    pub get_browser: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> *mut _cef_browser_t,
    >,
    pub get_v8_context: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t) -> *mut _cef_v8_context_t,
    >,
    pub visit_dom: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_frame_t, visitor: *mut _cef_domvisitor_t),
    >,
    pub create_urlrequest: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_frame_t,
            request: *mut _cef_request_t,
            client: *mut _cef_urlrequest_client_t,
        ) -> *mut _cef_urlrequest_t,
    >,
    pub send_process_message: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_frame_t,
            target_process: cef_process_id_t::Type,
            message: *mut _cef_process_message_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_frame_t"][::std::mem::size_of::<_cef_frame_t>() - 124usize];
    ["Alignment of _cef_frame_t"][::std::mem::align_of::<_cef_frame_t>() - 4usize];
    ["Offset of field: _cef_frame_t::base"][::std::mem::offset_of!(_cef_frame_t, base) - 0usize];
    ["Offset of field: _cef_frame_t::is_valid"]
        [::std::mem::offset_of!(_cef_frame_t, is_valid) - 20usize];
    ["Offset of field: _cef_frame_t::undo"][::std::mem::offset_of!(_cef_frame_t, undo) - 24usize];
    ["Offset of field: _cef_frame_t::redo"][::std::mem::offset_of!(_cef_frame_t, redo) - 28usize];
    ["Offset of field: _cef_frame_t::cut"][::std::mem::offset_of!(_cef_frame_t, cut) - 32usize];
    ["Offset of field: _cef_frame_t::copy"][::std::mem::offset_of!(_cef_frame_t, copy) - 36usize];
    ["Offset of field: _cef_frame_t::paste"][::std::mem::offset_of!(_cef_frame_t, paste) - 40usize];
    ["Offset of field: _cef_frame_t::paste_and_match_style"]
        [::std::mem::offset_of!(_cef_frame_t, paste_and_match_style) - 44usize];
    ["Offset of field: _cef_frame_t::del"][::std::mem::offset_of!(_cef_frame_t, del) - 48usize];
    ["Offset of field: _cef_frame_t::select_all"]
        [::std::mem::offset_of!(_cef_frame_t, select_all) - 52usize];
    ["Offset of field: _cef_frame_t::view_source"]
        [::std::mem::offset_of!(_cef_frame_t, view_source) - 56usize];
    ["Offset of field: _cef_frame_t::get_source"]
        [::std::mem::offset_of!(_cef_frame_t, get_source) - 60usize];
    ["Offset of field: _cef_frame_t::get_text"]
        [::std::mem::offset_of!(_cef_frame_t, get_text) - 64usize];
    ["Offset of field: _cef_frame_t::load_request"]
        [::std::mem::offset_of!(_cef_frame_t, load_request) - 68usize];
    ["Offset of field: _cef_frame_t::load_url"]
        [::std::mem::offset_of!(_cef_frame_t, load_url) - 72usize];
    ["Offset of field: _cef_frame_t::execute_java_script"]
        [::std::mem::offset_of!(_cef_frame_t, execute_java_script) - 76usize];
    ["Offset of field: _cef_frame_t::is_main"]
        [::std::mem::offset_of!(_cef_frame_t, is_main) - 80usize];
    ["Offset of field: _cef_frame_t::is_focused"]
        [::std::mem::offset_of!(_cef_frame_t, is_focused) - 84usize];
    ["Offset of field: _cef_frame_t::get_name"]
        [::std::mem::offset_of!(_cef_frame_t, get_name) - 88usize];
    ["Offset of field: _cef_frame_t::get_identifier"]
        [::std::mem::offset_of!(_cef_frame_t, get_identifier) - 92usize];
    ["Offset of field: _cef_frame_t::get_parent"]
        [::std::mem::offset_of!(_cef_frame_t, get_parent) - 96usize];
    ["Offset of field: _cef_frame_t::get_url"]
        [::std::mem::offset_of!(_cef_frame_t, get_url) - 100usize];
    ["Offset of field: _cef_frame_t::get_browser"]
        [::std::mem::offset_of!(_cef_frame_t, get_browser) - 104usize];
    ["Offset of field: _cef_frame_t::get_v8_context"]
        [::std::mem::offset_of!(_cef_frame_t, get_v8_context) - 108usize];
    ["Offset of field: _cef_frame_t::visit_dom"]
        [::std::mem::offset_of!(_cef_frame_t, visit_dom) - 112usize];
    ["Offset of field: _cef_frame_t::create_urlrequest"]
        [::std::mem::offset_of!(_cef_frame_t, create_urlrequest) - 116usize];
    ["Offset of field: _cef_frame_t::send_process_message"]
        [::std::mem::offset_of!(_cef_frame_t, send_process_message) - 120usize];
};
pub type cef_frame_t = _cef_frame_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_x509_cert_principal_t {
    pub base: cef_base_ref_counted_t,
    pub get_display_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_cert_principal_t) -> cef_string_userfree_t,
    >,
    pub get_common_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_cert_principal_t) -> cef_string_userfree_t,
    >,
    pub get_locality_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_cert_principal_t) -> cef_string_userfree_t,
    >,
    pub get_state_or_province_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_cert_principal_t) -> cef_string_userfree_t,
    >,
    pub get_country_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_cert_principal_t) -> cef_string_userfree_t,
    >,
    pub get_organization_names: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_x509_cert_principal_t,
            names: cef_string_list_t,
        ),
    >,
    pub get_organization_unit_names: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_x509_cert_principal_t,
            names: cef_string_list_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_x509_cert_principal_t"]
        [::std::mem::size_of::<_cef_x509_cert_principal_t>() - 48usize];
    ["Alignment of _cef_x509_cert_principal_t"]
        [::std::mem::align_of::<_cef_x509_cert_principal_t>() - 4usize];
    ["Offset of field: _cef_x509_cert_principal_t::base"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, base) - 0usize];
    ["Offset of field: _cef_x509_cert_principal_t::get_display_name"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, get_display_name) - 20usize];
    ["Offset of field: _cef_x509_cert_principal_t::get_common_name"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, get_common_name) - 24usize];
    ["Offset of field: _cef_x509_cert_principal_t::get_locality_name"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, get_locality_name) - 28usize];
    ["Offset of field: _cef_x509_cert_principal_t::get_state_or_province_name"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, get_state_or_province_name) - 32usize];
    ["Offset of field: _cef_x509_cert_principal_t::get_country_name"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, get_country_name) - 36usize];
    ["Offset of field: _cef_x509_cert_principal_t::get_organization_names"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, get_organization_names) - 40usize];
    ["Offset of field: _cef_x509_cert_principal_t::get_organization_unit_names"]
        [::std::mem::offset_of!(_cef_x509_cert_principal_t, get_organization_unit_names) - 44usize];
};
pub type cef_x509_cert_principal_t = _cef_x509_cert_principal_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_x509_certificate_t {
    pub base: cef_base_ref_counted_t,
    pub get_subject: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_x509_certificate_t,
        ) -> *mut _cef_x509_cert_principal_t,
    >,
    pub get_issuer: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_x509_certificate_t,
        ) -> *mut _cef_x509_cert_principal_t,
    >,
    pub get_serial_number: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_certificate_t) -> *mut _cef_binary_value_t,
    >,
    pub get_valid_start: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_certificate_t) -> cef_basetime_t,
    >,
    pub get_valid_expiry: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_certificate_t) -> cef_basetime_t,
    >,
    pub get_derencoded: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_certificate_t) -> *mut _cef_binary_value_t,
    >,
    pub get_pemencoded: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_certificate_t) -> *mut _cef_binary_value_t,
    >,
    pub get_issuer_chain_size: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_x509_certificate_t) -> usize,
    >,
    pub get_derencoded_issuer_chain: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_x509_certificate_t,
            chainCount: *mut usize,
            chain: *mut *mut _cef_binary_value_t,
        ),
    >,
    pub get_pemencoded_issuer_chain: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_x509_certificate_t,
            chainCount: *mut usize,
            chain: *mut *mut _cef_binary_value_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_x509_certificate_t"][::std::mem::size_of::<_cef_x509_certificate_t>() - 60usize];
    ["Alignment of _cef_x509_certificate_t"]
        [::std::mem::align_of::<_cef_x509_certificate_t>() - 4usize];
    ["Offset of field: _cef_x509_certificate_t::base"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, base) - 0usize];
    ["Offset of field: _cef_x509_certificate_t::get_subject"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_subject) - 20usize];
    ["Offset of field: _cef_x509_certificate_t::get_issuer"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_issuer) - 24usize];
    ["Offset of field: _cef_x509_certificate_t::get_serial_number"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_serial_number) - 28usize];
    ["Offset of field: _cef_x509_certificate_t::get_valid_start"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_valid_start) - 32usize];
    ["Offset of field: _cef_x509_certificate_t::get_valid_expiry"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_valid_expiry) - 36usize];
    ["Offset of field: _cef_x509_certificate_t::get_derencoded"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_derencoded) - 40usize];
    ["Offset of field: _cef_x509_certificate_t::get_pemencoded"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_pemencoded) - 44usize];
    ["Offset of field: _cef_x509_certificate_t::get_issuer_chain_size"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_issuer_chain_size) - 48usize];
    ["Offset of field: _cef_x509_certificate_t::get_derencoded_issuer_chain"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_derencoded_issuer_chain) - 52usize];
    ["Offset of field: _cef_x509_certificate_t::get_pemencoded_issuer_chain"]
        [::std::mem::offset_of!(_cef_x509_certificate_t, get_pemencoded_issuer_chain) - 56usize];
};
pub type cef_x509_certificate_t = _cef_x509_certificate_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_sslstatus_t {
    pub base: cef_base_ref_counted_t,
    pub is_secure_connection: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_sslstatus_t) -> ::std::os::raw::c_int,
    >,
    pub get_cert_status: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_sslstatus_t) -> cef_cert_status_t::Type,
    >,
    pub get_sslversion: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_sslstatus_t) -> cef_ssl_version_t::Type,
    >,
    pub get_content_status: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_sslstatus_t) -> cef_ssl_content_status_t::Type,
    >,
    pub get_x509_certificate: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_sslstatus_t) -> *mut _cef_x509_certificate_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_sslstatus_t"][::std::mem::size_of::<_cef_sslstatus_t>() - 40usize];
    ["Alignment of _cef_sslstatus_t"][::std::mem::align_of::<_cef_sslstatus_t>() - 4usize];
    ["Offset of field: _cef_sslstatus_t::base"]
        [::std::mem::offset_of!(_cef_sslstatus_t, base) - 0usize];
    ["Offset of field: _cef_sslstatus_t::is_secure_connection"]
        [::std::mem::offset_of!(_cef_sslstatus_t, is_secure_connection) - 20usize];
    ["Offset of field: _cef_sslstatus_t::get_cert_status"]
        [::std::mem::offset_of!(_cef_sslstatus_t, get_cert_status) - 24usize];
    ["Offset of field: _cef_sslstatus_t::get_sslversion"]
        [::std::mem::offset_of!(_cef_sslstatus_t, get_sslversion) - 28usize];
    ["Offset of field: _cef_sslstatus_t::get_content_status"]
        [::std::mem::offset_of!(_cef_sslstatus_t, get_content_status) - 32usize];
    ["Offset of field: _cef_sslstatus_t::get_x509_certificate"]
        [::std::mem::offset_of!(_cef_sslstatus_t, get_x509_certificate) - 36usize];
};
pub type cef_sslstatus_t = _cef_sslstatus_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_navigation_entry_t {
    pub base: cef_base_ref_counted_t,
    pub is_valid: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> ::std::os::raw::c_int,
    >,
    pub get_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> cef_string_userfree_t,
    >,
    pub get_display_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> cef_string_userfree_t,
    >,
    pub get_original_url: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> cef_string_userfree_t,
    >,
    pub get_title: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> cef_string_userfree_t,
    >,
    pub get_transition_type: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_navigation_entry_t,
        ) -> cef_transition_type_t::Type,
    >,
    pub has_post_data: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> ::std::os::raw::c_int,
    >,
    pub get_completion_time: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> cef_basetime_t,
    >,
    pub get_http_status_code: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> ::std::os::raw::c_int,
    >,
    pub get_sslstatus: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_navigation_entry_t) -> *mut _cef_sslstatus_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_navigation_entry_t"][::std::mem::size_of::<_cef_navigation_entry_t>() - 60usize];
    ["Alignment of _cef_navigation_entry_t"]
        [::std::mem::align_of::<_cef_navigation_entry_t>() - 4usize];
    ["Offset of field: _cef_navigation_entry_t::base"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, base) - 0usize];
    ["Offset of field: _cef_navigation_entry_t::is_valid"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, is_valid) - 20usize];
    ["Offset of field: _cef_navigation_entry_t::get_url"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_url) - 24usize];
    ["Offset of field: _cef_navigation_entry_t::get_display_url"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_display_url) - 28usize];
    ["Offset of field: _cef_navigation_entry_t::get_original_url"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_original_url) - 32usize];
    ["Offset of field: _cef_navigation_entry_t::get_title"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_title) - 36usize];
    ["Offset of field: _cef_navigation_entry_t::get_transition_type"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_transition_type) - 40usize];
    ["Offset of field: _cef_navigation_entry_t::has_post_data"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, has_post_data) - 44usize];
    ["Offset of field: _cef_navigation_entry_t::get_completion_time"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_completion_time) - 48usize];
    ["Offset of field: _cef_navigation_entry_t::get_http_status_code"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_http_status_code) - 52usize];
    ["Offset of field: _cef_navigation_entry_t::get_sslstatus"]
        [::std::mem::offset_of!(_cef_navigation_entry_t, get_sslstatus) - 56usize];
};
pub type cef_navigation_entry_t = _cef_navigation_entry_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_registration_t {
    pub base: cef_base_ref_counted_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_registration_t"][::std::mem::size_of::<_cef_registration_t>() - 20usize];
    ["Alignment of _cef_registration_t"][::std::mem::align_of::<_cef_registration_t>() - 4usize];
    ["Offset of field: _cef_registration_t::base"]
        [::std::mem::offset_of!(_cef_registration_t, base) - 0usize];
};
pub type cef_registration_t = _cef_registration_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_callback_t {
    pub base: cef_base_ref_counted_t,
    pub cont: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_callback_t)>,
    pub cancel: ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_callback_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_callback_t"][::std::mem::size_of::<_cef_callback_t>() - 28usize];
    ["Alignment of _cef_callback_t"][::std::mem::align_of::<_cef_callback_t>() - 4usize];
    ["Offset of field: _cef_callback_t::base"]
        [::std::mem::offset_of!(_cef_callback_t, base) - 0usize];
    ["Offset of field: _cef_callback_t::cont"]
        [::std::mem::offset_of!(_cef_callback_t, cont) - 20usize];
    ["Offset of field: _cef_callback_t::cancel"]
        [::std::mem::offset_of!(_cef_callback_t, cancel) - 24usize];
};
pub type cef_callback_t = _cef_callback_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_completion_callback_t {
    pub base: cef_base_ref_counted_t,
    pub on_complete:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_completion_callback_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_completion_callback_t"]
        [::std::mem::size_of::<_cef_completion_callback_t>() - 24usize];
    ["Alignment of _cef_completion_callback_t"]
        [::std::mem::align_of::<_cef_completion_callback_t>() - 4usize];
    ["Offset of field: _cef_completion_callback_t::base"]
        [::std::mem::offset_of!(_cef_completion_callback_t, base) - 0usize];
    ["Offset of field: _cef_completion_callback_t::on_complete"]
        [::std::mem::offset_of!(_cef_completion_callback_t, on_complete) - 20usize];
};
pub type cef_completion_callback_t = _cef_completion_callback_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_cookie_manager_t {
    pub base: cef_base_ref_counted_t,
    pub visit_all_cookies: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_cookie_manager_t,
            visitor: *mut _cef_cookie_visitor_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub visit_url_cookies: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_cookie_manager_t,
            url: *const cef_string_t,
            includeHttpOnly: ::std::os::raw::c_int,
            visitor: *mut _cef_cookie_visitor_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_cookie: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_cookie_manager_t,
            url: *const cef_string_t,
            cookie: *const _cef_cookie_t,
            callback: *mut _cef_set_cookie_callback_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub delete_cookies: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_cookie_manager_t,
            url: *const cef_string_t,
            cookie_name: *const cef_string_t,
            callback: *mut _cef_delete_cookies_callback_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub flush_store: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_cookie_manager_t,
            callback: *mut _cef_completion_callback_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_cookie_manager_t"][::std::mem::size_of::<_cef_cookie_manager_t>() - 40usize];
    ["Alignment of _cef_cookie_manager_t"]
        [::std::mem::align_of::<_cef_cookie_manager_t>() - 4usize];
    ["Offset of field: _cef_cookie_manager_t::base"]
        [::std::mem::offset_of!(_cef_cookie_manager_t, base) - 0usize];
    ["Offset of field: _cef_cookie_manager_t::visit_all_cookies"]
        [::std::mem::offset_of!(_cef_cookie_manager_t, visit_all_cookies) - 20usize];
    ["Offset of field: _cef_cookie_manager_t::visit_url_cookies"]
        [::std::mem::offset_of!(_cef_cookie_manager_t, visit_url_cookies) - 24usize];
    ["Offset of field: _cef_cookie_manager_t::set_cookie"]
        [::std::mem::offset_of!(_cef_cookie_manager_t, set_cookie) - 28usize];
    ["Offset of field: _cef_cookie_manager_t::delete_cookies"]
        [::std::mem::offset_of!(_cef_cookie_manager_t, delete_cookies) - 32usize];
    ["Offset of field: _cef_cookie_manager_t::flush_store"]
        [::std::mem::offset_of!(_cef_cookie_manager_t, flush_store) - 36usize];
};
pub type cef_cookie_manager_t = _cef_cookie_manager_t;
unsafe extern "C" {
    pub fn cef_cookie_manager_get_global_manager(
        callback: *mut _cef_completion_callback_t,
    ) -> *mut cef_cookie_manager_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_cookie_visitor_t {
    pub base: cef_base_ref_counted_t,
    pub visit: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_cookie_visitor_t,
            cookie: *const _cef_cookie_t,
            count: ::std::os::raw::c_int,
            total: ::std::os::raw::c_int,
            deleteCookie: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_cookie_visitor_t"][::std::mem::size_of::<_cef_cookie_visitor_t>() - 24usize];
    ["Alignment of _cef_cookie_visitor_t"]
        [::std::mem::align_of::<_cef_cookie_visitor_t>() - 4usize];
    ["Offset of field: _cef_cookie_visitor_t::base"]
        [::std::mem::offset_of!(_cef_cookie_visitor_t, base) - 0usize];
    ["Offset of field: _cef_cookie_visitor_t::visit"]
        [::std::mem::offset_of!(_cef_cookie_visitor_t, visit) - 20usize];
};
pub type cef_cookie_visitor_t = _cef_cookie_visitor_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_set_cookie_callback_t {
    pub base: cef_base_ref_counted_t,
    pub on_complete: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_set_cookie_callback_t,
            success: ::std::os::raw::c_int,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_set_cookie_callback_t"]
        [::std::mem::size_of::<_cef_set_cookie_callback_t>() - 24usize];
    ["Alignment of _cef_set_cookie_callback_t"]
        [::std::mem::align_of::<_cef_set_cookie_callback_t>() - 4usize];
    ["Offset of field: _cef_set_cookie_callback_t::base"]
        [::std::mem::offset_of!(_cef_set_cookie_callback_t, base) - 0usize];
    ["Offset of field: _cef_set_cookie_callback_t::on_complete"]
        [::std::mem::offset_of!(_cef_set_cookie_callback_t, on_complete) - 20usize];
};
pub type cef_set_cookie_callback_t = _cef_set_cookie_callback_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_delete_cookies_callback_t {
    pub base: cef_base_ref_counted_t,
    pub on_complete: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_delete_cookies_callback_t,
            num_deleted: ::std::os::raw::c_int,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_delete_cookies_callback_t"]
        [::std::mem::size_of::<_cef_delete_cookies_callback_t>() - 24usize];
    ["Alignment of _cef_delete_cookies_callback_t"]
        [::std::mem::align_of::<_cef_delete_cookies_callback_t>() - 4usize];
    ["Offset of field: _cef_delete_cookies_callback_t::base"]
        [::std::mem::offset_of!(_cef_delete_cookies_callback_t, base) - 0usize];
    ["Offset of field: _cef_delete_cookies_callback_t::on_complete"]
        [::std::mem::offset_of!(_cef_delete_cookies_callback_t, on_complete) - 20usize];
};
pub type cef_delete_cookies_callback_t = _cef_delete_cookies_callback_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_media_router_t {
    pub base: cef_base_ref_counted_t,
    pub add_observer: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_router_t,
            observer: *mut _cef_media_observer_t,
        ) -> *mut _cef_registration_t,
    >,
    pub get_source: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_router_t,
            urn: *const cef_string_t,
        ) -> *mut _cef_media_source_t,
    >,
    pub notify_current_sinks:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_media_router_t)>,
    pub create_route: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_router_t,
            source: *mut _cef_media_source_t,
            sink: *mut _cef_media_sink_t,
            callback: *mut _cef_media_route_create_callback_t,
        ),
    >,
    pub notify_current_routes:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_media_router_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_router_t"][::std::mem::size_of::<_cef_media_router_t>() - 40usize];
    ["Alignment of _cef_media_router_t"][::std::mem::align_of::<_cef_media_router_t>() - 4usize];
    ["Offset of field: _cef_media_router_t::base"]
        [::std::mem::offset_of!(_cef_media_router_t, base) - 0usize];
    ["Offset of field: _cef_media_router_t::add_observer"]
        [::std::mem::offset_of!(_cef_media_router_t, add_observer) - 20usize];
    ["Offset of field: _cef_media_router_t::get_source"]
        [::std::mem::offset_of!(_cef_media_router_t, get_source) - 24usize];
    ["Offset of field: _cef_media_router_t::notify_current_sinks"]
        [::std::mem::offset_of!(_cef_media_router_t, notify_current_sinks) - 28usize];
    ["Offset of field: _cef_media_router_t::create_route"]
        [::std::mem::offset_of!(_cef_media_router_t, create_route) - 32usize];
    ["Offset of field: _cef_media_router_t::notify_current_routes"]
        [::std::mem::offset_of!(_cef_media_router_t, notify_current_routes) - 36usize];
};
pub type cef_media_router_t = _cef_media_router_t;
unsafe extern "C" {
    pub fn cef_media_router_get_global(
        callback: *mut _cef_completion_callback_t,
    ) -> *mut cef_media_router_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_media_observer_t {
    pub base: cef_base_ref_counted_t,
    pub on_sinks: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_observer_t,
            sinksCount: usize,
            sinks: *const *mut _cef_media_sink_t,
        ),
    >,
    pub on_routes: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_observer_t,
            routesCount: usize,
            routes: *const *mut _cef_media_route_t,
        ),
    >,
    pub on_route_state_changed: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_observer_t,
            route: *mut _cef_media_route_t,
            state: cef_media_route_connection_state_t::Type,
        ),
    >,
    pub on_route_message_received: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_observer_t,
            route: *mut _cef_media_route_t,
            message: *const ::std::os::raw::c_void,
            message_size: usize,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_observer_t"][::std::mem::size_of::<_cef_media_observer_t>() - 36usize];
    ["Alignment of _cef_media_observer_t"]
        [::std::mem::align_of::<_cef_media_observer_t>() - 4usize];
    ["Offset of field: _cef_media_observer_t::base"]
        [::std::mem::offset_of!(_cef_media_observer_t, base) - 0usize];
    ["Offset of field: _cef_media_observer_t::on_sinks"]
        [::std::mem::offset_of!(_cef_media_observer_t, on_sinks) - 20usize];
    ["Offset of field: _cef_media_observer_t::on_routes"]
        [::std::mem::offset_of!(_cef_media_observer_t, on_routes) - 24usize];
    ["Offset of field: _cef_media_observer_t::on_route_state_changed"]
        [::std::mem::offset_of!(_cef_media_observer_t, on_route_state_changed) - 28usize];
    ["Offset of field: _cef_media_observer_t::on_route_message_received"]
        [::std::mem::offset_of!(_cef_media_observer_t, on_route_message_received) - 32usize];
};
pub type cef_media_observer_t = _cef_media_observer_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_media_route_t {
    pub base: cef_base_ref_counted_t,
    pub get_id: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_route_t) -> cef_string_userfree_t,
    >,
    pub get_source: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_route_t) -> *mut _cef_media_source_t,
    >,
    pub get_sink: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_route_t) -> *mut _cef_media_sink_t,
    >,
    pub send_route_message: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_route_t,
            message: *const ::std::os::raw::c_void,
            message_size: usize,
        ),
    >,
    pub terminate:
        ::std::option::Option<unsafe extern "system" fn(self_: *mut _cef_media_route_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_route_t"][::std::mem::size_of::<_cef_media_route_t>() - 40usize];
    ["Alignment of _cef_media_route_t"][::std::mem::align_of::<_cef_media_route_t>() - 4usize];
    ["Offset of field: _cef_media_route_t::base"]
        [::std::mem::offset_of!(_cef_media_route_t, base) - 0usize];
    ["Offset of field: _cef_media_route_t::get_id"]
        [::std::mem::offset_of!(_cef_media_route_t, get_id) - 20usize];
    ["Offset of field: _cef_media_route_t::get_source"]
        [::std::mem::offset_of!(_cef_media_route_t, get_source) - 24usize];
    ["Offset of field: _cef_media_route_t::get_sink"]
        [::std::mem::offset_of!(_cef_media_route_t, get_sink) - 28usize];
    ["Offset of field: _cef_media_route_t::send_route_message"]
        [::std::mem::offset_of!(_cef_media_route_t, send_route_message) - 32usize];
    ["Offset of field: _cef_media_route_t::terminate"]
        [::std::mem::offset_of!(_cef_media_route_t, terminate) - 36usize];
};
pub type cef_media_route_t = _cef_media_route_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_media_route_create_callback_t {
    pub base: cef_base_ref_counted_t,
    pub on_media_route_create_finished: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_route_create_callback_t,
            result: cef_media_route_create_result_t::Type,
            error: *const cef_string_t,
            route: *mut _cef_media_route_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_route_create_callback_t"]
        [::std::mem::size_of::<_cef_media_route_create_callback_t>() - 24usize];
    ["Alignment of _cef_media_route_create_callback_t"]
        [::std::mem::align_of::<_cef_media_route_create_callback_t>() - 4usize];
    ["Offset of field: _cef_media_route_create_callback_t::base"]
        [::std::mem::offset_of!(_cef_media_route_create_callback_t, base) - 0usize];
    ["Offset of field: _cef_media_route_create_callback_t::on_media_route_create_finished"][::std::mem::offset_of!(
        _cef_media_route_create_callback_t,
        on_media_route_create_finished
    )
        - 20usize];
};
pub type cef_media_route_create_callback_t = _cef_media_route_create_callback_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_media_sink_t {
    pub base: cef_base_ref_counted_t,
    pub get_id: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_sink_t) -> cef_string_userfree_t,
    >,
    pub get_name: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_sink_t) -> cef_string_userfree_t,
    >,
    pub get_icon_type: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_sink_t,
        ) -> cef_media_sink_icon_type_t::Type,
    >,
    pub get_device_info: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_sink_t,
            callback: *mut _cef_media_sink_device_info_callback_t,
        ),
    >,
    pub is_cast_sink: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_sink_t) -> ::std::os::raw::c_int,
    >,
    pub is_dial_sink: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_sink_t) -> ::std::os::raw::c_int,
    >,
    pub is_compatible_with: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_sink_t,
            source: *mut _cef_media_source_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_sink_t"][::std::mem::size_of::<_cef_media_sink_t>() - 48usize];
    ["Alignment of _cef_media_sink_t"][::std::mem::align_of::<_cef_media_sink_t>() - 4usize];
    ["Offset of field: _cef_media_sink_t::base"]
        [::std::mem::offset_of!(_cef_media_sink_t, base) - 0usize];
    ["Offset of field: _cef_media_sink_t::get_id"]
        [::std::mem::offset_of!(_cef_media_sink_t, get_id) - 20usize];
    ["Offset of field: _cef_media_sink_t::get_name"]
        [::std::mem::offset_of!(_cef_media_sink_t, get_name) - 24usize];
    ["Offset of field: _cef_media_sink_t::get_icon_type"]
        [::std::mem::offset_of!(_cef_media_sink_t, get_icon_type) - 28usize];
    ["Offset of field: _cef_media_sink_t::get_device_info"]
        [::std::mem::offset_of!(_cef_media_sink_t, get_device_info) - 32usize];
    ["Offset of field: _cef_media_sink_t::is_cast_sink"]
        [::std::mem::offset_of!(_cef_media_sink_t, is_cast_sink) - 36usize];
    ["Offset of field: _cef_media_sink_t::is_dial_sink"]
        [::std::mem::offset_of!(_cef_media_sink_t, is_dial_sink) - 40usize];
    ["Offset of field: _cef_media_sink_t::is_compatible_with"]
        [::std::mem::offset_of!(_cef_media_sink_t, is_compatible_with) - 44usize];
};
pub type cef_media_sink_t = _cef_media_sink_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_media_sink_device_info_callback_t {
    pub base: cef_base_ref_counted_t,
    pub on_media_sink_device_info: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_media_sink_device_info_callback_t,
            device_info: *const _cef_media_sink_device_info_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_sink_device_info_callback_t"]
        [::std::mem::size_of::<_cef_media_sink_device_info_callback_t>() - 24usize];
    ["Alignment of _cef_media_sink_device_info_callback_t"]
        [::std::mem::align_of::<_cef_media_sink_device_info_callback_t>() - 4usize];
    ["Offset of field: _cef_media_sink_device_info_callback_t::base"]
        [::std::mem::offset_of!(_cef_media_sink_device_info_callback_t, base) - 0usize];
    ["Offset of field: _cef_media_sink_device_info_callback_t::on_media_sink_device_info"][::std::mem::offset_of!(
        _cef_media_sink_device_info_callback_t,
        on_media_sink_device_info
    )
        - 20usize];
};
pub type cef_media_sink_device_info_callback_t = _cef_media_sink_device_info_callback_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_media_source_t {
    pub base: cef_base_ref_counted_t,
    pub get_id: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_source_t) -> cef_string_userfree_t,
    >,
    pub is_cast_source: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_source_t) -> ::std::os::raw::c_int,
    >,
    pub is_dial_source: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_media_source_t) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_media_source_t"][::std::mem::size_of::<_cef_media_source_t>() - 32usize];
    ["Alignment of _cef_media_source_t"][::std::mem::align_of::<_cef_media_source_t>() - 4usize];
    ["Offset of field: _cef_media_source_t::base"]
        [::std::mem::offset_of!(_cef_media_source_t, base) - 0usize];
    ["Offset of field: _cef_media_source_t::get_id"]
        [::std::mem::offset_of!(_cef_media_source_t, get_id) - 20usize];
    ["Offset of field: _cef_media_source_t::is_cast_source"]
        [::std::mem::offset_of!(_cef_media_source_t, is_cast_source) - 24usize];
    ["Offset of field: _cef_media_source_t::is_dial_source"]
        [::std::mem::offset_of!(_cef_media_source_t, is_dial_source) - 28usize];
};
pub type cef_media_source_t = _cef_media_source_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_preference_registrar_t {
    pub base: cef_base_scoped_t,
    pub add_preference: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_registrar_t,
            name: *const cef_string_t,
            default_value: *mut _cef_value_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_preference_registrar_t"]
        [::std::mem::size_of::<_cef_preference_registrar_t>() - 12usize];
    ["Alignment of _cef_preference_registrar_t"]
        [::std::mem::align_of::<_cef_preference_registrar_t>() - 4usize];
    ["Offset of field: _cef_preference_registrar_t::base"]
        [::std::mem::offset_of!(_cef_preference_registrar_t, base) - 0usize];
    ["Offset of field: _cef_preference_registrar_t::add_preference"]
        [::std::mem::offset_of!(_cef_preference_registrar_t, add_preference) - 8usize];
};
pub type cef_preference_registrar_t = _cef_preference_registrar_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_preference_observer_t {
    pub base: cef_base_ref_counted_t,
    pub on_preference_changed: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_observer_t,
            name: *const cef_string_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_preference_observer_t"]
        [::std::mem::size_of::<_cef_preference_observer_t>() - 24usize];
    ["Alignment of _cef_preference_observer_t"]
        [::std::mem::align_of::<_cef_preference_observer_t>() - 4usize];
    ["Offset of field: _cef_preference_observer_t::base"]
        [::std::mem::offset_of!(_cef_preference_observer_t, base) - 0usize];
    ["Offset of field: _cef_preference_observer_t::on_preference_changed"]
        [::std::mem::offset_of!(_cef_preference_observer_t, on_preference_changed) - 20usize];
};
pub type cef_preference_observer_t = _cef_preference_observer_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_preference_manager_t {
    pub base: cef_base_ref_counted_t,
    pub has_preference: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_manager_t,
            name: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub get_preference: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_manager_t,
            name: *const cef_string_t,
        ) -> *mut _cef_value_t,
    >,
    pub get_all_preferences: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_manager_t,
            include_defaults: ::std::os::raw::c_int,
        ) -> *mut _cef_dictionary_value_t,
    >,
    pub can_set_preference: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_manager_t,
            name: *const cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub set_preference: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_manager_t,
            name: *const cef_string_t,
            value: *mut _cef_value_t,
            error: *mut cef_string_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub add_preference_observer: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_preference_manager_t,
            name: *const cef_string_t,
            observer: *mut _cef_preference_observer_t,
        ) -> *mut _cef_registration_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_preference_manager_t"]
        [::std::mem::size_of::<_cef_preference_manager_t>() - 44usize];
    ["Alignment of _cef_preference_manager_t"]
        [::std::mem::align_of::<_cef_preference_manager_t>() - 4usize];
    ["Offset of field: _cef_preference_manager_t::base"]
        [::std::mem::offset_of!(_cef_preference_manager_t, base) - 0usize];
    ["Offset of field: _cef_preference_manager_t::has_preference"]
        [::std::mem::offset_of!(_cef_preference_manager_t, has_preference) - 20usize];
    ["Offset of field: _cef_preference_manager_t::get_preference"]
        [::std::mem::offset_of!(_cef_preference_manager_t, get_preference) - 24usize];
    ["Offset of field: _cef_preference_manager_t::get_all_preferences"]
        [::std::mem::offset_of!(_cef_preference_manager_t, get_all_preferences) - 28usize];
    ["Offset of field: _cef_preference_manager_t::can_set_preference"]
        [::std::mem::offset_of!(_cef_preference_manager_t, can_set_preference) - 32usize];
    ["Offset of field: _cef_preference_manager_t::set_preference"]
        [::std::mem::offset_of!(_cef_preference_manager_t, set_preference) - 36usize];
    ["Offset of field: _cef_preference_manager_t::add_preference_observer"]
        [::std::mem::offset_of!(_cef_preference_manager_t, add_preference_observer) - 40usize];
};
pub type cef_preference_manager_t = _cef_preference_manager_t;
unsafe extern "C" {
    pub fn cef_preference_manager_get_chrome_variations_as_switches(switches: cef_string_list_t);
}
unsafe extern "C" {
    pub fn cef_preference_manager_get_chrome_variations_as_strings(strings: cef_string_list_t);
}
unsafe extern "C" {
    pub fn cef_preference_manager_get_global() -> *mut cef_preference_manager_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_resolve_callback_t {
    pub base: cef_base_ref_counted_t,
    pub on_resolve_completed: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_resolve_callback_t,
            result: cef_errorcode_t::Type,
            resolved_ips: cef_string_list_t,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_resolve_callback_t"][::std::mem::size_of::<_cef_resolve_callback_t>() - 24usize];
    ["Alignment of _cef_resolve_callback_t"]
        [::std::mem::align_of::<_cef_resolve_callback_t>() - 4usize];
    ["Offset of field: _cef_resolve_callback_t::base"]
        [::std::mem::offset_of!(_cef_resolve_callback_t, base) - 0usize];
    ["Offset of field: _cef_resolve_callback_t::on_resolve_completed"]
        [::std::mem::offset_of!(_cef_resolve_callback_t, on_resolve_completed) - 20usize];
};
pub type cef_resolve_callback_t = _cef_resolve_callback_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_setting_observer_t {
    pub base: cef_base_ref_counted_t,
    pub on_setting_changed: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_setting_observer_t,
            requesting_url: *const cef_string_t,
            top_level_url: *const cef_string_t,
            content_type: cef_content_setting_types_t::Type,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cef_setting_observer_t"][::std::mem::size_of::<_cef_setting_observer_t>() - 24usize];
    ["Alignment of _cef_setting_observer_t"]
        [::std::mem::align_of::<_cef_setting_observer_t>() - 4usize];
    ["Offset of field: _cef_setting_observer_t::base"]
        [::std::mem::offset_of!(_cef_setting_observer_t, base) - 0usize];
    ["Offset of field: _cef_setting_observer_t::on_setting_changed"]
        [::std::mem::offset_of!(_cef_setting_observer_t, on_setting_changed) - 20usize];
};
pub type cef_setting_observer_t = _cef_setting_observer_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cef_request_context_t {
    pub base: cef_preference_manager_t,
    pub is_same: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            other: *mut _cef_request_context_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub is_sharing_with: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            other: *mut _cef_request_context_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub is_global: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_context_t) -> ::std::os::raw::c_int,
    >,
    pub get_handler: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
        ) -> *mut _cef_request_context_handler_t,
    >,
    pub get_cache_path: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_context_t) -> cef_string_userfree_t,
    >,
    pub get_cookie_manager: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            callback: *mut _cef_completion_callback_t,
        ) -> *mut _cef_cookie_manager_t,
    >,
    pub register_scheme_handler_factory: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            scheme_name: *const cef_string_t,
            domain_name: *const cef_string_t,
            factory: *mut _cef_scheme_handler_factory_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub clear_scheme_handler_factories: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_context_t) -> ::std::os::raw::c_int,
    >,
    pub clear_certificate_exceptions: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            callback: *mut _cef_completion_callback_t,
        ),
    >,
    pub clear_http_auth_credentials: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            callback: *mut _cef_completion_callback_t,
        ),
    >,
    pub close_all_connections: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            callback: *mut _cef_completion_callback_t,
        ),
    >,
    pub resolve_host: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            origin: *const cef_string_t,
            callback: *mut _cef_resolve_callback_t,
        ),
    >,
    pub get_media_router: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            callback: *mut _cef_completion_callback_t,
        ) -> *mut _cef_media_router_t,
    >,
    pub get_website_setting: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            requesting_url: *const cef_string_t,
            top_level_url: *const cef_string_t,
            content_type: cef_content_setting_types_t::Type,
        ) -> *mut _cef_value_t,
    >,
    pub set_website_setting: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            requesting_url: *const cef_string_t,
            top_level_url: *const cef_string_t,
            content_type: cef_content_setting_types_t::Type,
            value: *mut _cef_value_t,
        ),
    >,
    pub get_content_setting: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            requesting_url: *const cef_string_t,
            top_level_url: *const cef_string_t,
            content_type: cef_content_setting_types_t::Type,
        ) -> cef_content_setting_values_t::Type,
    >,
    pub set_content_setting: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            requesting_url: *const cef_string_t,
            top_level_url: *const cef_string_t,
            content_type: cef_content_setting_types_t::Type,
            value: cef_content_setting_values_t::Type,
        ),
    >,
    pub set_chrome_color_scheme: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
            variant: cef_color_variant_t::Type,
            user_color: cef_color_t,
        ),
    >,
    pub get_chrome_color_scheme_mode: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_context_t) -> cef_color_variant_t::Type,
    >,
    pub get_chrome_color_scheme_color: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_context_t) -> cef_color_t,
    >,
    pub get_chrome_color_scheme_variant: ::std::option::Option<
        unsafe extern "system" fn(self_: *mut _cef_request_context_t) -> cef_color_variant_t::Type,
    >,
    pub add_setting_observer: ::std::option::Option<
        unsafe extern "system" fn(
            self_: *mut _cef_request_context_t,
